{"0":{"Art":"Explore your talents in the midst of critical dialogue, freedom, and discovery. Study in the context of a Christian community of scholars who, with curiosity and conviction, strive to live out grace and truth. The Art major focuses on thinking and doing in concert. With its studio and historical components, courses are designed to equip students with skills, habits, and knowledge to be discerning, faithful participants in the art world and in the visual culture of today. Since we see spiritual, intellectual, and creative maturity as a unified whole, we strive to model this synthesis in our own art-making, research, and teaching endeavors. We also expect our students to cultivate a desire for learning, and to bring a Christian sensibility to all aspects of art-making and viewing.","Art History":"Explore your talents in the midst of critical dialogue, freedom, and discovery. Study in the context of a Christian community of scholars who, with curiosity and conviction, strive to live out grace and truth. The Art major focuses on thinking and doing in concert. With its studio and historical components, courses are designed to equip students with skills, habits, and knowledge to be discerning, faithful participants in the art world and in the visual culture of today. Since we see spiritual, intellectual, and creative maturity as a unified whole, we strive to model this synthesis in our own art-making, research, and teaching endeavors. We also expect our students to cultivate a desire for learning, and to bring a Christian sensibility to all aspects of art-making and viewing.","Biology":"Work closely with Christian professors who introduce you to creative and rigorous scientific investigation in a classroom that includes the mountains, the coast and the Channel Islands. Through coursework and independent research, you learn laboratory techniques and field methods. You may even conduct advanced research with faculty and fellow students. Professors integrate biology and faith and discuss issues related to science, ethics and culture. Rigorous study combined with personal attention prepares you for rewarding and challenging work in the lab and the environmental, biotech and health fields.","Chemistry":"In small classes, you work closely with professors who care deeply about you and your future. Demanding courses and a range of tracks help students think like a scientist and discover what it means to work in a lab. Chemistry majors undertake research with personal guidance from professors, and many spend 10 weeks in an intensive summer research program. Renovated labs and state-of-the-art instrumentation set Westmont's program apart and give graduates an advantage in finding jobs or getting into graduate school. You receive a first-rate education in chemistry from Christian professors who integrate faith and learning and prepare you for meaningful work.The mission of the chemistry department at Westmont College is to provide a nationally competitive chemistry program that helps students become competent, thoughtful, and theologically reflective scientists, teachers, health-care providers, and citizens of our world.","Communication Studies":"Develop into a wise analyst of human influence in a globally-oriented, media-saturated culture. Explore the difficulty of interpersonal faithfulness in a transient culture, the increasing power of the media, and the role of persuasion and propaganda in social movements. Study verbal and nonverbal aspects of oral, print and electronic messages and discuss questions such as: How do messages lead to meaning—or misunderstanding or manipulation? How has public discourse influenced culture? What are the effects of image-based communication?","Computer Science":"Consider a major in computer science, the formal study of abstract problem-solving. Computers permeate every facet of our society, so more and more careers relate to them: bioinformatics, cognitive science, digital media arts, neuroscience, artificial intelligence, computer graphics, management information systems, human-computer interaction, and intellectual property law. In fact, all fields and organizations welcome the talents of properly trained computer scientists. Learn how to organize and communicate information, use algorithms, procedures or formulas for solving problems, and work with a team to find practical applications.","Data Analytics":" Professors in the mathematics, computer science, and economics and business departments collaborated in creating this interdisciplinary major in the context of a liberal arts program to provide a more humanistic perspective. Your study begins with a foundation in calculus, statistics, research and forecasting, microeconomics or accounting, computational problems, and concrete systems, and then moves into classes on database design, machine learning, management science and game theory. Employers increasingly seek graduates with expertise in data analytics. ","Economics and Business":"Our student-centric approach and collaborative, friendly environment provide a healthy blend of quantitative analysis and economic theory with practical application in the marketplace. You gain information and expertise that make you a better contributor and communicator and prepare you for fascinating and gratifying business careers. You’ll work closely with professors and explore the often-challenging intersection of faith, learning and business. Successful Westmont alumni provide you with valuable networking, internships and mentoring, helping you discover, develop and use your God-given talents. Our graduates have become leaders in a wide range of industries worldwide, from Fortune 500 companies to Silicon Valley start-ups to non-profit organizations. ","Engineering":"Deeply grounded in the liberal arts, our new engineering program blends a mix of courses in engineering, physics, mathematics, and chemistry. We seek to equip our graduates to find innovative solutions to enduring problems by cultivating collaboration, problem-solving and moral discernment. Increasingly, solutions to local and global challenges require insights from engineers, especially when addressing social mobility, caring for the environment, reducing poverty and promoting human welfare. Our graduates will benefit from thorough technical and scientific training and the interdisciplinary sensitivity and moral imagination of the Christian liberal arts. We've embraced the challenge from the National Science Foundation to prepare adaptive engineers committed to blending science, engineering and the arts. Westmont Engineering is distinctive in many ways. Our program is built around three pillars:Excellence in technical engineering training learned in small classes, focused on hands-on active learning, with professors that are very engaged with their studentsIntegration of Engineering Design and Innovation throughout the curriculumA solid Christian liberal arts foundationWestmont Engineering grants a BS in General Engineering that provides the largest set of possibilities for specialization, job opportunities and graduate school options. Our curriculum starts with our Christian liberal arts core and then combines a solid math and science foundation with in-depth content in all the critical technical areas of engineering. Our small class sizes (average engineering class size is about 10 students) are taught by Christian faculty who are experts in their fields. The small class sizes provide great opportunities for “learning by doing”, where we emphasize hands-on, design-oriented experiences that make the technical content come to life. In addition, the small classes allow you to really get to know your professors.Our focus on engineering design and on innovation also distinguishes our program. Design is what differentiates engineering from other technical disciplines. Engineers create (design) products, processes and services to help people. This fits seamlessly into our Christian distinctiveness as we endeavor to love people by designing to help them live better lives. Westmont engineering has multiple courses where Design Innovation (DI) plays a central role. These courses include the first-year class “Engineering and the Liberal Arts”, the “Junior Design” class which focuses on designing to serve others and the 2-semester Senior Capstone Design courses where we work on industry sponsored projects. In addition, the Westmont Engineering curriculum weaves DI throughout the engineering curriculum by including mini design experiences that use the technical content for that course in a design experience.The Christian liberal arts foundation of our engineering program provides a wonderful base for our engineering graduates to excel in their careers. While engineering practice requires great technical competence, engineering industry is increasingly demanding the thoughtfulness and skill set that a Christian liberal arts emphasis provides. Skills such as leadership, teamwork, conflict management skills, interpersonal skills, empathy and negotiation, as well as written and oral communication skills are seen as critical for successful engineering work.Westmont Engineering works to integrate our professional endeavors with our faith experience. This is especially true as we creatively design things that help improve people’s lives. As Christian engineers, this aligns with Christ’s command to “love others as ourselves” (Matt. 22:39).  In particular, our junior design course has an emphasis on “designing for service”.Engineering graduates have tremendous opportunities across a broad range of possibilities. Engineers have opportunities in industries such as design, energy, sustainability, environmental resources, robotics, automation, vehicle design, aeronautics, space, manufacturing and internet of things (IoT). International opportunities are available both during the time at Westmont and after graduation. Opportunities for females and ethnic minorities are especially abundant. In addition to all the engineering-specific highlights of the Westmont Engineering program detailed above, our students have the privilege of living in beautiful Santa Barbara, CA. Living just minutes from both the beach and the mountains is quite a thrill! Being just far enough from Los Angeles to avoid the traffic, but close enough to go enjoy the big city when you want to, is also wonderful.Designing a Strong and Innovative Engineering ProgramProposed Building to House Engineering","Engineering Physics":"Physicists seek a fundamental understanding of the physical universe. Engineers apply scientific knowledge to design and develop structures, machines and products. Students may pursue the engineering physics major with an emphasis in either area. The physics emphasis stresses fundamental science and mathematics essential for graduate study or professional work in physics. The engineering emphasis, while not a formal engineering program, provides a strong conceptual base for an engineering career. In addition the 3-2 dual-degree program allows for a full engineering program.","English":"Go beyond required composition and literature courses into a department rich in writing and globally conscious literary study. Join a Westmont professor and 24 classmates for a semester in England, where literature comes alive in context. Be transformed by close encounters with novels, poems, short stories, plays, and essays from around the world. Explore creative writing, film studies, journalism, gender studies, teacher preparation, and internships. Easily add a second major to broaden your education.","English Modern Language":"Majors become proficient in the language, spend a semester studying overseas and develop the intercultural sophistication to live comfortably and effectively in the French- and Spanish-speaking worlds. In small classes, professors draw on their personal experiences with the culture of the languages they teach and develop close relationships with students.  You also benefit from a well-equipped language laboratory and a flexible curriculum. Studying languages widens your perspective and appreciation of varied cultural heritages, prepares you to live in an ever-shrinking world and offers lifelong enrichment.","French":"Majors spend a semester studying abroad at an approved university. At Westmont, you work closely with professors and benefit from small classes. A flexible curriculum helps you find classes that meet your needs. Courses vary but always include language, literature, and civilization and culture. You leave Westmont ready for an ever-shrinking world with a wider perspective and appreciation of different cultural heritages. You discover the face of Christ in people from other civilizations who share our world.","History":"If so, consider a history major. Our international faculty will teach you how to read, research and write history well—and help you gain skills that will serve you in any profession. History studies human activity and its meaning from the earliest times to the present, exploring different dimensions of human interactions, including politics, economics, religion, culture and ecology. Sharpen your analytical and critical skills and learn to ask good questions, to understand situations from several vantage points, to cultivate humility, and to understand and appreciate other times, people, and cultures.The history department offers four tracks leading to a bachelor of arts degree in history: the Standard Track provides a comprehensive introduction to historical study with considerable chronological and geographical breadth; the Graduate Track is intended for those particularly interested in pursuing graduate work in history and adds foreign language study to the Standard Track; the International Studies Track allows for geographical specialization in historical study and requires a semester abroad in the student’s region of choice; and the Secondary Education Track prepares students with the appropriate historical and social scientific content to teach at the secondary level.","Interdisciplinary":"The following guidelines should be followed:","Kinesiology":"Passionate about their field, professors work closely with you in class and involve you in their research projects. Personal, interactive and relevant classes expose you to the entire umbrella of kinesiology—biophysical, behavioral and sociocultural—and help you dig deeper into your studies. Internships give you opportunities to observe and assist a variety of health professions and develop your own career path. Westmont’s excellent reputation with top graduate schools assists you in continuing your education through graduate programs.","Liberal Studies":"If you desire to pursue a career in elementary education, the Liberal Studies major is a great choice. The major helps you develop expertise in all subjects normally taught in the elementary classroom and prepares you for the CSET (subject-matter exams) required for entrance into a California Teacher Credential Program.With a Liberal Studies degree, you are well-positioned  to earn a Multiple Subject Teaching Credential. On the regular track, you return for a fifth year to earn a teaching credential. With careful planning and hard work, you may be able to complete both the Liberal Studies major and earn a Multiple Subject Teaching Credential at in four years at Westmont’s Teacher Credential Program. In California, unlike most other states, those who wish to pursue a career in elementary education generally choose a multi-disciplinary major called Liberal Studies. The Liberal Studies major is a degree primarily in academic content, allowing you to develop expertise in all of the subjects that are normally taught in the elementary classroom.Westmont’s Liberal Studies major is a state-approved program for Elementary Subject Matter, aligned with the CSET examination that allows entry into a teacher preparation program for a Multiple Subject (Elementary) credential.Liberal Studies Handbook","Mathematics":"You belong to a supportive community of mathematicians becoming fluent in the language of the natural world. You look beyond numbers and formulas to abstract patterns, using your imagination and stretching your creativity. As you develop deeper understanding of the fundamentals of mathematics, you’ll become a well-educated and well-rounded person. Through your classes and work on research projects, you’ll gain knowledge and skills that make you a better thinker and communicator and prepare you for interesting and rewarding careers.","Music":"Engage in the serious study, composition and performance of great music at an advanced level. Discover the vital role music plays in the liberal arts and the Westmont community. Choose from the B.A. degree in music on the general, music performance, and music composition tracks or earn the professional Pre-Teaching Credential (B.M.) degree that leads to a public school teaching credential. You may also choose the Bachelor of Music (B.M.) degree in performance with a concentration in voice, orchestral instruments and piano. Study at a school accredited by the National Association of Schools of Music (NASM).National Association of Schools of Music\n11250 Roger Bacon Drive, Suite 21\nReston, VA 20190-5248\n(703) 437-0700 Phoneinfo@arts-accredit.org","Music Performance":"Engage in the serious study, composition and performance of great music at an advanced level. Discover the vital role music plays in the liberal arts and the Westmont community. Choose from the B.A. degree in music on the general, music performance, and music composition tracks or earn the professional Pre-Teaching Credential (B.M.) degree that leads to a public school teaching credential. You may also choose the Bachelor of Music (B.M.) degree in performance with a concentration in voice, orchestral instruments and piano. Study at a school accredited by the National Association of Schools of Music (NASM).National Association of Schools of Music\n11250 Roger Bacon Drive, Suite 21\nReston, VA 20190-5248\n(703) 437-0700 Phoneinfo@arts-accredit.org","Philosophy":"You will rigorously explore our deepest beliefs and biggest questions—about reality, about human nature, about what we can be sure of, about how we should treat one another and why. At Westmont, philosophy is the practice of faith seeking understanding, emboldened by the promise to the prayerful that “the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus” (Phil. 4:7). Belong to a community that fosters both steadfast Christian commitment and no-holds-barred grappling with the questions and puzzles that thoughtful people of all stripes and every era have asked.","Physics":"You’ll also take courses in mathematics, the language of science, and chemistry for scientific breadth. Test some of the theory you learn in laboratory classes and hands-on research and take advantage of opportunities to conduct research with you professors. State-of- the-art instrumentation enriches your experience. You may also pursue internships with high-tech firms in Santa Barbara. Such practical training prepares you for graduate school and professional work in science, engineering and related fields. Interested in a double major? Take the B.A. track for greater breadth and flexibility.","Political Science":"You might play the part of a congressional party whip trying to reform health care; or issue a decision on religious freedom as the Chief Justice on the U.S. Supreme Court in a mock trial; or you might just travel to New York as part of a Model United Nations. The political science major trains students in the theory and practice of politics in the United States and the global community, emphasizing international relations, American politics, comparative politics and political philosophy. Our department helps students become politically competent citizens in light of the Christian faith, working faithfully for justice in a world characterized by political, social, cultural, religious, and economic diversity.","Psychology":"Discover how psychological knowledge informs your faith—and how your faith informs your understanding of psychology. Apply your knowledge through research with professors and present your work at academic conferences. Participate in local internships to investigate possible careers.  Psychology alumni attend nationally-known graduate schools, and local employers recruit them. Graduates have received honors such as a clinical post-doctoral internship at Harvard Medical School and a Ford Foundation Pre-doctoral Minority Fellowship.","Religious Studies":"Expand your view of faithful living as you witness the deep Christian faith of your professors and their varied denominational backgrounds. Be trained to think about and understand every area of the Christian faith so you can share your knowledge as it shapes your life. Prepare to answer a call to professional ministry or simply to live out your faith through your work and service in your church and community. Find your place in the millennia-old history of the Christian faith.","Social Science":"As a social science major, you study people’s behavior as individuals and in groups by focusing more on general characteristics or patterns of behavior than on particular persons or institutions. You choose your own area of emphasis, guided by the different set of questions and arena of human activity studied in each social science, gaining a broader perspective than students pursuing a single subject.","Sociology":"Majors choose from three tracks: general sociology, human services and cross-cultural. Professors encourage you to be aware of ongoing social inequalities and engaged with local and global communities to work toward social justice and cultural redemption. You learn about the social nature of economic inequality, globalization, family, race, technology, gender, culture, religion and deviance from a Christian perspective. Earn academic credit for internships with agencies addressing social problems. Take advantage of off-campus programs, especially Westmont in San Francisco. Conduct independent research and present your work at the Western Sociology-Anthropology Undergraduate Research Conference and Westmont’s Student Research Symposium. Professors work closely with you and get to know you personally.","Spanish":"Majors spend a semester studying abroad at an approved university and get immersed in the culture. At Westmont, you take small classes and work closely with professors who focus on speaking skills as well as grammar. They draw on personal knowledge of the language and culture as you read and discuss Spanish literature. Courses vary but always include language, literature, and civilization and culture. You leave Westmont ready for an ever-shrinking world with a wider perspective and appreciation of different cultural heritages.","Theatre Arts":"","Anthropology":"Majors choose from three tracks: general sociology, human services and cross-cultural. Professors encourage you to be aware of ongoing social inequalities and engaged with local and global communities to work toward social justice and cultural redemption. You learn about the social nature of economic inequality, globalization, family, race, technology, gender, culture, religion and deviance from a Christian perspective. Earn academic credit for internships with agencies addressing social problems. Take advantage of off-campus programs, especially Westmont in San Francisco. Conduct independent research and present your work at the Western Sociology-Anthropology Undergraduate Research Conference and Westmont’s Student Research Symposium. Professors work closely with you and get to know you personally.","Biblical Languages":"Expand your view of faithful living as you witness the deep Christian faith of your professors and their varied denominational backgrounds. Be trained to think about and understand every area of the Christian faith so you can share your knowledge as it shapes your life. Prepare to answer a call to professional ministry or simply to live out your faith through your work and service in your church and community. Find your place in the millennia-old history of the Christian faith.","Coaching":"Passionate about their field, professors work closely with you in class and involve you in their research projects. Personal, interactive and relevant classes expose you to the entire umbrella of kinesiology—biophysical, behavioral and sociocultural—and help you dig deeper into your studies. Internships give you opportunities to observe and assist a variety of health professions and develop your own career path. Westmont’s excellent reputation with top graduate schools assists you in continuing your education through graduate programs.","Education":"Westmont's Department of Education provides a supportive collegial community in which to acquire a rigorous, practical, and professional preparation for K-12 teaching.  Building on teacher-candidates' liberal arts education, our program is designed to develop exemplary instructional skills, habits of reflection, and moral and cultural sensitivities that promote lifelong learning of diverse students.  Follow us on Instagram @westmont_educationBecome a knowledgeable, caring, Christian educator through our rigorous, highly practical and professional program. You'll learn from full-time professors with K-12 experience as you develop essential skills and attitudes to succeed as a teacher. Westmont’s stellar reputation opens doors for you to observe, teach, and invest in diverse schools. You enter our professional program with a collegial cohort, taking classes in the fall semester and student teaching in the spring. Learn More & Apply If you desire to teach elementary school, begin by earning a college degree. At Westmont, the Liberal Studies major is a great choice as it helps you develop expertise in all subjects normally taught in the elementary classroom and prepares you for the CSET (subject-matter exams) required for entrance into a California Teacher Credential Program.With careful planning and hard work, you may be able to complete both the Liberal Studies major and a Multiple Subject Teaching Credential in four years on our fast track plan. If you desire to teach junior high or high school, begin by earning a college degree in the subject you want to teach.Westmont offers Single Subject Teaching Credentials in the following areas: Towards the end of your undergraduate studies, take the CSET (subject-matter exams) in the subject you wish to teach as evidence of strong content knowledge. With careful planning, hard work, and counsel from your academic advisor and Education Department advisor, you may be able to complete both a BA degree and a Single Subject Teaching Credential in four years.The Education Minor is for students majoring in disciplines outside of the Liberal Studies major (art, English, history\/social science, physical education\/kinesiology, mathematics, science—biology, chemistry, and physics—and Spanish) that are interested in K-12 education and\/or are considering pursuing a teaching credential for junior high or high school. The Education Minor includes all of the prerequisite courses for Westmont's Credential Program. Please contact the Education Faculty for advising and next steps.","Ethnic Studies":"The interdisciplinary ethnic studies minor provides you with the opportunity to study the cultural, historical, political, religious, and social dimensions of a variety of racial and ethnic groups. The minor will equip you with an interdisciplinary knowledge base and set of skills about race and ethnicity in local, national, and global contexts. This will allow you to understand the ways in which U.S. and global systems of power are rooted in racial and ethnic constructs. The minor will also equip you to grapple with the historical and present relationship of Christianity and the Christian church to both national and global systems. Through your coursework, you will learn to situate issues of racial and ethnic identity, racism, and equity within the context of Christian understandings of human flourishing. A minor in ethnic studies will equip you to lead faithfully in the pluralistic environment that is our contemporary world, and to work for social change that promotes justice and equity.","Environmental Studies":"Widespread environmental problems rank among the most pressing global issues of our time, and their scientific, social and moral dimensions require a sophisticated, informed and compassionate response. The Environmental Studies minor cultivates a deep understanding of human connections to the natural world so you can analyze and debate complex environmental problems and devise constructive, imaginative solutions. You’ll discover how to practice stewardship of the earth in the context of Christian theology and social and environmental ethics. You'll also develop the knowledge and skills to engage contemporary environmental issues such as biodiversity loss, pollution, resource depletion, climate change, renewable energy, sustainable agriculture and sustainable development from local to global scales.","Film Studies":"The Film Studies Minor at Westmont provides an integrated liberal arts foundation that emphasizes the intersection of film with many disciplines and aspects of culture. The minor examines film as an art form that persuades and inspires, evoking religious, aesthetic, ethical, and epistemological questions that are foundational to humane learning. Combining coursework from the departments of Applied Studies, Art, Communication Studies, English, History, Modern Languages, Political Science, Theater Arts, and Religious Studies, Film Studies minors explore film as a powerful national and transnational force.","Gender Studies":"The Gender Studies Program is the campus home for the Gender Studies Minor, and for campus-wide events sponsored by the minor. Faculty from several academic departments teach in the minor, advise student's and assist in programming.Because the Gender Studies Minor is housed in various departments and buildings on campus, the program provides a visible presence, and a resource, for campus conversations about gender, about femininity and masculinity, about how our gender impacts our faith, and how our faith shapes our understandings of gender.If you have questions about the program or the minor, or you would like to suggest an event, or need a resource; contact the Gender Studies Program Coordinators, Cheri Larsen Hoeckley either by email (larsen@westmont.edu) or by visiting Reynolds Hall 103 and Caryn Reeder, either by email (creeder@westmont.edu) or by visiting Porter Center 13, or contact any members of the Advisory Committee.The gender studies minor is designed to be an interdisciplinary exploration of gender in contemporary and international life. Students will study gender and its importance to politics, culture, history, philosophy, psychology, literature, theology, communication, language and religion.With approval of the course faculty member and the Gender Studies Program Coordinator, students can substitute 195 (Special Topics) courses, HIS 134, or HIS 121.See career paths for graduates who majored or minored in gender studies at Westmont.","Movement Science":"Passionate about their field, professors work closely with you in class and involve you in their research projects. Personal, interactive and relevant classes expose you to the entire umbrella of kinesiology—biophysical, behavioral and sociocultural—and help you dig deeper into your studies. Internships give you opportunities to observe and assist a variety of health professions and develop your own career path. Westmont’s excellent reputation with top graduate schools assists you in continuing your education through graduate programs.","Writing":"The writing minor is designed to expand students’ writing practices while enriching their understanding of writing and rhetoric. As such, the minor can be a valuable supplement to many majors; it helps cultivate liberal arts inquiry and strengthens marketable skills. Although the minor is overseen by the English Department, the curriculum draws from disciplines such as art, history, communication studies, philosophy, and theatre arts.","Nursing":"Students entering the Westmont Downtown | Grotenhuis Nursing program will learn from experienced, competent registered nursing professors chosen for their dedication to the ministry of health and wellness through the theory of compassionate care. This post-baccalaureate program requires prior completion of a B.A. or B.SFollow us on Instagram - @westmontnursingApply today!","Teacher Credential Program":" Become a knowledgeable, caring, Christian educator through our rigorous, highly practical and professional program. You'll learn from full-time professors with K-12 experience as you develop essential skills and attitudes to succeed as a teacher. Westmont’s stellar reputation opens doors for you to observe, teach, and invest in diverse schools. You enter our professional program with a collegial cohort, taking classes in the fall semester and student teaching in the spring. Westmont College Teacher Education Program graduates have excellent passage rates on the California Teacher's Exam! See our passage rates here.ScholarshipsStudents may apply for financial aid. Important information for applying for financial aid is available on the Financial Aid page. Students may be eligible for additional scholarships from the Credential Program. During the Spring Semester of the credential year, candidates holding a BA or BS, who live off campus, are eligible for a scholarship equal to 55% of tuition.The teaching credential application opens on December 1. Applications are due on February 15.Teacher Credential HandbookElementary candidates major in Liberal Studies. Working closely with a Liberal Studies advisor, students can complete a B.A. and earn a California Multiple Subject Preliminary Teaching Credential in four years. Secondary candidates major in Art, English, History, Social Sciences, Physical Education\/Kinesiology, Music, Mathematics, the Sciences (Biology, Chemistry, Physics) or Spanish. Working closely with a faculty advisor in their major and an education faculty advisor, students can complete a B.A. or B.S. and a California Single Subject Preliminary Teaching Credential in four years.This post-baccalaureate program requires prior completion of a B.A. or B.S. A program advisor works closely with applicants through the admissions process and helps students complete the prerequisite courses\/requirements.The Education Minor is for students majoring in disciplines outside of the Liberal Studies major (art, English, history\/social science, physical education\/kinesiology, matematics, science—biology, chemistry, and physics—and Spanish) that are interested in K-12 education and\/or are considering pursuing a teaching credential for junior high or high school. The Education Minor includes all of the prerequisite courses for Westmont's Credential Program. Please contact the Education Faculty for advising and next steps."}}