{"0":{"Human Services":"The education of a human services professional integrates both theory and practice. Students are exposed to basic ideas and concepts in the classroom, and then have the opportunity to put those ideas and concepts to practical use in actual work settings.\nRead information about this program\n\nUndergraduate Catalog\n\nApply Now at BGSU Firelands\nLearning Outcomes\nUpon completion of the associate degree, students in Human Services are expected to be able to:\n\nApply appropriate psychosocial concepts to clinical populations, such as those who are at-risk, needy, and\/or disadvantaged;\nEvaluate relevant theory (i.e. case management, interviewing and observation) in human services settings, such as mental health, victim, or employment support agencies;\nDemonstrate basic clinical skills in practice, such as providing support, identifying problems, and working with diverse groups.  \n\nAccreditation and\/or Program\/Cluster Review \nBowling Green State University [BGSU] is accredited by the Higher Learning Commission.  BGSU has been accredited by the Higher Learning Commission since 01\/01\/1916. The most recent reaffirmation of accreditation was received in 2012 - 2013. Questions should be directed to the Office of Institutional Effectiveness.\n\nThe Human Services program will undergo Program\/Cluster Review during the Academic Year 2021-22. For more information, click here.\nProfessional Licensure (If applicable)\nBowling Green State University programs leading to licensure, certification and\/or endorsement, whether delivered online, face-to-face or in a blended format, satisfy the academic requirements for those credentials set forth by the State of Ohio.\n\nRequirements for licensure, certification and\/or endorsement eligibility vary greatly from one profession to another and from state to state. The Human Services program does not lead to professional licensure.\n\n Gainful Employment (If applicable)     \nUnder the Higher Education Act Title IV disclosure requirements, an institution must provide current and prospective students with information about each of its programs that prepares students for gainful employment in a recognized occupation.\nThe Human Services program is not a recognized occupation that requires a Gainful Employment disclosure.\n","Associate of Arts":"The Associate of Arts program is part of BGSU Firelands.\n\nBowling Green State University offers more than 170 bachelor's degree programs and students can begin most of them at BGSU Firelands. Associate degrees mark the approximate halfway point in a bachelor's program. So, whether your goal is to pursue a four-year degree or simply to expand your horizons, an associate of arts degree is an excellent foundation. \n \nRequest information\nSchedule a visit\nApply Now \nSpecifically designed to provide a solid knowledge base to pursue a broad range of four-year programs, the courses involved with the associate of arts develop the foundational skills for further study in your bachelor's degree, enhance competencies in written and oral communication, computation and mathematics, critical thinking and problem solving, and decision making and values analysis. These courses also parallel those offered during the first two years of a bachelor's degree at most other colleges and universities.    \n\nSetting: Full-time, part-time, in-person, online\nPrerequisite required: No \nAdjectives for a successful student: creative, eager, dedicated\n \n\nStudents can expect to: \n\nTailor their studies to special interests \nComplete many courses required by all majors \nGain a broad understanding of many disciplines \n\nMore Information\n\nUndergraduate catalog\n Accreditation\nProfessional Licensure Information\n\n 419-433-5560 \nfirelands@bgsu.edu\nMessage from the college: Students who earn the Associate of Arts are well equipped to make informed decisions about their next step, whether that be the pursuit of a bachelor’s degree, enter the workforce, or other opportunities. The experience gained with an Associate of Arts is extremely valuable and builds the foundation for future success.\n","Criminal Justice":"The Associate in Criminal Justice program is part of BGSU Firelands.   \n\nAssociate of Applied Science in\n\nThe associate degree in criminal justice provides students with an essential understanding of government, legal systems, people and their cultures to be successful in administering and enforcing laws.\nThis program allows students to easily transfer into the four-year program offered at BGSU Firelands and at Bowling Green State University. Students who complete the associate degree requirements will be slightly more than half way through the bachelor’s degree curriculum.\n \nRequest information\nSchedule a visit\nApply Now\nThis program addresses the needs of students entering the career chain and prepares them to grow with the increasing challenges of the profession. Emphasis is placed on superior academic attainment and effective verbal and written communication skills, with a core program concentration providing a thorough exposure to understanding government, law, people and their cultures.  \n\nSetting: Full-time, part-time, in-person \nPrerequisite required: 2.5 cumulative GPA and a C or better in CRJU 2100 \nAdjectives for a successful student: Dedicated, self-motivated, open-minded\n\nStudents can expect to:\n\nLearn ethical practices in the pursuit of justice. \nGain an awareness and understanding of the criminal justice system and its role in a democratic society, from structural components of various institutions to problems confronted in the law enforcement and corrections agencies. \nUnderstand the organizational structure and policy procedures of police agencies in contemporary society, as well as an appreciation for the issues and dilemmas the institution confronts. \nAcquire an understanding of the law—criminal, civil and personal liability\/injury, due process, equal protection under the law and the role investigations play in the process, focusing on investigation techniques and the evaluation and preservation of data. \nObtain knowledge of the nature, causes, treatment, and prevention of crime and evidence from the physiological, psychological, and sociological perspectives.\n\n\nStudents gain a greater understanding of the criminal justice \nenvironment through community-based learning. \nMore Information\n\nCurriculum Guide\nProgram Requirements\nFaculty\nMore information on Accreditation\nProfessional Licensure Information\n\nThe Criminial Justice program is not a recognized occupation that requires a Gainful Employment disclosure.\nTracy McGinley \nTeaching professor and program advisor, criminal justice \ntracygm@bgsu.edu \n419-372-0692\n\nMessage from the director: Criminal justice is a unique field to work in and offers the opportunity to interact with a diverse group of people on a regular basis. Criminal justice professionals participate in a variety of professions that offer different interactions daily. The criminal justice degree offers opportunities for a variety of employment opportunities. Students from BGSU Firelands go on to work in local law enforcement, F.B.I. corrections, probation, parole, the recovery field, victims’ assistance programs and law. Depending on the career path for which the student is interested, they may have to continue their education or seek training and experience. Students are given opportunities for community-based learning. Students can complete the degree at Firelands at an affordable rate.\n\n","Diagnostic Medical Sonography":"Associate of Science\nDiagnostic Medical Sonographers are highly-skilled professionals who use specialized equipment to create images of structures inside the human body that are used by physicians to make a medical diagnosis. Sonographers have extensive, direct patient contact that may include performing some invasive procedures. They must be able to interact compassionately and effectively with people who range from healthy to critically ill.\n \nDMS program \n application\nRequest\n information\n\nSchedule \n a visit\nEarly Decision \n Admission\nCareer\n Information\nProgram \n Outcomes\nMeet the\n Faculty\nSonographers demonstrate behavior and ethics consistent with standards and ethics of all imaging science professionals. Sonographers are involved in critical thinking skills, clinical decision making and patient education. Featuring a new lab, the program includes curriculum offerings including abdominal sonography extended, Obstetrics and Gynecology Sonography, and Vascular sonography. Students benefit from the small class size and increased attention from each instructor.\nProgram outcomes\n\nTo prepare competent entry-level sonographers in the cognitive (knowledge), psychomotor (skills), and affective (behavior) learning domains for Abdominal sonography- extended\nTo prepare competent entry-level sonographers in the cognitive (knowledge), psychomotor (skills), and affective (behavior) learning domains for Obstetrics and gynecology sonography\nTo prepare competent entry-level sonographers in the cognitive (knowledge), psychomotor (skills), and affective (behavior) learning domains for Vascular sonography\nUnderstand the relationship between theoretical and clinical components of the curriculum and apply these principles to proper anatomical part presentation, pathological adjustments required for optimal examination, quality of image, and care for all patient age groups at a rate not less than 74%, as evidenced in student grade and competency records.\nApply interpersonal skills appropriately to meet the needs of patients in a variety of clinical settings, as documented in directed practice assessment at the level of satisfactory.\nDemonstrate the ability to comprehend, apply and evaluate didactic knowledge and clinical information relative to their role as entry-level general sonographers.\n\nDemonstrate technical proficiency in clinical and scanning skills necessary to fulfill the role of entry-level general sonographer for the general concentration.\nDemonstrate personal behaviors consistent with professional and employer standards and expectations for an entry-level general sonographer.\n\nComplete the credentialing examination administered by the American Registry of Diagnostic Medical Sonographers (ARDMS) as documented by the report of registry results to the program. Pass rate to exceed programmatic accreditation standards.\n\nDemonstrate independent decision making and competent skills performance in the role of primary care provider in a broad range of sonography and intervention services, as determined by an analysis of employer surveys and graduate surveys.\n\n Cara M. Vickery\n Director of Diagnostic Medical Sonography\ncvicker@bgsu.edu\n419-372-0884\nMessage from the director:\nHello and welcome to the Diagnostic Medical Sonography program page. We are a small program dedicated to our student success. We have a new sonography lab and take great pride in our near-100% job placement and credential rates for our students. Success is achievable and we’re with you each step of the way.\nRelated Program Links\n\nCurriculum Sequence\nUndergraduate Catalog\nFrequently Asked Questions\n\nPre-Requisite Courses\n\nEnglish WRIT 1120\nMathematics MATH 1220, or 1150, or STAT 2000\nMedical Terminology AHS 3010 or AHTH 1100\nHuman Anatomy and Physiology BIOL 3310 AND BIOL 3320 (preferred) or AHTH 1310\nPhysics: RADT 1410 (Rad. Tech students) or PHYS 1010 or 2010 \n\n","Radiologic Technology":"The Radiologic Technology program is part of BGSU Firelands.\n\nRadiologic technologists provide diagnostic and therapeutic services in a variety of clinical settings.  \nThis program prepares individuals to be radiographers through academic courses, clinical education, competency evaluation and patient\/student radiographer interactions. The program will also serve as the foundation for continued study and additional credentials in related medical imaging fields. \n\n\nRequest information\nSchedule a visit\nApply Now \n\nSetting: Full-time, in-person \nPrerequisite required: RADT courses, A&P, pharmacology, medical terminology \nAdjectives for a successful student: Reliable, adaptable, diligent\n\nGraduates can expect to: \n\nUnderstand the principles of the theoretical and clinical components of the curriculum and apply them to an anatomical part presentation; pathological adjustments; radiation safety; quality of image and care for all patient age groups. \nApply people skills to meet patient needs in a variety of clinical settings. \nComplete capstone coursework meeting eligibility requirements for the Associate of Applied Science in Radiologic Technology degree. \nPass the credentialing examination administered by the American Registry of Radiologic Technologists (ARRT) at a rate of not less than 75% on the first attempt.\n\nQualify for entrance into programs of specialty within the radiological sciences.\nExercise independent decision making and demonstrate competent skills performance in the role of primary care provider in a broad range of radiological diagnostic and intervention services.\n\nSara Ondrick\nProgram director\nsondric@bgsu.edu\n419-372-0858 \nMessage from the director: A radiology technician works with a radiologist to diagnose and treat patients using diagnostic imaging examinations like X-rays, CT scans, and MRI scans. During clinicals, students can see what it’s like for a radiologic technologist to work with patients. Students are hands on in clinicals and can get a better understanding of what the job entails. That’s where students decide if this is the right path for them or not.\nAccreditation and review, licensure and Gainful Employment\n\nUndergraduate catalog\n","Associate of Science":"The Associate of Science program is part of BGSU Firelands.\n\nBowling Green State University offers more than 170 bachelor's degree programs and students can begin most of them at BGSU Firelands. A bachelor’s degree can take 9-10 semesters to complete as a full-time student. Associate degrees mark the approximate halfway point in a bachelor's program. So, whether your goal is to pursue a four-year degree or simply to expand your horizons, an associate of science degree is an excellent foundation.\n\n\nRequest information\nSchedule a visit\nApply Now \nWhile providing a strong academic background, the requirements for the associate of science degree are extremely flexible, offering students the opportunity to sample several disciplines or tailor their studies according to special interests. During the freshman and sophomore years of college, students complete many courses which are required of all majors.   \n\nSetting: Full-time, part-time \nPrerequisite required: No \nAdjectives for a successful student: eager, diligent, dedicated\n\n\n\nStudents can expect to: \n\nPursue a broad range of programs \nDevelop critical skills in communication, computation, and math \nEnhance the ability to employ critical thinking and problem solving\n\n\n\n419-433-5560\n firelands@bgsu.edu\n\nMessage from the college: Students who earn the Associate of Science are equipped to make informed decisions about their next step, whether that be the pursuit of a bachelor’s degree, enter the workforce, or other opportunities. The experience gained with an Associate of Science is extremely valuable and builds the foundation for future success.\n\nMore on the program, accreditation and review, licensure and Gainful Employment \nUndergraduate catalog\nAccreditation \nProfessional Licensure Information\n","Nursing":" BGSU Firelands provides the gateway into careers in nursing through partnerships with Lorain County Community College, Firelands Regional Medical Center School of Nursing and BGSU’s eCampus. Earn your associate degree and your bachelor of science in nursing conveniently, affordably and close to home.\nEarning your associate degree\nStudents interested in a career in nursing can utilize one of two academic pathways BGSU Firelands maintains with regional partners: an embedded cohort-based model to earn an associate degree in nursing from Lorain County Community College, or an affiliate partnership to earn a diploma in nursing from Firelands Regional Medical Center School of Nursing and a non-nursing associate degree from BGSU Firelands.\nAbout the Lorain County Community College (LCCC) pathway:\n\nAll coursework is completed at the BGSU Firelands campus in Huron, Ohio.\nStudents complete nursing support courses through BGSU Firelands, preparing them for admission to LCCC’s associate degree in nursing program.\nStudents admitted to the LCCC nursing program enroll in LCCC courses taught by LCCC faculty at BGSU Firelands.\nGraduates earn an associate degree in nursing from LCCC and are eligible to sit for RN licensure.\n\nMore Information\n\nAssociate Degree Nursing (RN) with LCCC\nACCESS to Nursing LPN-RN Program with LCCC\n\nContact\nTammy Jenkins\nLCCC\/Firelands BGSU Nursing Program Advisor\n440-366-4833\ntjenkins@lorainccc.edu | jenkitl@bgsu.edu\nDr. Mary Grady\nLCCC BGSU Nursing Program Administrator\nmgrady@lorainccc.edu\nAbout the Firelands Regional Medical Center School of Nursing (FRMCSN) pathway:\n\nCoursework is completed at BGSU Firelands in Huron and FRMCSN in Sandusky, Ohio.\nStudents complete support courses through BGSU Firelands, before or after admission to FRMCSN’s nursing diploma program.\nStudents admitted to FRMCSN’s nursing diploma program enroll in FRMCSN courses taught by FRMCSN faculty in Sandusky.\nStudents who complete the nursing diploma program from FRMCSN are eligible to sit for RN licensure and transfer articulated FRMC coursework toward a non-nursing associate degree from BGSU Firelands.\nFRMCSN additionally offers an LPN to RN pathway in collaboration with BGSU Firelands.\n\nMore Information\n\nFRMCSN Nursing Diploma and Non-nursing Associate Degree\nFRMCSN LPN to RN Program\n\nContact\nKrista DeBlase\n\nAcademic and Career Counselor\n419-372-0883\ndeblask@bgsu.edu\n\nCompleting your study with a Bachelor of Science in Nursing\nStudents completing either pathway are eligible to enroll in BGSU’s RN to BSN program, an entirely online degree completion program offered via BGSU’s eCampus. Students transitioning from the FRMCSN or LCCC pathways are provided credit towards the BGSU bachelor of science in nursing degree.\nStaff\nFor questions regarding FRMCSN pathway, contact:\nKrista DeBlase\nAcademic and Career Counselor\ndeblask@bgsu.edu\nFor questions regarding the LCCC pathway, contact:\nTammy Jenkins\nLCCC\/Firelands BGSU Nursing Program Advisor\n440-366-4833\ntjenkins@lorainccc.edu | jenkitl@bgsu.edu\nDr. Mary Grady\nLCCC BGSU Nursing Program Administrator\nmgrady@lorainccc.edu\nFor questions regarding the RN to BSN Program, contact:\nLara Wilken\nAssistant Clinical Professor, RN to BSN Coordinator\nlwilken@bgsu.edu\n","Bachelor of Science in Respiratory Care":"The Respiratory Care program is part of BGSU Firelands.\nBachelor of Science in\nThe Bachelor of Science in Respiratory Care program is designed to prepare students for practice in respiratory care. Theory, laboratory and clinical experiences provide students with the skills to work as a respiratory therapist in a wide variety of clinical settings evaluating, treating and managing patients of all ages with respiratory illnesses and other cardiopulmonary disorders. Respiratory therapists provide patient care, which includes clinical decision-making and patient education.\n\n\nApply Now\nRequest Information\nSchedule a Visit\nNew first-year, transfer and continuing students can pursue this program while starting on the Bowling Green or Firelands campus in Huron, Ohio. With the hybrid format, students will need to attend in-person classes one day per week at the BGSU Firelands campus; the remaining instruction will be completed online.\nStudents will declare this major as part of enrollment in the professional portion of the program in the student’s junior and senior years, culminating in the degree’s conferral via BGSU Firelands. While clinical rotations are a required component of the degree, the program has location options across northern Ohio from Cleveland to Toledo including Bowling Green in order to meet your specific needs.\n\nSetting: Full-time or part-time, hybrid with in-person, online, and clinical courses\n\nPrerequisites required:  2.5 GPA or higher, completed CHEM 1090\/1100, BIOL 3140\/3150, BIOL 3310, BIOL 3320 and math (MATH 1150 stats and MATH 1220 algebra). Applicants must have completed a CoARC accredited Associate degree program in Respiratory Care. Students can concurrently complete the Associate degree program while working toward the BSRC.\n\nAdjectives for a successful student: Motivated, flexible, enthusiastic\n\n\nPrepare to apply\nStudents must apply by April 1 for admission consideration. Late applications may be considered if there is an open slot.  \n\nApply here for admission to the college.\nComplete and submit the Respiratory Care Program admission application and return it to program director Carol Puder by email: cpuder@bgsu.edu.\nChoose to attend classes at our base program at BGSU Firelands, or at our satellite program offered through the University Partnership at Lorain County Community College.  All admitted cohorts will start in the fall semester.  \n\nQuality hybrid classroom experiences\nStudents take a combination of in-person, online, and hybrid classes. Each hybrid course meets one hour per week in-person, with the remaining instruction completed online. All in-person components for classes are scheduled for the same day each week, from 8 a.m. to 5 p.m. with an hour lunch break. The remaining instruction is delivered asynchronously online.  \nClinical rotations start in the spring semester of the junior year, and they continue for three consecutive semesters (spring, summer, and fall). Generally, students attend clinicals two days per week at various locations for either an eight- or 12-hour shift.   \nStudents completing the associate degree concurrently with the BSRC will graduate with the associate degree in the fall of the senior year. The final semester of the BSRC program is delivered fully online. This allows students to take their board exams to get their credentials as well as work part-time for a hospital as a student respiratory therapist while they finish the BSRC degree. \nRespiratory therapists already working in the profession who are returning to complete the BSRC are generally able to complete any remaining courses for graduation in an online format. Degree audits will be evaluated for all respiratory therapists returning to advance their education as individual circumstances may vary.   \nTake courses about\n\nCardiopulmonary Anatomy and Physiology\nPulmonary Pathophysiology\nAdvanced Cardiac Life Support\nCritical Care Concepts in Respiratory Care\nAllied Health Education\nHealth Care Management\nMedical Ethics\nPharmacology\n\nGraduates have employment opportunities in hospitals, clinics, long term care, home care, sleep lab, and specialty areas including neonatal\/pediatric critical care, cardiac\/pulmonary rehabilitation, pulmonary function testing and disease management.\nGraduates can expect to: \n\nLearn advanced critical care techniques for patient management.\nBecome familiar with advanced diagnostic testing related to respiratory care.\nComplete reviews of scientific literature and use them to apply evidence-based care to patients.\nDevelop additional skills to educate patients and families on disease management. \nGain a skillset to support advancement into management and supervisory positions. hirable for virtually any hospital or health care facility with a respiratory department.\n\nMore Information\n\nProgram Requirements\nProgram Admission Application\nProgram Admission Observation\nMeet the Faculty\nProgram and Clinical Policies\nEstimated Program Costs\nCareer Information\nLicensure Information\nUndergraduate catalog \n Accreditation \n\nProgram Goal Statements:\n\nTo prepare graduates with demonstrated competence in the cognitive (knowledge), psychomotor (skills), and affective (behavior) domains of respiratory care practice as performed by registered respiratory therapists (RRTs).\nTo prepare leaders for the field of respiratory care by including curricular content that includes objectives related to acquisition of skills in one or more of the following: management, education, research, advanced clinical practice (which may include an area of clinical specialization).\n\nLearning Outcomes: Graduates from our program should be qualified to:\n\nMaster fundamental principles of natural, physical, and social science and mathematics related to respiratory care.\nIdentify, evaluate, and apply technical information related to the role and scope of practice for the respiratory care professional.\nApply fundamental knowledge of respiratory care as well as advanced concepts in adult, pediatric, and neonatal patient management in the diagnostic assessment, management, and treatment of patients.\nAnalyze scientific literature and critically evaluate clinical research findings related to respiratory care.\nEducate patients, their families, and other health care professionals in respiratory care practices and procedures.\nDemonstrate professional behaviors expected of the advanced respiratory care professional including adherence to state laws, patient privacy (HIPAA), patient safety regulations, and the code of ethics for the profession.\nMeet nationally accepted standards for the scope of practice of the respiratory care professional as stated in the Standards and Guidelines for the profession of respiratory care promulgated by the Commission on Accreditation for Respiratory Care (CoARC).\n\nCarol Puder\nDirector, respiratory care\ncpuder@bgsu.edu\n419-372-0671\nMessage from the director: The respiratory care program at BGSU Firelands is well respected across Northern Ohio and health care facilities actively recruit our students for employment. Respiratory care is a specialized profession treating patients with cardiopulmonary diseases across all areas of the hospital including the emergency room and critical care areas. Respiratory therapists can also specialize in many areas including neonatal\/pediatrics, long-term care, sleep lab, pulmonary rehab, and pulmonary function testing. Students complete clinical requirements at award-winning medical facilities throughout northern Ohio including Cleveland Clinic, MetroHealth, University Hospitals and Mercy Health among many others. Graduates are eligible to sit for the National Board for Respiratory Care (NBRC) examinations to become a Registered Respiratory Therapist and are also able to pursue a graduate degree.\n\n","Small Business Enterprise":"The Technical and Applied Studies program is part of BGSU Firelands.  \n\nBachelor of Technical and Applied Studies in\nThe Bachelor of Technical and Applied Studies (BTAS) at BGSU Firelands is a versatile degree designed to meet a growing job market. Students strengthen communication, critical thinking and professional skills while also increasing career-specific skills in Small Business Enterprise or Information Technology Support.\nEntrance into this blended degree program will require an associate degree, or students will be advised through an associate degree completion program before transitioning into the BTAS area of study.\nApply\nNow\nSchedule a\nVisit\nRequest\nInformation\nThe Associate of Applied Business (AAB) will work seamlessly into the Bachelor of Technical and Applied Studies. Additionally, Associate of Science, Associate of Arts, or Associate of Technical Study degree holders are prepared for the BTAS in Small Business Enterprise (SBE). \nStudents spend a semester working on an applied business project. The degree is available entirely and exclusively at BGSU Firelands.  \n\nSetting: Full-time, part-time, online \nPrerequisite required: associate degree \nAdjectives for a successful student: curious, motivated, bright, problem solver\n\nGraduates can expect to: \n\nDemonstrate ability to manage cash flow, labor, operations, and promotion. \nRecognize elements of decision-making as related to cash flow, labor, operations, and promotion. \nShow an understanding of lean principles to innovate by using qualitative and quantitative methods to support conclusions. \nUnderstand and respond to new trends. \n\nWhat is BTAS?\nBachelor of Technical and Applied Studies Program is a versatile degree designed to meet a growing job market\nInternships & Careers\nGraduates often work in a small business (typically 50 employees or fewer) environment in a variety of positions with duties ranging from leadership to human resources to project management to event planning to marketing to finance among other responsibilities or go on to start their own business.\nPursue a career\n\nSmall Business Owner\nHospitals\nLocal and Regional Government\nAdvanced Manufacturing Supervisor\nQuality Control\nHuman Resources\nProject Managers\nEvent Planners\n\nMore Information\n\nUndergraduate catalog\nMore information on Accreditation\n\nProfessional Licensure Information\n\n\nMichelle Brodke\nDepartment of Applied Sciences \nmbrodke@bgsu.edu \n419-372-0699 \nMessage from the director: The BTAS Small Business online degree provides the breadth of skills needed to run a small business or work within a mid- to large-sized organization. We provide accounting, marketing, people management, process management and project management skills that enable success. Most (98%) of privately held businesses are considered small businesses by the Small Business Administration. For a great return on investment and a quick start into the world of business, the BTAS provides a flexible, cost effective, application-focused bachelor's degree. \n","Inclusive PreK- grade 5 Education Program":"The Inclusive Early Childhood Education program is part of BGSU Firelands.   \n\nThe Inclusive Early Childhood Education Program, within the College of Education and Human Development, is a competitive program that prepares teachers to construct developmentally appropriate education for children ages 3-11 in collaboration with their families. In addition, the Inclusive Education program prepares students for two teaching licenses at the BGSU Firelands campus.\n\n\nRequest information\nSchedule a visit\nApply Now \n\nSetting: Full-time, in person \nPrerequisite classes required: Yes \nAdjectives for a successful student: responsible, caring, accepting\n\n\nThe Inclusive Early Childhood Education Program (IEC) within the College of Education and Human Development of Bowling Green State University is a revolutionary program in the state of Ohio that will prepare undergraduate teacher education candidates for employment in inclusive early childhood learning environments.\nMultiple Credentials\nThe Inclusive Early Childhood Education program leads to a Bachelor of Science in Education degree with two teaching licenses.\nGraduates work in a variety of educational settings for young children, including community agencies, daycare centers, preschools, kindergartens, and the elementary grades 1-5. Graduates of the program earn two credentials in four years:\n\nEarly Childhood Education licensure for PreK through 5th grade.\nEarly Childhood Intervention Specialist license for PreK through 5th grade.\n\nBGSU graduates of the program will be able to teach young children with and without disabilities in inclusive settings.\nSound Philosophy\nThe IEC program blends the best practices from early childhood education with early childhood special education. It addresses the knowledge, skills, and values necessary to meet the needs of each child. Graduates are prepared to provide differentiated, evidence-based instruction to young children through grade 5. The program is committed to the development of partnerships and scholarly endeavors that reflect the University’s professional values of justice, fairness, and equity.        \n\nNational education associations support inclusionary practices, and young children across the county are reaping the benefits by experiencing success in inclusive settings. BGSU’s Inclusive Education PK-grade 5 program involves professionals from diverse disciplines working together to address the complex learning needs found in all classrooms. We support parents, community members, teachers, and paraprofessionals as partners in the educational process, and each child is a respected member of the learning community.\nDr. Trisha Prunty, Ed.D.\nAssistant Professor and Co-Coordinator of the Inclusive Early Childhood Program\npprunty@bgsu.edu\n419-372-0784\nMessage from the director: Allow me to offer the warmest of welcomes to new or returning students who are interested in an education program. BGSU Firelands offers amazing education programs for people who want to teach PreK-grade 5 elementary or special education. The classes are in person, there is plenty of field experience and our students are hired to teach in the area after graduation.\n\nUndergraduate catalog\nMore information on Accreditation\nProfessional Licensure Information\n","Communication":"The Bachelor of Arts in Communication in Communication specialization is part of BGSU Firelands.  \nBachelor of Arts\nCommunication specialists study human interaction in various contexts, including within organizations, across cultures, within media representations, and during business transactions. A bachelor’s degree in communication provides students with the ability to pursue multiple directions within their lives and careers. Communication students learn how to manage, negotiate, interpret, and facilitate human interaction within a variety of environments. BGSU Firelands offers a pathway that allows students to choose from both of BGSU's Communication degree options: a Bachelor of Arts (BA) with a communication major and a minor in another discipline or a Bachelor of Arts in Communication (BAC) with a career focus.\nA 3-and-1 program allows students to take advantage of the convenience and cost effectiveness of classes on the BGSU Firelands campus for three years and then complete the fourth year of the program either on the Bowling Green campus or through online courses.\n \n\nApply\nNow\nSchedule a\nVisit\nRequest\nInformation\nQuality classroom experiences\nAcademic advisors work individually with students to plan their degree programs and small class sizes allow students to have close, personal contact with their professors. Free tutoring is readily available through the Teaching and Learning Center. Scholarships, grants and loans are available to assist students with tuition.\nTake courses like\n\nBusiness and Professional Speaking\nIntercultural Communication\nOrganizational Communication\nArgumentation\n\nCurriculum\nBachelor of Arts in Communication (BAC)  students will choose an Area of Emphasis (Relational Communication, Organizational Communication, Intercultural\/Global Communication, or Advocacy) and will complete 21 hours of Communication Electives, and a Career Focus (at least 18 hours). BA students will complete Major Requirements (36 hours), including an Area of Emphasis, and 21 hours of Minor Requirements.\nOne of the fastest growing majors across the country, communication degrees offer a tremendous amount of career flexibility.\nInternships & Careers\nInternships provide communication students with an opportunity to gain field experience outside of the classroom and help prepare them for careers after graduation. Career paths for students with a degree in communication will be influenced by individual interests, skills, and values, and can be as diverse as working as writers and editors, event planners, customer service representatives or members of a sales force. \n\nPursue your career\n\nPublic Relations Specialists\nEditors\nArbitrators\nAuthors\nMarketing Specialists\nHuman Resources Professionals\nEvent Planners\n\nMore Information\n\nBAC in Communication in Communication Program Requirements\nBA in Communication Program Requirements\nRequest information\n\n","Information Technology Support":"The Technical and Applied Studies program is part of BGSU Firelands.  \nBachelor of Technical and Applied Studies in\nThe Bachelor of Technical and Applied Studies (BTAS) at BGSU Firelands is a versatile degree designed to meet a growing job market. Students strengthen communication, critical thinking and professional skills while also increasing career-specific skills in Information Technology Support or Small Business Enterprise.\nEntrance into this blended degree program will require an associate degree, or students will be advised through an associate degree completion program before transitioning into the BTAS area of study.\n \nApply now\nSchedule a Visit\nRequest Information\n\nSetting: Full-time, part-time, in-person, online\nPrerequisite: associate degree \nAdjectives for a successful student: detail-oriented, diligent, curious\n\nThe Information Technology Support concentration provides the flexibility to prepare students for positions that require a broad range of technical duties. In most organizations, it is common for an employee to support both the users of the technology and the technology itself. The ITS concentration courses gives students a wide range of skills in programming, operating systems, virtual machines, databases, networking, security, project management, and forensics. The concentration is offered 100% online. However, some BTAS degree professional courses must be taken in person.\nLearning Outcomes\n\nAnalyze user requirements and design Information Technology-based solutions.\nEvaluate current technologies and their applicability to address user and organization needs.\nDemonstrate the ability to work in project teams to develop and\/or implement Information Technology-based solutions.\nDevelop and communicate Information Technology implementation plans for management review and approval.\n\nTake courses like these and more:\n\nNetwork Security Principles\nAdvanced Command-Line Utilities\nIntroduction to Computer Forensics\nScripting for Network Administration\nCloud Technologies\n\nPursue a career:\n\nIT Manager\nComputer Systems Manager\nIT Coordinator\nNetwork Administrator\nChief Information Officer (CIO)\nChief Technical Officer (CTO)\nIT Director\nIT Project Manager\nTechnical Operations Officer\nSenior IT Consultant\nTechnical Lead\n\nMore Information\n\nUndergraduate catalog\nMore information on Accreditation\nApply now\n\n","Inclusive Early Childhood Education, Associates":"The Inclusive Early Childhood Education program is part of BGSU Firelands.\n\nThe Inclusive PreK- grade 5 Education Program\nAn early childhood educator with an Associate of Applied Science degree in Inclusive Education is a person who can work with and meet the needs of children, families, and other educators from preschool to elementary school. Inclusive teachers are trained as generalists, learning how to work with all children, including those with disabilities and children with diverse cultural backgrounds.\n \nRequest information\nSchedule a visit\nApply Now \n\nSetting: Full-time, in-person \nPrerequisite classes required: Yes \nAdjectives for a successful student: responsible, caring, accepting \n\nThe education of an early childhood practitioner integrates both theory and practice. Students are exposed to basic ideas and concepts in the classroom and then have the opportunity to put those ideas and concepts to practical use in educational settings.\nGraduates with an Associate of Applied Science degree in Inclusive Education are employed in both public and private schools and may serve as family childcare providers, family advocates, parent educators, administrators, or staff trainers. They meet the requirements of federal legislation, which require that paraprofessionals in public schools have a minimum of two years of college. Graduates may be eligible for licensure in the state of Ohio as an Educational Paraprofessional Associate.\nGraduates must satisfy degree requirements as stipulated by BGSU associate degrees. The coursework in the Associate of Applied Science degree can be applied to BGSU's bachelor's degree in Inclusive PreK - Grade 5 Education, providing all admission standards are met for entry into the bachelor's degree program.\nGraduates can expect to: \n\nCreate, teach and assess child-centered learning experiences designed to construct knowledge for all children in inclusive and diverse classrooms. \nEngage and collaborate with families, communities and other professionals to support the learning and development of all young children. \nTeach and nurture young children based on knowledge of typical and atypical child development, educational psychology and diversity in our society. \nAct as inclusive early childhood professionals who are continuous, collaborative and reflective learners, who act using ethical guidelines and who advocate for all young children and their families.\n\n\nGraduates are early childhood educators who can work with, and meet the needs of, families and children from preschool through elementary-aged students.\nMore Information\n\nUndergraduate catalog\n\nDr. Trisha Prunty Ed.D. Associate Professor\nCo-Coordinator of the Inclusive Early Childhood Program\npprunty@bgsu.edu\n419-372-0784\nMessage from the director: Allow me to offer the warmest of welcomes to new or returning students who are interested in an education program. BGSU Firelands offers amazing education programs for people who want to teach pk-grade 5 elementary or special education. The classes are in person, there is plenty of field experience and our students are hired to teach in the area after graduation.  \n","Respiratory Care":"The Respiratory Care program is part of BGSU Firelands.\nAssociate of Applied Science in\nThe Associate of Applied Science in Respiratory Care program is designed to prepare students for practice in respiratory care. Theory, laboratory and clinical experiences provide students with the skills to work as a respiratory therapist in a wide variety of clinical settings evaluating, treating and managing patients of all ages with respiratory illnesses and other cardiopulmonary disorders. Respiratory therapists provide patient care, which includes clinical decision-making and patient education.\n\n\nApply Now\nRequest Information\nSchedule a Visit\n\nSetting: Full-time, hybrid program with in-person, online, and clinical courses\n\nPrerequisites required: 2.5 GPA or higher, completed CHEM 1090\/1100, BIOL 3140\/3150, BIOL 3310, BIOL 3320 and math (MATH 1150 stats or MATH 1220 algebra)\nAdjectives for a successful student: Motivated, flexible, enthusiastic\n\nPrepare to apply\nStudents must apply by April 1 for admission consideration. Late applications may be considered if there is an open slot.\n\nApply here for admission to the college.\nComplete and submit the Respiratory Care Program admission application and return it to program director Carol Puder by email: cpuder@bgsu.edu.\nChoose to attend classes at our base program at BGSU Firelands, or at our satellite program offered through the University Partnership at Lorain County Community College.  All admitted cohorts will start in the fall semester.\n \n\nQuality hybrid classroom experiences\nStudents take a combination of in-person, online, and hybrid classes. Each hybrid course meets one hour per week in-person, with the remaining instruction completed online. All in-person components for classes are scheduled for the same day each week, from 8 a.m. to 5 p.m., with an hour lunch break. The remaining instruction is delivered asynchronously online.    \nClinical rotations start in the spring semester of the second year, and they continue for three consecutive semesters (spring, summer, and fall). Generally, students attend clinicals two days per week at various locations for either an eight- or 12-hour shift.  Students will rotate throughout various clinical sites throughout the year. Potential clinical sites range from Cleveland to Toledo. Your assigned locations will depend on your current home location. \n\nStudents can obtain a limited permit to practice respiratory care from the State Medical Board. This allows students to work part-time as a student respiratory therapist while completing the program.\nGraduates have employment opportunities in hospitals, clinics, long term care, home care, sleep lab, and specialty areas including neonatal\/pediatric critical care, cardiac\/pulmonary rehabilitation, pulmonary function testing and disease management.\nStudents can expect to:\n\nLearn to operate life support ventilators \nPerform learned skills on real hospital patients \nComplete clinical rotations for three consecutive semesters \nGain a skillset to help save lives in emergency rooms and critical care areas  \nBecome hirable for virtually any hospital or health care facility with a respiratory department\n\n\nMore Information\n\nProgram Requirements\nProgram Admission Application\nProgram Admission Observation\nMeet the Faculty\nProgram and Clinical Policies\nEstimated Program Costs\nCareer Information\nLicensure Information\nUndergraduate catalog \n Accreditation \n\nProgram Goal Statement:\nTo prepare graduates with demonstrated competence in the cognitive (knowledge), psychomotor (skills), and affective (behavior) learning domains of respiratory care practice as performed by registered respiratory therapists (RRTs)\nLearning Outcomes: Graduates from our program should be qualified to:\n\nIdentify, evaluate, apply, and integrate fundamental knowledge of respiratory care as well as advanced concepts in adult, pediatric, and neonatal patient care into the diagnostic assessment, management, and treatment of patients. \nDemonstrate competency in the clinical procedural skills associated with the role and scope of practice of a respiratory care professional. \nExhibit the set of professional behaviors expected of a respiratory therapist.\n\nCommission on Accreditation for Respiratory Care\nThe BGSU Firelands Respiratory Care Associate degree program is accredited by the Commission on Accreditation for Respiratory Care. The BGSU Firelands program number is 200339 and the LCCC satellite program number is 300009. Program student\/graduate outcomes can be found at https:\/\/coarc.com\/students\/programmatic-outcomes-data\/. CoARC accredits respiratory therapy education programs in the United States. To achieve this end, it utilizes an ‘outcomes based’ process. Programmatic outcomes are performance indicators that reflect the extent to which the educational goals of the program are achieved and by which program effectiveness is documented. Programmatic outcomes data reported on the CoARC website include: 3-year time period being reported; RRT credentialing success; Achievement of the high cut score on the TMC Exam; Retention; Job placement; Overall Graduate Satisfaction; Overall Employer Satisfaction; Total number of program enrollees; Total number of program graduates; Maximum Annual Enrollment.\nCarol Puder\nDirector, respiratory care\ncpuder@bgsu.edu\n419-372-0671\nMessage from the director: The respiratory care program at BGSU Firelands is well respected across Northern Ohio and health care facilities actively recruit our students for employment. Respiratory care is a specialized profession treating patients with cardiopulmonary diseases across all areas of the hospital including the emergency room and critical care areas. Respiratory therapists can also specialize in many areas including neonatal\/pediatrics, long-term care, sleep lab, pulmonary rehab, and pulmonary function testing. Students complete clinical requirements at award-winning medical facilities throughout northern Ohio including Cleveland Clinic, MetroHealth, University Hospitals and Mercy Health among many others. Graduates are eligible to sit for the National Board for Respiratory Care (NBRC) examinations to become a Registered Respiratory Therapist and are also able to pursue a graduate degree.\n\n","Lean Systems Management":"The industrial management specialization serves the needs of students who are interested in advancing in a career, updating skills and learning new management techniques.\nIndustrial management is primarily concerned with planning, organizing and controlling the manufacturing operation, including supervisory and management techniques and systems used in production.\nRead information about this program\n\nUndergraduate Catalog\n\nApply Now At BGSU Firelands\n","General Business Management":"The general business management technology major serves the needs of students who are interested in advancing in a business career, updating skills and learning new management techniques. The major can also be beneficial for students planning to go into a family business.\nRead information about this program\n\nUndergraduate Catalog\n\nApply Now At BGSU Firelands\n","Accounting":"The accounting major serves the needs of students who are interested in advancing in an accounting career, updating skills and learning new management techniques.\nRead information about this program\n\n\nUndergraduate Catalog\n \n\nApply Now At BGSU Firelands\n","Computer Networking Specialist":"Computer networking specialist install, configure and support the corporation's computer network. Graduates must be knowledgeable of local area networks (LAN), wide area networks (WAN), and the Internet system. Other key skills taught in the program include the ability to maintain hardware and software to keep a network available and operating securely and efficiently. The U.S. Department of Labor data indicates a 27% growth in total employment in this category through 2016.\nRead information about this program\n\nUndergraduate Catalog\n\nApply Now At BGSU Firelands\nLearning Outcomes\nUpon completion of the associate degree, students in Computer Science Technology are expected to be able to:\n\nThe ability to install and configure microcomputer hardware and operating systems, and customize the operating system interface;\nAn understanding of the operations of microcomputer hardware, firmware, and operating systems, along with the interrelationships among them;\nThe ability to install, configure, and maintain computer networking hardware, network operating systems, and network services, including accounts and configuring resources security;\nThe ability to install, configure, and maintain Internet server software and services, including Web and FTP hosting services;\nAn ability to provide Web page support by creating dynamic and interactive Web pages and programming scripts;\nAn understanding of programming principles and logic, and its application to the development of computer programs to perform specified tasks;\nAn ability to design, implement, and support the use of electronic spreadsheet applications in support of end users;\nAn ability to provide support for operating systems, both to the corporate entity and end-users alike.\n\nAccreditation and\/or Program\/Cluster Review\nBowling Green State University [BGSU] is accredited by the Higher Learning Commission.  BGSU has been accredited by the Higher Learning Commission since 01\/01\/1916. The most recent reaffirmation of accreditation was received in 2012 - 2013. Questions should be directed to the Office of Institutional Effectiveness.\n\nThe Computer Science Technology program will go through its next Program\/Cluster Review during the Academic Year 2020-21. For more information, click here.\nProfessional Licensure (If applicable)\nBowling Green State University programs leading to licensure, certification and\/or endorsement, whether delivered online, face-to-face or in a blended format, satisfy the academic requirements for those credentials set forth by the State of Ohio.\n\nRequirements for licensure, certification and\/or endorsement eligibility vary greatly from one profession to another and from state to state. The Computer Science Technology program does not lead to professional licensure.\n\nGainful Employment (If applicable)    \nUnder the Higher Education Act Title IV disclosure requirements, an institution must provide current and prospective students with information about each of its programs that prepares students for gainful\nThe Computer Science Technology program is not a recognized occupation that requires a Gainful Employment disclosure.\nSpecializations:\n\nComputer Support Specialist\nComputer Networking Specialist\n\n\n\nLearning Outcomes - Computer Networking Specialist\nUpon completion of the baccalaureate degree, students in Computer Networking Specialist program are expected to be able to:\n\nThe ability to install and configure microcomputer hardware and operating systems, and customize the operating system interface;\nAn understanding of the operations of microcomputer hardware, firmware, and operating systems, along with the interrelationships among them;\nThe ability to install, configure, and maintain computer networking hardware, network operating systems and network services, and configuring resources security;\nThe ability to install, configure, and maintain Internet server software and services, including Web and FTP hosting services;\nAn ability to provide Web page support by creating dynamic and interactive Web pages and programming scripts;\nAn understanding of programming principles and logic, and its application to the development of computer programs to perform specified tasks;\nAn ability to accomplish network wiring and cabling tasks, including making cables and punch-down connections.\n\n","Social Work":"This program graduates students competent for beginning generalist social work. Based on a liberal arts foundation, our curriculum provides students with the knowledge, skills, and values necessary for competent practice in a variety of social service settings. Preparing students for graduate study is also an important part of our mission.\nStudents successfully completing the social work program take the state license examination in order to become a licensed social worker (LSW). Social workers find employment in public welfare, corrections, health and mental health, and services to the elderly, children, and families. Social workers practice with people who are negatively impacted by economic structure, crime, victims, suffer physical and mental disabilities, and experience discrimination and oppression. Students prepare for practice with individuals, families, small groups, and communities.\nBachelor of Science in Social Work\n","Visual Media Technology":"The Visual Media Technology program is part of BGSU Firelands.   \n\nVisual Media Technology is an innovative program for students who are interested in creative and technical problem solving. Students are trained in print, photography, video and interactive media to solve visual communication problems.\n\n\nRequest information\nSchedule a visit\nApply Now \n\nSetting: Full-time, part-time, in-person \nPrerequisites required: Yes\n\nAdjectives for a successful student: creative, visual, active learner\n\nStudents become media-agile, allowing them to be able to select the most appropriate media for the problem at hand. With solid theoretical and technical preparation and study in each of these areas, the major is complemented by a core of business and liberal arts classes, which differentiates BGSU’s program from most others of its kind. Classes are composed of a combination of lecture and hands-on lab. Students use lab time to apply the knowledge learned in lecture.\n\nThe Visual Media Technology program was designed to allow a graduate to easily pursue a bachelor’s degree if desired. This program leads to the Visual Communication Technology program (offered on the BG campus) and the Bachelor of Technical and Applied Studies at BGSU Firelands, including others.\n\nPotential Jobs for Graduates\n\nWeb designer\nVideographer\nGraphic designer\nPhotographer\nVideo producer\/editor\nPrint & production coordinator\nPrint graphic specialist\nContent creator\nMarketing coordinator\nSocial media director\nCommunications manager\nAnd many more\n\n\nLearning Outcomes:\nUpon completion of the associate degree, students in the Visual Media Technology major are expected to:\n\nDemonstrate critical-thinking skills as they relate to solving visual problems;\nConceptualize and implement a visual solution in several media modes;\nDemonstrate operational level skill ability in each of the visual media areas of VCT;\nResearch and produce an organized written rationale for using a specific medium to solve a specific visual problem;\nApply knowledge of industrial applications to visual communication related technologies.\n\n \n\nKaren Black\nProgram director, Associate teaching professor \nkheebsh@bgsu.edu\n419-372-0941 \nMessage from the faculty: This program has small class sizes. This allows for one-on-one instruction and really getting to know each student. Helping them grow throughout their tenure at BGSU Firelands and beyond is one of my greatest joys and I’m thrilled to play a role in it. Additionally, students with this degree are in-demand wherever they go. Graduates find jobs working in small businesses to large enterprises in every industry. Since there are so many different types of opportunities for them, they are taught with a strong foundation that allows the ability to adapt to new and emerging technologies, diverse environments, and different industries.\n\n","Psychology 3+1":"The Psychology 3+1 program is part of BGSU Firelands.  \nBachelor of Arts OR Bachelor of Science\n\nThe psychology 3 + 1 program at Firelands allows students to complete 3 years of a BGSU Bachelor of Arts or Science in Psychology degree at the Firelands campus (paying Firelands tuition and fees) and then transfer to BGSU main campus (paying BGSU tuition and fees) for the final year of the degree.\n\n\nApply Now \nSchedule a visit\nRequest information\n\nSetting: Full-time, part-time\nAdjectives for a successful student: pro-science, curious, collegial\n\nStudents can complete many of the psychology degree requirements and parts or all of select minors (typically a cognate or sociology minor) at the Firelands campus, leaving the two upper level psychology laboratory courses and additional upper level arts and science courses to be completed at Bowling Green campus. Although this description lays out the general pathway, there is also considerable flexibility in how much time is spent at each campus and where certain courses are taken. For many psychology students, this collaboration can represent the best of both worlds: small college and big university!\n \nQuality classroom experiences\nAcademic advisors work individually with students to plan their degree programs and small class sizes allow students to have close, personal contact with their professors. Free tutoring is readily available through the Teaching and Learning Center.\nBGSU employs full-time psychology faculty, in addition to adjunct instructors, with a range of psychology experience and expertise spanning clinical psychology to social psychology to industrial\/organizational psychology.\nAll psychology courses at BGSU Firelands are delivered entirely by Ph.D.-level instructors, all with class sizes of 40 students or fewer. These faculty collectively have ties with regional businesses and national associations, have published notable research and publicly presented in fields ranging from positive psychology to personality assessment to the teaching of psychology, and are involved in local and community boards and governance related to psychology.\n\nCurriculum\nPsychology is a scholarly discipline, a scientific field, and a professional activity. Its overall focus is on the study of both human and animal behavior and related mental and physiological processes. As a scholarly discipline, psychology represents a major field of study in academic settings, with emphasis on the communication and explanation of principles and theories of behavior. As a science, it is a focus of research through which investigators collect, quantify, analyze, and interpret data describing human and animal behavior, thus shedding light on the causes and dynamics of behavior patterns. As a profession, psychology involves the practical application of knowledge, skills, and techniques for the solution or prevention of individual or social problems; the professional role also provides an opportunity for the psychologist to develop further his\/her understanding of human behavior and thus to contribute to the science of psychology.\n\nInternships & Careers\nInternships are not a requirement for a baccalaureate degree at BGSU, but they can provide valuable experience and opportunities to explore various interests.\nA considerable number of Bowling Green psychology majors go on to graduate study for advanced degrees in psychology or in other professions such as law, social work, business, health care, and medicine. Those who do not go on for further study have been successful in obtaining employment in a variety of areas. Many work in mental health care settings, schools, or social agencies, while others pursue careers in government in one of the three general areas of research, personnel, or management.\nPossible careers include:\n\nPsychologist\nPsychotherapist\nSocial worker\nCounselor\nEducational psychologist\nHuman resource manager\nTeacher\nResearch roles\nMedia roles\n\nMore Information\n\nBGSU Psychology BA or BS\nProgram Requirements\n\nChris Fluckinger\nAssociate Professor of Psychology (QR)\nDirector, Associate of Applied Science in Human Services\nAdvisor, Psychology 3+1 program\nMessage from the professor:\nGet a BGSU psychology degree with both big and small campus experiences. Looking for small class sizes, taught only by PhD and Master’s level instructors, at low regional campus tuition\/fees, with a track-record of helping students get accepted into graduate school? PSYC 3+1 at BGSU Firelands is an excellent choice!\n","Liberal Studies":"The liberal studies degree program is ideally suited for students with interdisciplinary interests beyond a single academic department or structured interdisciplinary program. This degree program is also ideal for students who enroll in courses during the evening hours. It is available only to students at the sophomore level and above.\nRead information about this program\n\nUndergraduate Catalog\n\nApply Now at BGSU Firelands\n","Technical Studies in Radiologic Science":"Radiologic technologists provide diagnostic and therapeutic services to patients of all ages in a wide variety of clinical settings. The scope of practice for radiographers includes: evaluating clinical data, performing and assisting in the performance of prescribed diagnostic studies, instructing patients about procedures they will undergo, monitoring patient responses to care provided, modifying procedures to achieve the desired information for interpretation by a radiologist or other qualified healthcare provider, providing patient, family and community education, disease prevention, participating in life-support activities as required, and following clinical practice guides.\nRead information about this program\n\nUndergraduate Catalog\n\nApply Now at BGSU Firelands\n","Technical Study":"The associate of technical study degree program is designed to help students prepare individually for specialized technical occupations. The two-year curriculum enables students to devote their particular talents and training to occupational areas not otherwise addressed by existing college programs.\nRead information about this program\n\nUndergraduate Catalog\n\nApply Now at BGSU Firelands\n","Certificates of Bookkeeping, Management, and Small Business":"The certificate programs in bookkeeping, management and supervision, and small business management serve the needs of students who are interested in beginning a business career.\nCareer Opportunities\nGraduates with a certificate in bookkeeping are able to enter a business as an accounting clerk. The management and supervision and small business management certificates give graduates the skills to effectively manage a small business. Management theory, learning how to motivate employees, keeping accurate financial records and promoting a small business are a few of the major topics in the programs that provide students with a strong knowledge base and practical skills.\nGainful Employment Opportunities  \nStudents who participate in these bookkeeping, management, and small business certificate programs will be certified for employment in various occupations. To learn more about program costs as well as employment opportunities that students may pursue upon graduation click on the appropriate link below:\nRead information about these program\n\nUndergraduate Catalog\nBookkeeping Certificate (GE)\nManagement & Supervision (GE)\nSmall Business Management (GE)\n\nApply Now at BGSU Firelands\n","Electronics & Computer Technology":"According to the IEEE Computer Society, computers are used in almost every aspect of today's life: in automobile engines, microwave ovens, video games, watches, telephones, desktops at home and work, mainframe computers in government and industry, and in supercomputers extending the frontiers of science and technology. The computer, network and Internet industries are the fastest growing segments of our economy and of the new millennium.\nMore than ever, there is a demand for a prepared work force with the scientific and technical training necessary to help American industry to maintain a competitive edge in the world market. Students who are interested in computer and network engineering technology can pursue a four-year bachelor's degree or a two-year associate degree.\nRead information about this program\n\nUndergraduate Catalog\n\n","Electromechanical Technology":"The field of electromechanical technology has revolutionized the way we live. Our entire economy and culture depend on such systems as electromagnetic induction for power generation; transformers for the delivery of electricity to homes, businesses and industry; motors, drives and programmable logic controllers for industrial process control, hydraulics and pneumatics for the transmission and control of forces and velocities. These systems can be found in virtually every kind of technology we use, from automotive, aircraft and spacecraft to agricultural and offshore-technology industries.\nRead information about this program\n\nUndergraduate Catalog\n\n"}}