{"0":{"Digital Marketing Specialist Diploma":"\n\nAvailable Formats\n\n\n\n\n\n\n\n\n\n\n\nTake the first step towards a career in marketing with the Digital Marketing Specialist diploma from Bryant & Stratton College. The Digital Marketing Specialist diploma program is designed to provide a foundation for students who are hoping to pursue a marketing career. Students learn search engine optimization, web data analytics, brand monitoring and growth practices, social media and more. The growing influence of social media on marketing practices serves as a key feature of this diploma program although students also study how to analyze and interpret web data, communicate that information to various departments and individuals within an organization. Graduates of the program will not only be prepared to step into an entry level position in marketing but they will have the ability to continue their education in the Bryant & Stratton College Digital Marketing associate degree program. OutcomesStudents in the Digital Marketing Specialist diploma gain a foundation in the following skills:\nDesign and implement effective social media marketing campaigns.\nUse digital marketing strategies to enhance brand visibility and accessibility and gain website traffic.\nCreate consumer loyalty by engaging with customers through various social media pathways.\nAnalyze consumer digital behavior and marketing campaign results to increase sales.\n\n\n","AAS Accounting":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nNot every professional in the accounting world is a Certified Public Accountant. From payroll clerks to budget analysts, many accounting professionals get their start with entry-level jobs. If you’re ready to take your accounting career to the next level, then you’re ready for the associate degree in accounting from Bryant & Stratton College.Our Associate of Applied Science (AAS) in Accounting program helps students develop the skills necessary to meet the growing demand for well-trained accountants. Students will learn the key technical processes and functions needed to handle various accounting roles in areas such as bookkeeping, payroll, budget analysis, tax preparation, financial records, auditing, and more.A Bryant & Stratton College Accounting associate degree not only provides the framework for entry-level positions with accounting firms but opens the door for graduates to pursue positions in a number of professional fields such as the retail, manufacturing, government, and service industries, as virtually every company has a need for highly skilled accountants. Plus, this AAS program offers a solid understanding of accounting essentials, topics, and principles. It’s the foundation needed to pursue additional educational opportunities, such as our accounting bachelor’s degree program, and potentially sit for the CPA exam in the future.OutcomesThe Accounting associate degree program at Bryant & Stratton College provides students with the ability to:\nAnalyze and prepare budgets and financial information, generate forecasts, maintain records, and make adjustments to meet objectives utilizing knowledge of generally accepted accounting principles (GAAPs) for varied accounting systems.\nSelect and utilize appropriate information technology to generate and analyze financial data, perform computer operations, and identify opportunities for use of information technology.\nAnalyze and interpret financial reports to assist users in the management decision-making process.\nPrepare accounting reports for internal and external users.\nGraduates of the Accounting associate degree can continue their education with the Accounting bachelor’s degree program at Bryant & Stratton College. Accounting professionals with a desire to sit for the CPA exam must first earn a bachelor’s degree in accounting.\n\n\n","AAS Business":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nA career in business can be both challenging and rewarding. Business makes its mark in every industry. It opens up doors of opportunity—from career advancement to career change. And the best way to make in-roads as a business professional (or manager) is an education in business. Start your business career right with an Associate of Applied Science (AAS) in Business from Bryant & Stratton College.An associate degree in business gives students an education in business and management essentials like communications, sales, marketing, data analysis, accounting, business law, information technology, and even retail principles. It also offers essential insights in building teams, problem solving, and ethics. The associate degree in business helps lay the foundation for a career in diverse professional fields.The broad background in business, administration, and management provided by the business associate degree program at Bryant & Stratton College gives graduates the opportunity to pursue a career with various corporations, financial institutions, manufacturing businesses, real estate firms, insurance companies, and more. Thanks to the courses they take, graduates of the Business associate degree program are prepared with the skills necessary to succeed in a number of industries in any department, from operations to human resources management.OutcomesGraduates of the business associate degree program gain:\nKnowledge in the role of business in a global environment.\nAn understanding of the primary functions of management and their application to decision-making through effective leadership skills.\nThe application of current technology skills to specific business applications such as social media and cloud technology.\nAbility to demonstrate knowledge of numeric measurements within the business environment to make informed decisions.\nGraduates of the business associate degree program have the opportunity to continue their education with Bryant & Stratton College, as the credits earned in this degree program can be transferred to a number of corresponding programs at Bryant & Stratton College, including the bachelor’s degree in general management.\n\n","AAS Digital Marketing":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nAre you looking for a college major that will prepare you to take on a future in digital media and social media marketing? Need an internet marketing degree program that will give you the insight and strategies needed to do everything from search engine analytics to content marketing optimization? Want an associate degree in marketing program that offers the skills and credential needed to pursue an entry-level digital marketing career? You found it with the digital marketing associate degree from Bryant & Stratton College.\nThe Digital Marketing Associate Degree You’ve Been Looking For\n\nToday’s successful marketing professionals need to have an understanding of a number of mediums to effectively reach the audience they’re targeting. Our digital marketing associate degree establishes a foundation in key marketing skills and topics such as social media, search engine optimization (SEO), internet research, advertising, digital analytics, and marketing strategy to provide graduates with the education necessary to pursue an entry-level career in the marketing field. As a student of the digital marketing degree program, you will focus on various technologies and techniques utilized in engaging with potential customers as well as with sales and other departments within a company. The marketing degree program also teaches a host of practices and strategies used to grow brands through different channels within the business environment. \nBuild Your Professional Brand with an Associate Degree in Marketing\n\nThe associate degree in digital marketing from Bryant & Stratton College helps with skills to not only use social media to reach customers but to create brand ambassadors and other key techniques which serve as key branding practices. This is in addition to learning how to analyze web data and other key website-focused skills. OutcomesThe digital marketing associate degree program will help you pursue marketing career opportunities on a variety of digital media platforms using the following skills:\nDesign and implement effective social media marketing campaigns.\nUse digital marketing strategies to enhance brand visibility and accessibility and gain website traffic.\nCreate consumer loyalty by engaging with customers through various social media platforms and pathways.\nAnalyze consumer digital behavior and marketing campaign results\/trends to increase sales.\n\n\n","AAS Hospitality Management - Restaurant & Hotel Services":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nDo you love the food service industry? Tourism? Restaurants? Event planning? Beverage operations? The hospitality industry as a whole? Are you looking for an education—perhaps an associate degree in tourism and hospitality—that will help you make the most of a career in the fast-paced field of food, beverage and lodging services? You found it with the associate degree in hospitality management from Bryant & Stratton College.\nThe Hospitality Management Program You’ve Been Looking For\n\nDevelop a strong background in business management with a specialized focus on hospitality with the associate degree in hospitality management from Bryant & Stratton College. Students in this applied science program will gain a strong understanding of the hospitality industry and be prepared to take on roles with hotels, sports venues, casinos, travel and tourism, and even the food and beverage industry, to name a few. The hospitality management associate degree program includes courses in human resources, marketing, and sales and finance, and teaches key fundamental hospitality practices and principles. Students not only gain the education necessary to begin a career in the hospitality field, but have the opportunity to pursue additional educational opportunities in the hospitality or management fields.OutcomesThe hospitality management associate degree program will provide students with the ability to:\nRecognize the significant core concepts in the areas of hospitality services, planning, accounting, human resources, marketing, and operations.\nClassify the entities, facets, and professions that comprise the hospitality industry.\nCompare and contrast management principles and behaviors used in making hospitality-related decisions.\nRelate social, interpersonal, legal, and ethical issues when making hospitality management decisions.\nRecommend solutions to hospitality-related situations through the examination of restaurant, hotel operations, and event-planning scenarios.\n\n\n","AAS Human Resources Specialist":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nAn associate degree in Human Resources Specialist from Bryant & Stratton College provides students with the opportunity to gain the educational components to enable them to serve in key roles in nearly every aspect of the business field. HR professionals are needed to carry out hiring practices; manage compensation, benefits, and payroll; and fill other human resources generalist roles. These are positions needed by virtually every company, whether in business, finance, manufacturing, or another area. The Human Resources Specialist associate degree program will focus on local, state, and federal employment laws and regulations while ensuring that students understand and follow standard ethical practices. Students will also gain a foundation in business and administrative skills to ensure that they are prepared for today’s modern business environment. OutcomesGraduates of the Human Resources Specialist associate degree program will have the ability to:\nComprehend the primary functions of human resources in organizations, and apply those functions in the decision-making process.\nApply information technology skills to specific human resources applications.\nDemonstrate knowledge of the economic and quantitative issues facing human resources professionals in the business environment.\nUnderstand and enforce local, state, and federal employment laws and regulations.\nDevelop and begin to apply leadership skills in various settings.\n\n\n","BBA Accounting":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nIf numbers are like a second language for you, then the bachelor’s in Business Administration degree program in Accounting at Bryant & Stratton College could open the door to your dream career. As a graduate of this undergraduate degree program, you’ll be prepared to pursue a number of entry level accounting- and financial-related careers in business, industry, government, and nonprofit organizations. In addition to augmenting your understanding of math, finance, and economic skills, you’ll gain the decision making and risk management skills you need to pursue employment with accounting firms or government agencies. This is the education and credential you need to land jobs and opportunities such as staff accountant, internal auditor, tax accountant, management accountant, financial analyst, financial manager, revenue analyst, budget analyst, or business manager.\n\nThe bachelor’s degree program in Accounting places a strong emphasis on accounting concepts, so you will benefit from a solid business foundation through complementary courses in management, finance, technology, marketing, and business law. You'll also gain critical business skills through the operations management and strategic planning courses. At the conclusion of this Bachelor of Business Administration in Accounting, you will be effectively prepared to address accounting- and business-related problems in their careers.\n\n*The BBA Accounting bachelor’s degree program does not prepare you to take the Certified Public Accountant Exam. Graduates will need to pursue additional education in order to take the CPA Exam.OutcomesFrom audits to economic policies, this BBA Accounting program provides a well-rounded education in accounting fundamentals. As a graduate, you’ll come away with the ability to:\nRecognize the commonalities between financial theory and tax law and the economic and social policy issues of taxation.\nRecord and report financial information using generally accepted accounting principles (GAAPs).\nJudge appropriate ethical behaviors that follow the laws and regulations applicable to the accounting practice.\nIntegrate theory, knowledge, and technology to interpret financial and nonfinancial information to aid decision-makers within an organization.\n\n\n","BBA Digital Marketing":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nCombining traditional business and marketing concepts, the Digital Marketing bachelor’s degree gives students a foundation in key digital practices such as search engine optimization, social media marketing, web data analysis and additional online marketing strategies. The added business management courses featured in the bachelor’s degree program builds a stronger foundation to pursue managerial positions within the marketing field. Graduates will have the education to enter the business industry head first thanks to the career-focused education they will receive. The program provides students with advanced business management and marketing concepts through a diverse set of business classes. Current techniques and technologies are a key focus as the program digs into the key aspects of social media marketing and how brand ambassadors can elevate marketing efforts to a new level. The focus on both traditional and contemporary practices ensures the Digital Marketing degree program establishes the necessary skills for graduates to succeed in a number of facets of the business and marketing field. Outcomes\nEvaluate the effectiveness of digital marketing campaigns at the local, national, and global level and propose ethical tactics to support the marketing strategy.\nUse traditional and digital marketing strategies to enhance brand visibility and accessibility, as measured by website traffic and inquiry to sales conversions.\nEngage with customers through various digital marketing pathways to build loyalty, as measured by repeat business or customer satisfaction levels.\nAnalyze consumer behavior and marketing campaign results to address business needs.\nUtilize appropriate current technology and resources to locate and evaluate information needed to accomplish a goal, and then communicate findings in visual, written, and\/or oral formats.\n\n\n","BBA General Management":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nDevelop the professional foundation to pursue exciting career opportunities in business management with a bachelor’s in Business Administration degree in General Management from Bryant & Stratton College. The General Management bachelor’s degree program provides students with the vital skills used in staff and managerial positions throughout the business field, with government agencies, and even with nonprofit organizations. The General Management bachelor’s degree program focuses on problem-solving, strategy and planning, communication and marketing, interpersonal relations, and technology. Special emphasis is placed on preparing students for the challenges of management positions through active learning techniques, practical application of research methods, team projects, and presentations.\nCourses in the General Management degree program are offered at the Greece campus. To learn more about the program at these campuses, please contact an admissions representative.OutcomesThe General Management bachelor’s degree program will provide students with the ability to:\nApply contemporary knowledge and skills in the evolving business marketplace.\nAnalyze management processes as well as the role businesses play in a high tech global economy. \nEvaluate ethical and multicultural issues within a diverse workplace environment.\nExamine a variety of business accomplishments in international and domestic markets.\n\n\n","BBA Human Resources":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nWhat is the one resource every business needs to succeed? People. In every organization in every industry, companies need employees and leaders with the talent and skill to staff every department. From operations to management to marketing to administration to, yes, even HR departments, people are core to business. And those companies and employees need HR professionals to help enact policies, train new talent, negotiate benefits, and more.If you’re ready learn what it takes to pursue an HR career, Bryant & Stratton College has the bachelor’s degree in human resources management you need to succeed in any company and every industry.Our Bachelor of Business Administration in Human Resources Management gives students the educational background necessary to pursue key HR positions and careers in nearly every aspect of the business field. As companies across a multitude of industries have the need for skilled human resources personnel, graduates have the opportunity to pursue career opportunities in human resources across a wide range of organizations. Whether in the nonprofit field, the public sector, healthcare, manufacturing or many other professions, graduates will have the skills needed to pursue job opportunities in HR.A diverse course load will introduce students to local, state and federal employment laws; ethical business practices; vital details in compensation and benefits; employee training; how to cultivate a positive company culture; initiate HR technology applications; staffing and other key administration skills. Whether they complete the bachelor’s degree in human resources management online or on campus, graduates will possess the knowledge to effectively make strategic decisions to maximize organizational productivity and profitability through staffing, payroll, benefits and more.  SHRM AlignedBryant & Stratton College’s Bachelor of Business Administration in Human Resources has been recognized by the Society of Human Resource Managers (SHRM) as aligning with their HR Curriculum Guidebook and Templates. That means our BBA in HR program is authorized to award professional development credits for SHRM members to count toward certification for SHRM Certified Professionals (SHRM-CP®) or SHRM Senior Certified Professionals (SHRM-SCP®).The SHRM Certification and Recertification programs empower individuals and businesses to maximize human potential by elevating the HR profession. Through these certification programs, HR professionals are able to hone their skills and develop their knowledgebase, ensuring a high standard of human resource management. Upon successful completion of the certification exam, credential holders are required to recertify every three years by earning 60 professional development credits (PDCs) or retesting within the three-year cycle.At Bryant & Stratton, our faculty and staff work with you to ensure you are earning the maximum PDCs possible as you earn your degree. Our BBA in HR aligns with one or more components outlined in the SHRM Body of Applied Skills and Knowledge™ (BASK™), the foundation of SHRM certification and recertification.              Outcomes\nIdentify the value of human resource management and its role in organizational operations and strategy such as recruiting, testing and interviewing programs; counseling managers on candidate selection; conducting and analyzing exit interviews; and creating job descriptions.\nApply knowledge of various business disciplines to problem solve and promote organizational viability. \nCreate employee training and development systems aligned to organizational goals to promote success. \nDevelop a code of ethics that includes sexual harassment and diversity components. \nAnalyze employee trainings and development systems aligned to individual and organizational goals to promote success. \nSolve various labor and employment challenges in nonprofit, for-profit, and public sectors. \nEvaluate strategic compensation and benefits tactics to increase overall organizational productivity.\n\n\n","BPS Organizational Leadership":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nThe Bachelor of Professional Studies in Organizational Leadership program at Bryant & Stratton College provides students with the management skills, practical insights and in-depth understanding of organizational behavior needed to take leadership roles on teams, in departments and for whole organizations. With its emphasis on the “professional” part of professional studies, this program prepares students to overcome organizational challenges with practical insights and skills they can adapt to real-world situations throughout their careers.Graduates of this Bachelor of Professional Studies (BPS) program will gain the vital skills used in managerial positions in a number of fields and businesses, from private industry to government agencies to nonprofits. They become their organization’s go-to problem solvers, strategists and planners. The leadership skills and strategic insights provided by this degree for professionals gives students the confidence and foundational knowledge needed to excel in leadership roles ranging from team leader to sales division manager to the C-Suite.OutcomesThis organizational leadership degree program provides students with the ability to:\nOrganize and facilitate industry practices and in relevant areas and fields\nDevelop an analytical eye for tracking, reporting and successfully leading projects\nEmploy critical-thinking, problem-solving and decision-making skills in the workplace\nCommunicate effectively with a foundation of written and oral communication skills\n\n\n","Early Childhood Care and Development Diploma":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nHave you been thinking about pursuing a teaching career in early care? Take the first step with a program for a diploma in early childhood education from Bryant & Stratton College.Graduates of our Early Childhood Care & Development diploma program are will prepared to pursue rewarding career opportunities in early child development settings. With key courses that lay the foundation for guiding and evaluating the educations of young children, as well as the developmental needs of toddlers and infants, this diploma program provides a solid first step toward a future as an educator.Students in the Early Childhood Care & Development diploma program are well-prepared to work with young children from infancy through middle-childhood in learning environments such as childcare centers—both home and center-based—child development programs, intervention programs, recreation programs and more. This diploma in early childhood education can also be a steppingstone toward an associate degree education, including the Early Childhood Education Associate of Applied Science degree program at Bryant & Stratton College, or even on to bachelor’s degree or master’s degree opportunities.Take Your Early Care Teaching Career to the Next Level\nThe 36-credit-hours of courses in the Early Childhood Care & Development diploma can be used to help fulfill the 120-hour educational requirement for the National Child Development Associate (CDA) Credential awarded through the Council for Professional Recognition. As the most widely recognized credential in the Early Childhood Education (ECE) field, students are encouraged to apply for the CDA upon completion.The Council for Professional Recognition has specific requirements for the Child Development Associate credentialing process in addition to the formal education components included in these programs. A career in the field of Early Childhood Education may involve earning certain licenses or certificates, getting additional training, or meeting other requirements that can vary by vocation and state. Bryant & Stratton College recommends all applicants check with the licensing agency in their state for specific requirements*. The Bryant & Stratton College early childhood education programs involve an early childhood practice experience which may be completed within a live childcare environment.  All applicants to either early childhood program should be aware that employers may consider numerous factors when determining eligibility or suitability for employment including, but not limited to, criminal background screening, U.S. citizenship, state residency, physical and psychological health, age and military discharge information.  A criminal conviction and\/or record of certain other conduct may prevent or hinder a student’s completion of their required practice experience or a graduate’s employment in the field of Early Childhood Education.  The enrolling applicant has been apprised of these matters and enrolls in this program with full understanding of the same.\n* Virginia residents should refer to licensure regulations for school personnel at the following government site:  https:\/\/law.lis.virginia.gov\/admincode\/title8\/agency20\/chapter22\/.\nTeacher candidates will find additional information at the Virginia Department of Education at the following address:\nVirginia Department of Education\nJames Monroe Building\n101 N. 14th Street\nRichmond, VA  23219\nhttp:\/\/www.doe.virginia.gov\/OutcomesTaken online or on campus, our Early Childhood Care & Development diploma program provides students with the ability to:\nImplement developmentally appropriate lessons and daily activities designed to foster the social, emotional, physical, intellectual and creative growth of every child.\nIntegrate health, safety and nutrition practices according to local, state and national standards.  \nCreate respectful, reciprocal relationships with children's families and communities to foster involvement and support children's development and learning.\nUpon graduation, students are encouraged to apply for the CDA credential\nEarly Childhood Education Academic Program Disclosures\n\n","AAS Early Childhood Education":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nThe Early Childhood Education associate degree program provides students with a foundation in childhood theory and how it’s applied in educational and childcare settings. Students will gain an understanding of early childhood theory and how it can be applied with children from infancy through middle childhood.Graduates of the degree program will have the ability to work at childcare centers, Head Start programs, child development programs, early intervention programs, and public education classrooms. Students will develop the ability to plan, implement and assess learning experiences, guide behavior, and communicate and collaborate with families and colleagues to form a safe and happy learning environment for children.The courses in the Early Childhood Education associate degree fulfill the 120-hour educational requirement for the National Child Development Associate (CDA) Credential awarded through the Council for Professional Recognition. As the most widely recognized credential in the Early Childhood Education (ECE) field, students are encouraged to apply for the CDA upon completion.The Council for Professional Recognition has specific requirements for the Child Development Associate credentialing process in addition to the formal education components included in these programs.  A career in the field of Early Childhood Education may involve meeting certain licensing, training, and other requirements that can vary by vocation and state.  Bryant & Stratton College recommends all applicants check with the licensing agency in their state for specific requirements*.  The Bryant & Stratton College Early Childhood Education programs involve an early childhood practice experience which may be completed within a live childcare environment.  All applicants to either Early Childhood program should be aware that employers may consider numerous factors when determining eligibility or suitability for employment including, but not limited to, criminal background screening, U.S. citizenship, state residency, physical and psychological health, age, and military discharge information.  A criminal conviction and\/or record of certain other conduct may prevent or hinder a student’s completion of their required practice experience or a graduate’s employment in the field of Early Childhood Education.  The enrolling applicant has been apprised of these matters and enrolls in this program with full understanding of the same. *Virginia residents should refer to licensure regulations for school personnel at the following government site:  https:\/\/law.lis.virginia.gov\/admincode\/title8\/agency20\/chapter22\/. \nTeacher candidates will find additional information at the Virginia Department of Education at the following address:\nVirginia Department of Education\nJames Monroe Building\n101 N. 14th Street\nRichmond, VA  23219\nhttp:\/\/www.doe.virginia.gov\/\nOutcomesStudents in the Early Childhood Education associate degree program establish a foundation in the following areas:\nDesign, execute and assess meaningful, challenging curricula that promote comprehensive child development and learning outcomes for every child.\nObserve, document and assess to support teaching and learning for young children and families.\nIncorporate developmentally-appropriate guidance strategies to positively impact child-behavior and social-emotional development.\nUpon graduation, students are encouraged to apply for the CDA credential.\n    \nEarly Childhood Education Academic Program Disclosures\n\n","AAS Networking Technology":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nModern technology plays a role in virtually every aspect of the professional world. Whether in education, business, manufacturing, or elsewhere, the need for functional computer networks continues to grow. As the reliance on computer networks grows, so does the reliance on skilled IT professionals. The AAS Networking Technology degree program at Bryant & Stratton College prepares students to fill a networking position in the information technology field through a diverse education that focuses on the theory and hands-on practice utilized by IT professionals. Students will gain the technical skills necessary to install, configure, secure, administer, and troubleshoot network systems. Additional focus is placed on network hardware components and gaining experience working with modern voice and data networks. Students work through simulation labs that adhere to current trends and practices within the field.Graduates of the Network Technology associate degree program will be prepared and encouraged to take three industry certification exams which stand out to employers. The exams include CompTIA A+, Security+ and Network+ as the program's curriculum fulfills the requirements assessed by those exams. OutcomesThe Networking Technology associate degree program provides students with the ability to:\nEffectively communicate with end users, managers, and peers of a technical and non-technical nature.\nInstall, configure, secure, administer, and troubleshoot network systems. \nResearch, identify, evaluate, recommend and specify the components of complete systems relative to hardware\/software needs of an enterprise. \nApply logical, legal, and ethical principles in planning and implementing information systems.\nDemonstrate the ability to translate technical information into business language to meet organizational needs.\n\n\n","Health Services Administration Assistant Diploma":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nTake the first step toward a career in healthcare with the Health Services Administration Assistant diploma from Bryant & Stratton College. As the healthcare industry continues to grow as does the need for skilled candidates to fill new positions. The Health Services Administration Assistant diploma program will provide students with the training to begin a career in the healthcare field.Thanks to the career-focused curriculum, graduates of this diploma program will be qualified for numerous entry-level positions dealing with various features of the administrative side of the healthcare industry. Students will be capable of handling clerical functions and legal and financial systems with private practices, hospitals, healthcare providers, insurance companies, and many other areas of the industry. Courses in the Health Services Administration diploma are also offered at the Amherst, Buffalo, Henrietta and Syracuse campuses. To learn more about the program at these campuses, please contact an admissions representative.OutcomesThe Health Services Administration Assistant diploma program will provide students with the ability to:\nEmploy critical thinking and health-related skills to effectively manage and oversee various roles in the healthcare field.\nEmploy the necessary managerial and financial skills to effectively work in administrative and clerical roles in clinical settings.\nUnderstand the procedures and terminology in the healthcare industry in order to step into entry-level positions in the field. \nApply records management and scheduling skills to administrative healthcare industry standards.\nFurther their education by transferring credits into an associate or bachelor’s degree.\nGraduates of this program may apply courses and earned credits toward the associate or bachelor’s degree in Health Services Administration at Bryant & Stratton College.Health Service Assistant Academic Program Disclosures\n\n","Medical Office Assistant Diploma":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nThinking about medical career without the medical degree? Want to help patients, but not ready to become a physician, nurse, or lab tech? Bryant & Stratton offers a solution that will help you chart your course, giving you the training to become part of the healthcare solution on the business side: our Medical Office Assistant (MOA) diploma.The Medical Office Assistant diploma program from Bryant & Stratton College establishes a key stepping-stone for students to pursue a career in the medical field as administrators, records keepers, front desk specialists, and more. Graduates of this diploma program qualify for numerous entry-level positions in the healthcare field. Students will be prepared for roles in hospitals, private practices, nursing homes, and long-term-care facilities, and even with insurance providers. The Medical Office Assistant diploma program specifically focuses on front-office and other administrative positions in healthcare. Students will be capable of effectively operating within healthcare systems and processes and performing various managerial tasks. Scheduling appointments, handling records, and maintaining the front office are just a few examples of back-office work that needs to happen to help operations run smoothly. Positions include, but are not limited to, medical secretary and medical assistant positions, based on courses that focus on the medical expertise utilized in these demanding roles. OutcomesThe Medical Office Assistant diploma program will provide students with the ability to:\nPractice professional, interpersonal relations within the patient\/client relationship using knowledge of medical and legal ethics.\nApply record management and scheduling skills to the level of healthcare industry standards.\nPerform diverse tasks and responsibilities, including organizational and clerical duties within a healthcare setting.\nApply coding, billing, records management, transcription, and scheduling comprehension to administrative healthcare industry standards.\nEnsure confidentiality and fulfill HIPAA standards for the creation, distribution, and release of medical information.\nCredits earned can be transferred to a corresponding medical degree program at Bryant & Stratton College. Students may transfer credits to the Medical Administrative Assistant, Medical Reimbursement and Coding associate degree programs, and even the Health Services Administration bachelor’s degree program.\n\n","Practical Nursing Diploma":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\n\n\nPUBLIC NOTICE OF UPCOMING ACCREDITATION REVIEW VISIT BY THE ACENBryant & Stratton College Akron Campus wishes to announce that it will host a site visit for continuing accreditation of its Diploma in Practical Nursing by the Accreditation Commission for Education in Nursing (ACEN).You are invited to meet with the site visit team and share your comments about the program in person at a meeting scheduled at 1:00pm-2:00pm (EST) on Wednesday, September 20, 2023, at the Bryant & Stratton College, Akron Campus located at 190 Montrose West Avenue, Akron, Ohio 44321.Written comments are also welcome and should be submitted directly to:\nDr. Nell Ard, Interim Chief Executive Officer\nAccreditation Commission for Education in Nursing\n3390 Peachtree Road Northeast, Suite 1400 Atlanta,\nGA 30326\nOr email: nard@acenursing.org\nAll written comments should be received by the ACEN by September 5, 2023.PUBLIC NOTICE OF UPCOMING ACCREDITATION REVIEW VISIT BY THE ACENBryant & Stratton College Parma\/Solon Campuses wishes to announce that it will host a site visit for continuing accreditation of its Diploma in Practical Nursing by the Accreditation Commission for Education in Nursing (ACEN).You are invited to meet with the site visit team and share your comments about the program in person at a meeting scheduled at 12:30pm-1:30pm (EST) on Wednesday, September 27, 2023, at the Bryant & Stratton College, Parma Campus located at 12955 Snow Road, Parma, Ohio 44130.Written comments are also welcome and should be submitted directly to:\nDr. Nell Ard, Interim Chief Executive Officer\nAccreditation Commission for Education in Nursing\n3390 Peachtree Road Northeast, Suite 1400 Atlanta,\nGA 30326\nOr email: nard@acenursing.org\nAll written comments should be received by the ACEN by September 12, 2023.Licensed practical nurses (LPN) play a pivotal role on the healthcare team. Working under the supervision of doctors and nurses, LPNs serve as caregivers and contribute to the treatment plan for patients in numerous areas of the healthcare field. The Practical Nursing diploma* at Bryant & Stratton College provides students the opportunity to continue their education with the Nursing associate degree, as they are eligible to transfer credits from the PN diploma to the Nursing associate degree program upon passing the National Council Licensure Examination for Licensed Practical\/Vocational Nurses (NCLEX-PN) exam and possessing a Practical Nursing license.Through classroom and clinical experience, this accredited practical nursing program prepares students to become licensed practical nurses. An LPN provides care to their patients in a variety of healthcare environments, including hospitals, physicians’ offices, clinics, nursing homes, assisted living facilities, rehabilitation centers, and home healthcare settings. Upon completion of the LPN classes in this diploma program, graduates will be able to pursue a number of patient care career opportunities in both clinical and laboratory healthcare situations.The PN diploma prepares students for the NCLEX-PN exam. Upon completion of the diploma, students will be eligible to pursue their nursing license by taking the National Council Licensure Examination (NCLEX-PN) provided they meet the requirements of the state board of nursing*Available at the Akron, Parma and Solon, OH; Hampton and Richmond, VA and Racine, Wauwatosa and Bayshore, WI Campus locations.Bryant & Stratton College practical nursing diploma programs are located in Akron, Parma and Solon, OH; Hampton and Richmond, VA; Wauwatosa, Bayshore and Racine, WI. The Ohio Board of Nursing views Akron as a stand-alone program and the Parma and Solon campuses are viewed as one program. The licensed practical nurse diploma program offered at the Akron, Parma and Solon campuses have full approval by the Ohio Board of Nursing. The Virginia Board of Nursing views Hampton and Richmond campuses as stand-alone programs. The licensed practical nurse diploma program offered at the Hampton Campus has initial approval by the Virginia Board of Nursing. The licensed practical nurse diploma program offered at the Richmond Campus has full approval by the Virginia Board of Nursing. The licensed practical nurse diploma program offered at the Wauwatosa, Bayshore, and Racine campuses are viewed as one program and are approved by the Wisconsin Board of Nursing.Accreditation Commission for Education in Nursing (ACEN)The practical nursing program at Bryant & Stratton College at the:\nAkron campus, located in Akron, Ohio is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for this practical nursing program is continuing accreditation.\nMilwaukee West Campus (with branch campuses in Bayshore and Racine) located in Wauwatosa, Wisconsin is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for the practical nursing program is continuing accreditation.\nRichmond Campus located in North Chesterfield, Virginia is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for the practical nursing program is continuing accreditation.\nSolon\/Parma Campus located (with a branch campus in Parma) in Solon, Ohio is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for the practical nursing program is continuing accreditation.\n\nAccreditation Commission for Education in Nursing (ACEN)\n3390 Peachtree Road NE, Suite 1400\nAtlanta, Georgia 30326\n(404) 975-5000\nwww.acenursing.org\nEffective November 17, 2022, the practical nursing program offered at the Hampton Campus is a candidate for initial accreditation by the Accreditation Commission for Education in Nursing. This candidacy status expires on November 17, 2024. Accreditation Commission for Education in Nursing (ACEN)\n3390 Peachtree Road NE, Suite 1400\nAtlanta, GA 30326 \n(404) 975-5000\nhttp:\/\/www.acenursing.com\/candidates\/candidacy.asp\nNote: Upon granting of initial accreditation by the ACEN Board of Commissioners, the effective date of initial accreditation is the date on which the nursing program was approved by the ACEN as a candidate program that concluded in the Board of Commissioners granting initial accreditation.OutcomesThe Practical Nursing diploma program gives students throughout the region, from Akron to Richmond and beyond, the ability to:\nProvide safe, relationship-centered nursing care and contribute to the nursing process, which has a foundation of critical thinking and evidence-based practices.\nFunction as a member of an interdisciplinary healthcare team using legal and ethical principles. \nUtilize effective communication methods which manage information, prevent errors, and support decision-making necessary for the provision of quality patient care and continuous quality improvement.\nUtilize leadership skills in various settings as a collaborator of care.\nImplement professional and personal behaviors that exhibit spirit of inquiry, self-determination, dignity, uniqueness of others, caring and respect resulting in effective relationship-centered care.\nWisconsin Nursing Academic Program DisclosuresVirginia Nursing Academic Program DisclosuresOhio Nursing Academic Program Disclosures\n\n","AAS\/ADN Nursing":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\n\n\n\nLooking for a program that will give you the tools to become a registered nurse (RN)? Want a 2-year degree from an accredited college, one that will put you on course for your RN to BSN in a few years? You can get there with the associate degree in nursing (ADN) from Bryant & Stratton College. Let our career-focused ADN nursing degree help you take your place within the nursing profession.\nThe ADN Nursing School You’ve Been Looking For\n\nThe nursing associate degree at Bryant & Stratton College* uses a combination of classroom, laboratory, and clinical experiences to build critical-thinking skills and prepare students for a career in the healthcare industry. Nursing students will develop a foundation in vital clinical decision-making processes along with additional career-specific duties that include computer-aided instruction, telecommunications technology, clinical practice, and other technical learning strategies. Graduates of this associate degree program will be prepared for the various roles nurses are expected to perform in the 21st-century workplace.Bryant & Stratton College’s associate degree in nursing prepares students to become safe and effective entry-level nurses through a relevant, high-quality, and modern nursing courses, complete with clinical hours. Courses equip graduates with the knowledge they need to pursue their nursing license, preparing them to take the National Council Licensure Examination for Registered Nurses (NCLEX-RN) exam upon graduation. They will be required to take the NCLEX-RN review course and pass the NCLEX-RN test prior to obtaining employment as a registered nurse in a variety of healthcare facilities and settings. Clinical sites and employers will require background checks and drug screening. Accreditation Commission for Education in Nursing (ACEN)The associate nursing program at Bryant & Stratton College at the:\nAkron campus, located in Akron, Ohio is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for this associate nursing program is continuing accreditation.\nHampton Campus located in Hampton, Virginia is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for the associate nursing program is initial accreditation.\nMilwaukee West Campus (with branch campuses in Bayshore and Racine) located in Wauwatosa, Wisconsin is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for the associate nursing program is continuing accreditation.\nRichmond Campus located in North Chesterfield, Virginia is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for the associate nursing program is continuing accreditation.\nVirginia Beach Campus located in Virginia Beach, Virginia is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for the associate nursing program is initial accreditation.\nSolon\/Parma Campus located (with a branch campus in Parma) in Solon, Ohio is accredited by the ACEN. The most recent accreditation decision made by the ACEN Board of Commissioners for the associate nursing program is continuing accreditation.\n\nAccreditation Commission for Education in Nursing (ACEN)\n3390 Peachtree Road NE, Suite 1400\nAtlanta, Georgia 30326\n(404) 975-5000\nwww.acenursing.org\nView the public information disclosed by the ACEN regarding these programs at\nhttp:\/\/www.acenursing.com\/accreditedprograms\/programsearch.htm\n*The associate degree in nursing is offered in three states at Akron, Parma and Solon,\nOH; Wauwatosa, Bayshore and Racine, WI; Hampton, Richmond, and Virginia Beach, VA\ncampuses.\n\nOutcomesThe nursing associate degree program at Bryant & Stratton College provides students in Ohio, Wisconsin, and Virginia with the ability to:\nEmploy critical thinking and reasoning to utilize the nursing process as a framework to deliver comprehensive, safe, and culturally sensitive care across the lifespan.\nDemonstrate clinical competence in the performance of nursing skills utilizing quality measures to provide safe effective care.\nApply best current evidence and appropriate nursing judgment in collaboration with the patient to guide clinical decision making in the delivery of nursing care.\nCollaborate and communicate effectively with patients, families, and their social support system, and the members of the healthcare team to achieve mutually agreed upon patient outcomes.\nPractice within the ethical, legal, and regulatory frameworks of professional standards for nursing, including employing agencies’ standards of care, assuming students had no past conduct or convictions, which prevent such practice.\nConstruct a framework of personal accountability for lifelong learning with an entry-level set of knowledge, skills, and behaviors to provide safe, effective nursing care.\n\tEmploy information literacy skills through the effective use of informatics to communicate, manage knowledge, mitigate errors, and support decision making.\nPlus, graduates of the ADN nursing program will be well-prepared for additional education, such as a Bachelor of Science in Nursing (BSN) degree-completion program.Wisconsin Nursing Academic Program DisclosuresVirginia Nursing Academic Program DisclosuresOhio Nursing Academic Program Disclosures\n\n","AAS Health Services Administration":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nNot everyone in the health services industry is a medical professional or clinician. From healthcare facilities and clinics to medical offices and hospital systems, there is a growing need for well-trained healthcare management and support professionals. Make your move with a healthcare administration associate degree from Bryant & Stratton College.Graduates of our Health Services Administration associate degree program gain the education and credentials necessary to pursue entry-level positions throughout the healthcare industry. Coursework for this 60-credit associate degree program covers math, medical ethics, and other business medicine topics. These courses prepare students to pursue relevant certifications as well as job opportunities managing various aspects within a doctor’s office or other healthcare venues such as hospitals, nursing homes, and long-term-care facilities. Specifically, students will gain a foundation to handle business and administrative duties that include controlling finances and payroll, staff hiring and management, managing electronic medical records, administrative coordination, and more.As the demand for skilled healthcare professionals continues to grow, opportunities on the business and administrative sides of the field will grow as well. In addition to completing the healthcare-specific courses that make up the degree, students will gain a strong understanding of basic business management skills, which will translate directly to job duties upon graduation. Or they can use their healthcare administration associate degree as a first step toward a bachelor’s degree, such as the Health Services Administration bachelor’s degree offered at Bryant & Stratton College.Courses in the Health Services Administration associate degree are also offered at the Amherst, Buffalo, Henrietta and Syracuse campuses. To learn more about the program at these campuses, please contact an admissions representative.OutcomesThe Healthcare Administration program will provide students with the ability to:\nEffectively work in administrative and managerial roles in clinical settings. \nUnderstand the needs of patients or clients within health and human services organizations. \nApply contemporary knowledge and skills sets to perform diverse administrative responsibilities in health and human services environments. \nDemonstrate ethical and legal communication techniques specific to the health and human services environments.\nFunction as a team member to support the goals and objectives of an integrated healthcare system.\nHealth Service Administration Academic Program Disclosures\n\n","AAS Medical Administrative Assistant":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nYou enjoy helping others and are curious about the future ahead on the administrative side of the medical and healthcare industry. Scheduling appointments, handling patient records, and keeping front-office operations ship-shape are just a few areas where you can make a difference as a certified administrative specialist or medical office manager. Find the education you need to pursue certifications for this growing field with the medical administrative assistant associate degree program from Bryant & Stratton College.\nThe Medical Administrative Assistant Program You’ve Been Looking For\n\nGain the skills needed to take on a role in a medical office handling front-end administrative duties or medical billing with the medical administrative assistant associate degree program from Bryant & Stratton College. The medical administrative assistant associate degree program does not focus on patient care; rather, it focuses on the business and administrative sides of the medical field. Students will take courses designed to develop a foundation of business and administrative practices specific to the medical field while also gaining a strong background in the key practices of medical billing. Graduates of the medical administrative assistant degree program have the opportunity to earn the ACT National Career Readiness Certificate (ACT NCRC), a credential which is regarded as a valid predictor of job performance and is often looked for by employers. OutcomesThe medical administrative assistant associate degree program provides students with the ability to:\nUnderstand and apply HIPAA standards for the creation, distribution and release of medical information. \nWork in a variety of healthcare settings including private practices, clinics, public health departments, insurance agencies, outpatient services and even government agencies.\nPractice professional interpersonal relations with diverse patient\/client customers, using knowledge of medical\/legal and ethical issues.\nPerform diverse administrative duties, including the management and processing of information and the organization and design of communication procedures.\nUse computer and informational skills required to perform administrative duties in a healthcare setting.\n\n\n","AAS Medical Assisting":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\n\n\nSearching for a way to be part of the healthcare solution—helping patients achieve better outcomes—without pursuing a medical degree with all its classes in anatomy, real-world clinicals, and accompanying certifications? Want to make a difference in patient care checking vital signs, maintaining medical records and assisting with clinical procedures in medical offices and healthcare facilities? An associate degree in medical assisting could be for you. Find the education you need to become a certified medical assistant (CMA) with an Associate of Applied Science in Medical Assisting from Bryant & Stratton College.\nThe Medical Assisting AAS Program You’ve Been Looking For\n\nThe Medical Assisting Associate of Applied Science (AAS) degree program at Bryant & Stratton College is designed to prepare students for a rewarding career in the medical field. Graduates will gain the critical-thinking skills and medical education they need to pursue career opportunities with private practices, hospitals, clinics, or perhaps even certain government agencies. The medical assisting degree will prepare students with the key cognitive, psychomotor, and affective skills required by employers in today’s healthcare field.Medical assistants are multiskilled health professionals specifically educated to work in ambulatory settings performing administrative or clinical duties focused on patient care. They can be found in a number of healthcare and administrative settings, from the hospital laboratory to physiology clinics. Students in the program participate in classroom and laboratory activities that include typing\/transcription, communications, taking vital signs, microscopy, and vision testing.\nPursue Your Medical Assisting Associate Degree in New York, Ohio, Virginia or Wisconsin\n\nThe medical assisting programs offered at Amherst, Akron, Bayshore, Buffalo, Solon, Greece, Hampton, Henrietta, Parma, Racine, Richmond, Orchard Park, Syracuse, Liverpool, Virginia Beach, and Wauwatosa are accredited by the Commission on Accreditation of Allied Health Education Programs (www.caahep.org), on recommendation of the Medical Assisting Education Review Board (MAERB). Contact information: Commission on Accreditation of Allied Health Educational Programs, 25400 U.S. Highway 19 North, Suite 158, Clearwater, FL 33763  (727) 210-2350  www.caahep.orgOutcomes\nThe medical assisting degree program at Bryant & Stratton College provides students throughout the region, from Syracuse to Buffalo and beyond, with the ability to do the following:\nCommunicate and collaborate professionally and effectively with patients, healthcare team, and third-party providers in diverse environments.\nDemonstrate a mastery of a complex body of knowledge and specialized skills in the cognitive (knowledge), psychomotor (skills), and affective (behavior) learning domains.\nDemonstrate and practice behavior consistent with the legal and ethical standards of the profession.\nDemonstrate standard, quality, safety, and risk-reduction precautions in the healthcare setting.\nNot offered online.Medical Assisting Academic Program Disclosures\n\n","BS Health Services Administration":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nThe continued growth of the healthcare industry has created a need not only for skilled patient care positions such as nurses or medical assistants but for administrative and managerial positions as well. The Health Services Administration bachelor’s degree program at Bryant & Stratton College provides students with an education that translates to administration positions in the medical field at hospitals, clinics, long-term-care facilities, doctor’s offices, and more. The bachelor’s degree program in Health Services Administration provides students with a comprehensive foundation in health-related knowledge and concepts as well as the management of health services and facilities, with emphases on finance, legal aspects in healthcare, disaster planning and management, and information systems. Graduates of the program will have an understanding of real-world applications for the theory and practices utilized in administration and management roles within the healthcare industry. Clinical sites and healthcare facilities require background checks and drug testing.  Courses in the Health Services Administration bachelor’s degree program are also offered at the Amherst, Buffalo, Henrietta and Syracuse campuses. To learn more about the program at these campuses, please contact an admissions representative.\nOutcomesThe Health Services Administration bachelor’s degree program will provide students with the ability to:\nAnalyze and apply contemporary knowledge and skill sets to work effectively in a managerial capacity in a health services setting.\nUse legal and ethical principles to analyze and apply management practices of healthcare organizations and delivery of patient care.\nUtilize effective skills in financial planning, project management, human resources development, public safety, and emergency disaster planning in health services administration.\nHealth Service Administration Academic Program Disclosures\n\n","BBA Medical Services Management":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nClinical positions aren’t the only area of the healthcare industry that’s growing. Career opportunities in management or administration or another area of the healthcare field experiencing growth, opening the door for college graduates with both business and medical-focused skills. Through the Medical Services Management bachelor’s degree program, students can obtain the foundational skills to pursue positions in hospitals, clinics, private practices, long-term care facilities, insurance companies and many other settings within the healthcare industry. In addition to providing students with a strong foundation in healthcare-focused courses, the bachelor’s in Medical Services Management also focuses on key business and administrative functions. Students will apply knowledge and analytical skills to issues of policy, information technology, budget and planning within the medical field. The skills obtained in the Medical Services Management degree will allow students to support and guide resources for quality patient careClinical sites and healthcare facilities require background checks and drug testing.OutcomesThe Medical Services Management bachelor’s degree program provides students with the ability to: \nRecognize the impact multi-facets of health care economics, policy regulation, risk management, ethics and legal responsibilities have on the medical services continuum.  \nCollaborate with others to provide professional medical services without bias in a diverse work environment.\nApply project management skills to planning, coordination, and implementation of medical services to improve operational efficacy.\nEvaluate current issues in medical services settings and create plans to resolve issues and improve outcomes. \n\n\n","Criminal Justice & Security Services Diploma":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nEstablish the foundation to pursue a career path in criminal justice with the Criminal Justice & Security Services diploma from Bryant & Stratton College. This 30-credit diploma program prepares graduates for a number of entry-level positions within the criminal justice field.We designed our Criminal Justice Studies & Security Services diploma program using key employer feedback to ensure that students are getting an in-depth, career-ready education. As a result, the education provided in this diploma program translates directly to career opportunities in the field. Jobs in juvenile justice, law enforcement, parole, and probation are just some of the career opportunities graduates will be prepared for. Many careers in criminal justice have additional requirements such as background checks, academy training, and physical fitness standards. These mandates often vary on a state-by-state or city-by-city basis, and students are urged to research any potential post-education requirements in their region as they prepare to pursue a diploma in Criminal Justice & Security Services. Courses in the Criminal Justice Studies diploma program are also offered at the Amherst campus. To learn more please contact an admissions representative.\nOutcomesThe Criminal Justice & Security Services diploma will provide students with the ability to:\nRecognize safety and security concerns such as threat awareness and the procedures and equipment used to secure suspects or prisoners. \nPrepare investigative case notes, juvenile treatment plans, research services, and more. \nIdentify and characterize the origins and components that comprise the justice system at the federal, state, and local levels.\nUnderstand the impact and importance of technology for careers in the criminal justice field. \nDemonstrate knowledge and skills employers expect of new hires entering the career field. \nGraduates of this program may apply courses and earned credits toward the associate degree in Criminal Justice Studies at Bryant & Stratton College.\n\n","Human and Social Services Assistant Diploma":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\n\n\nWondering how to be a social worker? A strong understanding of the changing needs of patients and clients within the human and social services field has become a mandate for anyone seeking a career in human and social services. The Human and Social Services Assistant diploma program from Bryant & Stratton College provides students with the foundation and framework to grasp the ethical and legal parameters for treating patients in the human and social services setting. Students can earn a Human and Social Services Assistant diploma in as little as two semesters with full-time study and be prepared to pursue career opportunities in various types of social work such as human services assistance, community health work, and case management, among others. Proper and professional communication skills will be developed in this program, as it is important to understand and communicate not only the needs of clients but also the needs of supervisors and managers within the field.OutcomesCourses and curriculum in the Human and Social Services diploma program provide students with the ability to:\nDevelop an understanding of the reasons clients seek out treatment in the human and social services setting.\nDemonstrate ethical and legal communication techniques specific to the human and social services environment.\nSupport the assessment of client concerns and available resources to match support services to improve quality of life of the client\/customer\/patient.\nPerform a diverse set of duties specific to the support and treatment of clients.\nGain an understanding of the needs of patients and clients within the human and social services field. \nGraduates of this program may apply courses and earned credits toward the associate degree in Human and Social Services at Bryant & Stratton College.Human and Social Services Academic Program Disclosures\n\n","AAS Criminal Justice Studies":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nThe associate degree in Criminal Justice Studies from Bryant & Stratton College provides students with the education they need to pursue career opportunities in numerous areas of the criminal justice and legal fields. Graduates of this associate degree program will be qualified to work in law enforcement, corrections, security, the juvenile justice system, and other areas. They can even pursue job opportunities in homeland security, forensics, criminology, legal work, and more. The Criminal Justice Studies associate degree program is designed to give graduates the opportunity to pursue these exciting positions at the local, state, and federal levels. Students will gain a strong understanding of the United States’ court systems, correctional organizations, law enforcement agencies, and both public and private security venues. A strong emphasis is placed on the ever-changing technology used in the field, and students will receive a balance of theory (from criminal psychology to homeland security) and practice that prepares them to work with the tools used in crime scene investigation, to investigate digital crime, and more. From paralegals to parole officers, these courses will help dedicated professionals pursue a number of career fields. While opportunities abound for criminal justice associate degree jobs, many career opportunities within the field have additional requirements such as academy training, background checks, and physical fitness standards. These mandates often vary on a state-by-state or city-by-city basis, so be sure to research the potential requirements in your region as you pursue an associate degree in Criminal Justice Studies.The Amherst campus offers courses in the Criminal Justice Studies associate degree. To learn more about this degree at the Amherst location, please contact an admissions representative.\nOutcomesStudents of the Criminal Justice Studies associate degree program will gain knowledge of:\nSkills-based applications designed to provide students with real-world skills in applications such as preparing investigative case notes, juvenile treatment plans, research services, and more.\nAdapt and apply information technology knowledge, skills, and abilities to justice applications. \nSafety and security issues such as threat awareness, safety procedures, and the basic equipment used to secure suspects or prisoners.\nIdentify and characterize the origins and components that comprise the justice system at the federal, state, and local level. \nJob functions and responsibilities of both public and private agencies serving the criminal justice sectors.\nCriminal Justice Academic Program Disclosures\n\n","AAS Human & Social Services":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nAre you a people person? Would you go out of your way to ensure relatives, friends and even total strangers get the help they need to make it through the day? Do you define your life by how you treat—and help—others? Then you may have a future in social work, mental health counseling, crisis intervention or some other human services field. You’re ready for an Associate of Applied Science in Human Services from Bryant & Stratton College.\nThe Human Services AAS You’ve Been Looking For\n\nGraduates of the human and social services associate degree program at Bryant & Stratton College will be prepared to begin a career in a number of different areas within the human and social services field. Students will develop the ability to address and treat the ever-changing needs of patients and clients. The associate degree program in Human and Social Services also places a strong emphasis on the ethical and legal procedures within the field to ensure that graduates have an understanding of vital industry regulations and procedures. Additional points of emphasis of the Human and Social Services associate degree program include subjects such as the diversity of influences that affect clients and ensuring that the proper ethical responsibilities are followed in providing treatment. Students take courses that explore human behavior and mental health, drawing on expertise required in psychology careers along with common practices in the counseling field. Some of the positions students will be prepared to fill are crisis intervention, case management, and social and human services assistant. OutcomesThe Human & Social Services associate degree program will provide students with the ability to:\nDevelop the necessary ethical and legal standards for human and social services settings.\nAdapt essential communication skills to interact effectively with supervisors, peers and the public in various human and social settings.\nAnalyze and apply contemporary knowledge and skill sets to perform diverse administrative responsibilities in human and social services.\nExplore various functions of crisis intervention, case management, and other areas of the human and social services field.\nDemonstrate an understanding of patient\/client\/customer service needs within human and social service environments. \nHuman and Social Services Academic Program Disclosures\n\n","AAS Paralegal Studies":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nWhy should you pursue an associate degree in Paralegal Studies with Bryant and Stratton College?That depends … are you looking for coursework that will help prepare you to work for attorneys at law? Need a program that will give you the insight in legal research, civil procedures, and criminal practice to be the legal assistant lawyers need to successfully practice law in and out of the courtroom? Want the skills to pursue entry-level career opportunities in the legal world?If you answered “yes” to any of those questions, then prepare to serve as a vital part of a legal team with an Associate of Applied Science (AAS) in Paralegal Studies from Bryant & Stratton College. Students of the Paralegal Studies associate degree program will develop the necessary skills to assist lawyers in case preparation, client interaction, and more.Whether you take courses on campus or online, this 60-credit associate paralegal program provides the career-building experience legal assistants need to work in law, from preparing legal documents and correspondence to conducting legal research. Plus, you’ll cover key aspects of the legal process. Not only will you graduate qualified to pursue career opportunities with law firms or government\/civil service employers, you’ll be qualified for paralegal positions with corporations, real estate companies, and other government agencies, which often require the skills of a trained paralegal.In addition, graduates are encouraged to pursue relevant certifications by taking the CLA\/CP exam after completing the associate degree in Paralegal Studies. Or, students may choose to use this as a stepping-stone to a bachelor’s degree. Felony and drug background checks may impact internship or employment opportunities.OutcomesThe Paralegal Studies associate degree program will provide students interested in pursuing career opportunities as a legal assistant for the courts or law offices with the ability to:\nCorrectly apply legal terminology in legal documents.\nDevelop and understand the basic responsibilities, legal and procedural theories, and limitations of a paralegal associate.\nDraft a variety of legal writings including correspondence, pleadings, instruments, and memoranda.\nDemonstrate an ability to read, analyze, and interpret legal documents, case law, and statutory law.\nApply information technology skills to general office and specific law office applications.\nResearch the law utilizing printed and online legal reference materials.\nParalegal Studies Academic Program Disclosures\n\n","BS Human and Social Services":"\n\nAvailable Formats\n\n\nCAMPUS\n\n\n\n\n\n\n\n\n\nONLINE\n\n\n\n\n\n\n\nAre you looking for an on-campus or online bachelor’s degree program that will prepare you for a profession serving your community and those in need? You’ve found it at Bryant & Stratton College. Our Human and Social Services degree program is designed for students who, like you, are interested in non-clinical roles in human service organizations, including case management, community outreach, and administration.Your bachelor’s degree program focuses on the planning, direction, and coordination of social service programs and helping communities maximize use of such services. As a student in this specialty services area, you’ll gain the knowledge and experience needed to administer these kinds of community-minded programs. You’ll learn what it takes to provide expert supervision of various human service roles as well as oversee budgets, policies, and program requirements, including implementation and evaluation. In addition, you’ll learn how to facilitate delivery of services to communities through social action. You’ll also gain the skills to improve accessibility and coordination between agencies. And you’ll learn how to provide outreach, including the linking of services with individuals in need.Courses for your undergraduate degree program, on campus or online, emphasize a broad-based awareness of social welfare systems, interpersonal and advocacy skills development, public and private agency leadership and administration, strategic planning, and program development, implementation, and assessment, in addition to a foundation in direct service delivery. Graduates of the human and social services degree program will be able to:\nDemonstrate an understanding of human conditions and factors which present societal challenges as well as those that promote successful human functioning.\nDemonstrate professional competencies related to the successful planning and implementation of human services, inclusive of values, attitudes, and ethics common to the field.\nAnalyze the impact and interaction of public policy issues with human services, including legal considerations and funding mechanisms related to non-profit, private, and public human service agencies.\nDemonstrate knowledge of the structure and dynamics of individuals, groups, families, organizations, communities, and society as they fit within the historical development of human service delivery.\n\n\n"}}