{"0":{"Psychology":"Students will demonstrate knowledge of and proficiency in the terminology, theories, concepts, practices and skills specific to your field of study. Identify major theories and terminology relevant to the study of psychology. Articulate foundational approaches to psychology, including major scholarship and the historical development of the field. Understand ethics and issues related to the practice of psychology. Demonstrate knowledge of the latest trends and specializations in psychology. Provide evidence of relating psychology to personal growth and lifelong learning. Students will exhibit competency in applying your knowledge to address real-life problems through both individual and group effort. Demonstrate professional skills appropriate to the degree program. Provide evidence of the ability to collaborate with others in achieving shared objectives. Exhibit communication skills, both in written and oral forms, appropriate for their professional field. Students will demonstrate your ability to integrate both traditional and non-traditional cognitive skills, including analytical inquiry, use of information resources, quantitative fluency and communicative fluency. Students will demonstrate intercultural competence in addressing civic, social, environmental and economic issues. This will include issues related to multicultural counseling, understanding diversity and developing cultural awareness in addressing human needs. Students will articulate a Christ-centered worldview and its personal, professional and communal embodiment through Christian virtues. In particular, you will demonstrate understanding of the integration of Christian worldview and psychology.","Music Worship Arts":"Demonstrate a broad knowledge of musical form, function and performance in a sacred context. Understand basic musicianship skills. Understand capability of form and analysis. Place music in historical, cultural and theological context. Demonstrate rudimentary capacity for composition and improvisation. Use technology within your area of specialization. Possess instrumental and\/or vocal competency and leadership skill to perform individually and lead others in a worship context. Demonstrate technical skills requisite for artistic expression. Understand worship repertory and ability to perform a cross section of it. Demonstrate ability to sight read with fluency. Demonstrate knowledge and skills sufficient to work as a leader. Demonstrate keyboard competency. Demonstrate collaborative competence through ensemble experience. Demonstrate your ability to integrate both traditional and non-traditional cognitive skills, including analytical inquiry, information literacy, quantitative fluency and communicative fluency. Demonstrate intercultural competence in addressing civic, social, environmental and economic issues. Articulate a Christ-centered worldview and its personal, professional and communal embodiment through Christian virtues."}}