{"0":{"Writing and Digital Studies":"Demonstrate a broad knowledge of digital communication technologies in contemporary media, business, arts, and culture Explain the continuities and changes between traditional and digital communication  Analyze contemporary culture through critical thinking and the creative use of media formats and technologies  Evaluate digital communication from an aesthetic, rhetorical, and Christian perspective  Write, edit, and proofread effective text for digital media  Produce work that displays compelling digital communication skills in written, oral, visual, and interactive forms.","Biology":"Demonstrate both a theoretical and practical mastery of general biology topics, aligning with the recommendation of Vision & Change (AAAS 2010). Apply and evaluate the effectiveness of laboratory and field techniques in addressing a research question or problem in a real-world scenario. Interpret, evaluate, and draw conclusions from data in order to make evidence-based arguments about the natural world. Integrate concepts across other STEM disciplines (e.g., chemistry, physics) and multiple fields of biology (e.g., cell biology, ecology).","Mathematics":"discuss the human context of development of mathematics and the relationship of mathematics to the broad human historical, philosophical, and cultural heritage (Development of Mathematics); integrate Christian faith with learning in the mathematical sciences, including approaching current ethical issues in mathematics from a biblical perspective (Integration of faith); recognize, identify, and use concepts and generalizations of mathematics, including algebra, calculus, discrete mathematics, geometry, and probability and statistics (descriptive and inferential) to solve problems and apply the concepts to real-world examples (Recognizing, identifying and using concepts); reason abstractly, construct logical arguments, and analyze arguments to determine their validity (Mathematical reasoning);  competently work with a variety of number systems and represent and interpret graphical information (Using systems and information).","Psychology":"demonstrate knowledge of significant facts, theories, and issues within the domain of psychology; demonstrate critical thinking skills and knowledge of significant facts, theories, and issues in considering the relationship between Christianity and psychology; display the critical thinking skills and research skills necessary to interpret and contribute to current psychological research; apply spiritual and ethical principles to promoting the welfare of others; and be prepared for employment or graduate studies in fields that are related to psychology.","Music":"By the end of every music major’s course of study, competence must be demonstrated in a knowledge and\/or realization of performance, musicianship, composition, improvisation, music history, repertory, music technology, conducting, orchestration, instrumental methods, and analytical techniques. The student will synthesize many of the concepts studied in these subject areas in preparation for the culminating event of a senior recital.","History and Public Policy":"articulate and discuss, in both written and oral form, the fundamental principles of the Western heritage, including the role of the Christian faith in the formation of these principles. articulate and discuss, in both written and oral form, the fundamental principles of the American heritage, including the role of the Christian faith in the formation of these principles. analyze and demonstrate whether and how the fundamental principles have changed, affected, or been affected over time; based on an acquired knowledge of how the fundamental principles have been challenged by events and new ideologies, students will create a philosophical framework which will guide policy development. formulate and apply policy solutions to contemporary issues, questions, and challenges."}}