{"0":{"English Language and Literature":"Solve problems by thinking creatively and critically. Read and interpret texts using critical theory and language arts. Use research resources. Write academic, professional, and\/or creative texts. Communicate orally and nonverbally. Negotiate personal values in relation to the values of others. Apply academic preparation to professional and cultural experiences beyond the classroom. Make informed academic and career choices based on self-determined goals.","Biology":"Apply knowledge of fundamental biological principles to the description and analysis of living systems. Evaluate function as it relates to structure throughout the spectrum of biological organization. Apply laboratory research skills and techniques to the investigation of biological questions. Evaluate scientific issues and findings using primary research literature. Communicate scientific findings in written and oral formats appropriate to the audience. Conduct oneself in a manner consistent with the professional and ethical standards of the discipline. Apply academic preparation to professional experiences outside the classroom.","Applied Mathematics":"Think critically, solve complex issues, and use data to develop a deeper insight to problems in business, architecture, the sciences, engineering, or information technology.","Psychology":"Think critically about major theories, concepts, empirical findings, and historical trends in psychology. Conducting research by choosing appropriate research designs and statistical analyses, interpreting and communicating research results, and applying ethical standards. Helping others by using psychological knowledge, counseling theory and skills, and ethical standards. Analyzing how sociocultural differences affect their personal and professional interactions. Planning and pursue their ongoing career and\/or professional development.","Theatre and Media Performance":"Apply the appropriate unique skills to a wide range of theatre and multi-media performance platforms. Communicate creatively and effectively both verbally and non-verbally. Interpret plays and media scripts through textual analysis and performance. Collaboratively problem-solve through all aspects of the production process. Apply practical skills in the pursuit of career opportunities in theatre and multi-media performance.","Fashion Merchandising":"Analyze, develop, construct, and execute effective marketing strategies for a specific fashion or retail operation. Demonstrate a thorough understanding of consumer behavior and choose appropriate professional techniques in the display and sales of fashion and retail goods. Identify and interpret style and retail trends as they relate to fashion and retail cycles as well as targeted consumer markets. Interpret, assess, and respond to economic and market factors that affect consumer fashion and retail demand. Select appropriate solutions utilizing a working knowledge of specific areas of domestic and international marketing, management, and law as they relate to the business operations of fashion and retail merchandising. Employ sophisticated personal communication and technology skills to enhance job effectiveness.","Film and Moving Image":"Create films and other moving image projects, using current crafts and emerging technologies and grounded in a strong sense of personal style. Write film and moving image proposals and screenplays. Think and write critically about film and moving image history, aesthetics, global perspectives and production techniques. Navigate the business of film and moving image production and distribution.","History":"Articulate the significance of various historical periods, persons, events, ideas, and themes in history with a special focus on United States history. Analyze historical events, texts, and artifacts using the concepts of context, historical causation, conflict, and change over time. Evaluate the significance of race, ethnicity, class, gender, sex, and religion, as factors in history and in its presentation to the public. Create research-based history products for the public as well as for traditional historians. Locate and evaluate examples of public history projects that faced issues of an ethical, practical, or interdisciplinary nature. Participate in the community of historical practice both within the Stevenson Public History Program and the larger community. Make informed academic and career choices based on self-determined goals."}}