{"0":{"Accounting":"C.T. Bauer College of Business  > Department of Accountancy and Taxation  > Accounting, B.B.A.Students seeking a BBA in Accounting are required to take 120 hours of coursework to graduate. In addition to the courses and electives required of all C. T. Bauer College business majors, students seeking their BBA in Accounting take courses such as Accounting Information Systems, Financial Statement Auditing, Federal Income Tax, Financial Reporting Frameworks, Intermediate Accounting (1 and 2), and Cost Accounting.  While a track or special program is not required to graduate with a BBA in Accounting, there are options offered to BBA-Accounting students to fulfill their business and accounting electives. These options include:Students in PPA must meet a minimum accounting major GPA and cumulative GPA. In addition, they are required to attend colloquiums, which are one-hour sessions that meet every Friday during the fall and spring and feature speakers (experts in their fields) from partner companies and firms. Speakers present “cutting edge” topics and represent firms that offer students paid internships that prepare them for a career in their chosen field.To learn more about PPA admission and requirements, e-mail ppa@uh.edu or link to http:\/\/www.bauer.uh.edu\/departments\/accy\/undergraduate\/ppa\/.1) fulfill elective requirements for the BBA degree,2) fulfill course requirements for the IA certificate, and 3) prepare for careers in internal auditing. The IA certificate is issued by the department and is recognized by the Global Institute of Internal Auditors. The IA certificate holds the designation of “Center of Excellence”, one of eleven in the world and six in the country. Students achieve the IA certificate by:1. completing (3) three required courses, that cannot be substituted, with a 3.0 cumulative GPA for the each courses,2. completing (1) one colloquium listed specifically for the certificate with a letter grade of “S” (satisfactory), and3. earning a minimum 2.5 cumulative and accounting major GPATo learn more about the Internal Audit certificate, visit the Professional Accounting Programs Office located in suite 304 of the University Classroom and Business Building, call 713-743-4696, or link to http:\/\/www.bauer.uh.edu\/departments\/accy\/undergraduate\/iap\/.comprehensive, energy-accounting education about the oil and gas industry. Students who complete the courses 1) fulfill elective requirements for the BBA degree and 2) fulfill requirements for the O&G certificate, and 3) prepare for accounting careers in the oil & gas industry Students achieve the O&G certificate by:1. completing (3) three required courses, that cannot be substituted, with a 3.0 cumulative GPA for the courses,2. completing (1) one colloquium listed specifically for the certificate with a letter grade of “S” (satisfactory), andhttp:\/\/www.bauer.uh.edu\/departments\/accy\/undergraduate\/oil-and-gas\/.IA and O&G students are also encouraged to continue their education by earning a Master of Science in Accountancy degree.Business majors must meet the business, nonbusiness, and elective requirements for a baccalaureate degree as well as the following for a Bachelor of Business Administration degree with a major in Accounting: Additional Elective Hours Required:* The 9 hours of General Electives are designated for 6 hours of any unused Component Area Option (090) courses and 3 hours of an unused Social\/Behavioral Science (040) course. Remaining hours can be met by any 1000-4000 level course.** Students interested in Accounting should reserve 9 hours of electives for the Internal Audit or Oil & Gas certificate tracks or PPA. Undergraduate business majors in the accelerated pathway B.B.A.\/M.S. degree program who complete graduate courses as an undergraduate may count them toward the requirements for the B.B.A. regardless of admission to a M.S. business program toward major or minor requirements for courses with the same letter rubrics as their major or minor, or toward elective requirements of their major.In order to earn a Bachelor of Business Administration (B.B.A.) degree, students must complete credit hour requirements:along with noncredit requirements:Students seeking the Bachelor of Business Administration degree must complete freshman-sophomore core and Business Administration and Management Field of Study requirements, upper-level business core and required courses, major requirements, and clear the business writing evaluation (BWE).The total hours required for a Bachelor of Business Administration degree are summarized below. Students in the Bauer Business Honors Program have additional requirements as specified under the description of the Bauer Business Honors Program.Students pursuing the Global Energy Management Professional Program (GEM-PP) track in Finance have specialized degree requirements listed under the GEM-PP track for a major in finance. Other specialty programs, such as the Professional Program in Accounting, the Entrepreneurship Program, and the Program for Excellence in Selling, may have additional admission and program requirements as specified by the program.B.B.A. requirements also listed as approved UH core courses may fulfill both requirements, but students must have a minimum of 120 credit hours to earn the B.B.A.Specific course requirements in each category are discussed in the following sections. ECON 2301 and ECON 2302 may count for Core Social and Behavioral Science requirement and Field of Study (students without either ECON 2301 or ECON 2302 and substituting Intermediate ECON would be required to take a Social and Behavioral Science course in place of a General Elective Requirement.6 Credit Hours24 Credit HoursCourses require completion with a grade of “C” or higher in all Business Administration and Management Field of Study courses unless a transfer student has completed the Business Administration and Management Field of Study at another Texas public institution. ^ Consult the catalog for additional requirements if pursuing the Global Energy Management Professional Program.24 Credit HoursComplete both:Complete both:21 Credit HoursThis section is required for all business majors. 4000-level requirement (requires a degree plan on file): Return to: Major and Minor Fields of Study Listed Alphabetically","African American Studies":"College of Liberal Arts & Social Sciences  > Department of African American Studies  > African American Studies, B.A.The African American Studies major requires a minimum of 30 semester hours of coursework in the major. Each student must complete 18 hours of required courses and 12 hours of Africana Studies Electives. Students must complete at least 18 of the 30 required hours for a major in African American Studies in residence at the University of Houston, and 12 of those hours must be advanced courses at the 3000 or 4000 level. Students must earn a minimum cumulative grade point average of 2.00 in all courses applied to the major.To obtain a Bachelor of Arts (B.A.) Degree in African American Studies, students must successfully complete the University of Houston Core Curriculum as well as those requirements established by the College of Liberal Arts and Social Sciences. The four-year academic map for the Bachelor of Arts (B.A.) Degree in African American Studies is listed below and details what is required to meet the 120 credit hour requirement for the University of Houston.Africana Studies Lower Level Electives - (Select one of the following courses - 3 hours): Africana Studies Upper Level Electives - (Select three of the following courses - 9 hours): Return to: Major and Minor Fields of Study Listed Alphabetically","American Sign Language Interpreting":"College of Liberal Arts & Social Sciences  > Department of Communication Sciences and Disorders  > American Sign Language Interpreting, B.A.The University of Houston American Sign Language Interpreting (ASLI) program is designed to prepare students to effectively interpret with 75% or more degree of accuracy between American Sign Language and English (spoken and written). Sign Language interpreters work in a vast array of settings such as: social service agencies, K-12 schools, colleges and universities, courtrooms, hospitals, television programs and video relay services (VRS telephone calls).To be successful students must possess the following requisite abilities:American Sign Language courses are taught by Deaf professors so that students experience both a cultural and linguistic immersion in the classroom setting. Throughout the 4-year program of study, students will interact with professional interpreters and members of the Deaf community. Interpreting courses are taught by professors who have expertise in training individuals to meet state and national certification standards. Successful graduates of the ASLI program are fluent in both English and American Sign Language, demonstrate an understanding of the profession and its ethical principles and will complete all University of Houston requirements for a Bachelor of Arts degree. The goal of the program is for graduates to be qualified to pass the entry-level Board of Evaluation of Interpreters certification exam.To obtain a bachelor’s degree in ASL Interpreting (ASLI) the following requirements must be completed in addition to university core requirements as well as the requirements of the College of Liberal Arts and Social Science for the Bachelor of Arts Degree:All current students that wish to switch to the ASLI major are required to meet with the undergraduate advisor. Students must choose the designation of an ASLI pre-major (PREASL).Students whose last ASL class was completed 12 months or more prior to the start of the semester must be evaluated for placement in the appropriate ASL level or to continue in the ASLI Program.Courses in the major that are seven or more years old may not count toward a degree, whether taken at the University of Houston or transferred to the University of Houston, unless successfully petitioned.A minimum of twelve hours of advanced ASLI courses must be taken in residence at the University of Houston.To file a degree plan:All students should see their ASLI advisor for assistance in determining their full program of study which includes university and college core course requirements. ASLI and COMD courses are typically offered once a year and must be taken in sequence to accommodate prerequisites. Return to: Major and Minor Fields of Study Listed Alphabetically","Anthropology":"College of Liberal Arts & Social Sciences  > Department of Comparative Cultural Studies  > Anthropology, B.S.The Anthropology Program in the Comparative Cultural Studies Department focus on archaeology and ethnology as specialized areas of study. A diverse curriculum provides courses in the major subfields of ethnology, archaeology, linguistics, and physical anthropology as well as in the study of important world regions, such as the United States, North America, Latin America, and Africa.Specialized courses are offered in medical anthropology, applied anthropology, historic archaeology, nutrition, sexuality, economic development, ethnic studies in the United States, and cultural reconstruction from symbolic behavior.Topics are cast in a comparative, often global purview, and students view human problems such as hunger, religious conflict, sexism, racism, and inequality from the anthropological perspective.The programs are designed to develop students concern and knowledge about current world problems and to provide them with skills and experience needed to enter professional careers in applied social sciences or to continue advanced training in the anthropological subdisciplines, law, public health, or other professional fields.The Anthropology Program recommends the following courses for meeting the various components for the University Core Curriculum, and the college and program requirements. Please note that this information is not intended to preclude completion of other courses that may be offered on an irregular basis, such as selected topics courses, nor does it imply that completion of these courses alone will satisfy the Bachelor of Arts or the Bachelor of Science degree requirements for graduation.Minor preferably in Political Science to include courses from the Social Sciences lists. Nine hours of Social Sciences in addition to the six-hour core requirement: (Reminder: These 15 hours must be selected from three fields outside the major.)Address inquiries about pre-law counseling and training to:orStudents must earn a minimum 2.00 grade point average in all courses in the major (required or elective) attempted at this university.Students who choose to major in anthropology must also meet the university core requirements and the college core requirements for a Liberal Arts and Social Sciences Bachelor of Arts or Bachelor of Science degree.30 hours (at least 18 advanced) to include: 6 hours from: Students must complete at least 15 of the required 30 hours in residence at the University of Houston. Twelve of these 15 hours must be advanced (3000-level or above). Transferred credit to be counted toward the anthropology major requirements must have a grade of C- or above. Majors who plan to pursue graduate study should consider taking one statistics course from the program’s recommended list.For additional information, write, call, or visit the program Web site:713-743-3783 or 713-743-3947www.anthropology.uh.edu Return to: Major and Minor Fields of Study Listed Alphabetically","Architecture":"Colleges  > Gerald D. Hines College of Architecture and Design  > Architecture, B.A. ArchThe program for the Bachelor of Architecture degree (first professional degree) is a five-year curriculum of at least 160 credit hours. The focus of the curriculum is preparation for professional practice in architecture and emphasizes sustainability, critical thinking, research and technology. The curriculum is divided into four segments: Foundation; Intermediate; Comprehensive Design; and Professional.The curriculum includes at least 100 semester credit hours of architecture courses, 61 of which are advanced (3000 level or higher), the university required core courses, 1 approved general elective, and 15 semester credit hours of general elective courses.The Bachelor of Architecture requires a successful review of work after the 3rd semester and the 6th semester for advancement in the degree.The Bachelor of Science in Environmental Design requires a successful review of work after the 3rd semester for advancement in the degree.The Bachelor of Science in Industrial Design requires a successful review of work after the 4th semester for advancement in the degree.http:\/\/www.uh.edu\/architecture\/programs\/undergraduate-programs\/architecture\/Meg Jackson, Instructional Assistant Professor & Foundation Level Coordinatormhjackson@uh.edu Return to: Major and Minor Fields of Study Listed Alphabetically","Art History":"Kathrine G. McGovern College of the Arts  > School of Art  > Art History, B.A.The Art History program at the University of Houston provides undergraduate students with a firm grounding in the discipline of art history within a Tier-1 research university, alongside close contact with the collections of major arts institutions. Our program is profoundly engaged in the city of Houston, a dynamic urban cultural center and gateway to the international art world. With generous electives options, students can craft an educational experience suited to their individual needs and interests and take advantage of internship opportunities in tandem with art history studies.Thirty-six semester hours in art history, of which 18 hours must be advanced (3000- or 4000-level), as listed below. In addition to seeking academic advising from the undergraduate advisor in the School of Art, art history majors are encouraged to meet with a faculty member to find out about internship and research opportunities. Major course requirements are:To provide balance in their course of study, students must take a minimum of one course from each of the following four categories. For these twelve hours, students should check in the School of Art Office for the current list of courses, including topics courses, which address these specific categories.For the remaining 15 hours of art history electives, students need to be aware of the following:Students may apply only three hours of Critical Studies courses which are identified as  Students who are considering graduate school are strongly encouraged to take ARTH 4385 to fulfill three hours in this category.Nine hours of humanities and social science courses, which may include History at the 2000-level or above (that is not used to meet the American History core requirement), Anthropology, or other courses within the College of Liberal Arts and Social Sciences that support the student’s field of art historical interest. A list of specific options is available, and additional options may be petitioned through the undergraduate advisor. Return to: Major and Minor Fields of Study Listed Alphabetically","Art":"Kathrine G. McGovern College of the Arts  > School of Art  > Art, B.F.A.Students seeking the Bachelor of Fine Arts degree must fulfill the 42-hour university core curriculum, complete 3 hours of electives and complete 81 credit hours in studio art and art history courses as follows:Twenty-one credit hours in approved related arts courses for the major in Graphic Design.Students should refer to the recommended courses of study for each of the four specific B.F.A. majors.Eighteen credit hours total, including twelve credit hours of fundamental studio courses (four 1000-level or 2000-level studio courses) and Art History I and II (ARTS 1303  and ARTS 1304 ) constitute the lower level, foundational courses for B.F.A. majors.A basic prerequisite for any related arts studio course is completion of 12 credit hours of fundamental studio courses. A minimum of 30 credit hours in related arts courses is required for the Bachelor of Fine Arts degree in Painting, Photography\/Digital Media and Sculpture. A minimum of 27 credit hours in related arts courses is required for the Bachelor of Fine Arts degree in Graphic Design.The term “related arts” is meant to include all intermediate-level courses offered by the school. Students must have completed the fundamental course in a discipline before they take an intermediate level course in that discipline or have specific consent of the instructor. Related arts courses can include any art history course at the 2000 or higher level, any course approved by a major program’s faculty that is offered by another department, and any 3000-4000-level art or design studio course.Exception: Students wishing to begin work in B.F.A. major courses who have not previously taken the fundamental course in the major, should take the corresponding 1000-level or 2000-level course, which can be petitioned for related arts credit.Normally, students are expected to complete a minimum of 12-15 credit hours of related arts courses, including at least one 3000-level premajor studio course in the same discipline as the intended major, before applying for admission to the major.Admittance to a major is not guaranteed. This process involves a competitive portfolio review of a student’s work and a vote by the faculty of the major. Students are allowed to participate in the competitive portfolio review no more than two times.Prerequisites for a major vary among the B.F.A. majors. All majors require participation in the competitive portfolio review and formal individual approval by the major faculty.On completion of junior courses in the major, a review of the student’s progress by the major faculty is mandatory. No student is allowed to continue in the major until formal approval has been granted by the major faculty. Students must have an approved degree plan on file in the Art Office before they begin their senior major program. Any substitutes for junior or senior major courses must be approved by the faculty of the major area.At a minimum, transfer students to the Painting, Photography\/Digital Media or Sculpture majors must take one three-credit premajor studio course and the final 27 credit hours in the major. Transfer students to the Graphic Design major must take one three-credit premajor studio course and the final 36 credit hours in the major. Students may not apply any major courses completed more than seven years prior to the graduation semester in fulfillment of degree requirements.     Return to: Major and Minor Fields of Study Listed Alphabetically","Atmospheric Science":"The objective of the BS degree program in Atmospheric Science at the University of Houston is to prepare students for advanced careers with meteorological or environmental services, in research, in management organizations within the state or federal government, and in private industry.The general requirements, including university core curriculum and college requirements, shall apply. In addition to the general requirements, students pursuing the Bachelor of Science in Atmospheric Science must complete the following:Students must complete 18 hours, selected from the following:Selected Topic: Remote Sensing for Atmospheric ScienceStudents must complete an additional 12 hours of approved electives.  See advisor for list. A student who obtains a BS in Atmospheric Science cannot obtain a minor in Atmospheric Science.Geosciences courses are commonly offered on a one- or two-year cycle. Therefore, it is the student’s responsibility to become familiar with course scheduling and the prerequisites for courses and to consult with the undergraduate advisor regularly.The Bachelor of Science degree requires completion of a minimum of 120 hours, at least 36 of which are to be advanced hours. Students must earn a minimum 2.0 cumulative GPA in all courses attempted at the university. In addition, students must earn a minimum 2.00 cumulative GPA in all courses in the major attempted at the university. Students must have no more than 6 semester hours with grades below C- in all courses attempted in the major, which includes all the GEOL courses and Group 1 and Group 2 Electives. Any student exceeding that limit must retake sufficient courses and obtain acceptable grades.All students in NSM must complete the Capstone requirement. Students may satisfy the Capstone in a number of ways, e.g. by completing an approved minor, a double major, a senior research project, a senior honors thesis, or 6 hours of NSM-designated interdisciplinary capstone courses (e.g. GEOL 3355-GEOL 3360).No GEOL course with a grade below C- can be used as a prerequisite for a more advanced GEOL course.Students with more than 6 hours in GEOL courses with grades below C- are not allowed to enroll in subsequent GEOL courses without written permission from the undergraduate advisor.Note that all undergraduate majors should meet with the Faculty Advisor prior to registration each term. Return to: Major and Minor Fields of Study Listed Alphabetically","Biochemical and Biophysical Sciences":"College of Natural Sciences and Mathematics  > Department of Biology and Biochemistry  > Biochemical and Biophysical Sciences, B.S.Students who major in biochemical and biophysical sciences must meet the general requirements in addition to the special requirements for a Bachelor of Arts or Bachelor of Science Degree.Students who major in biochemical and biophysical sciences may not double major, double degree, or minor in biology. orCompletion of either CHEM 4370  or CHEM 4373  and the additional requirements in chemistry above may complete a minor in chemistry to meet the NSM Capstone requirements.Twenty-nine semester hours which must includeStudents can also fulfill this requirement by taking one of the approved BIOL courses from the list below to serve as part of the advanced BCHS credit requirement. Students must petition for departmental approval in order to apply for more than one BIOL course from the list to fulfill this requirement.Senior Honors Thesis and Special Problems courses ordinarily will not apply toward this total. Return to: Major and Minor Fields of Study Listed Alphabetically","Biology":"College of Natural Sciences and Mathematics  > Department of Biology and Biochemistry  > Biology, B.S.Students who major in biology must meet the general degree requirements in addition to the special requirements for a Bachelor of Arts or Bachelor of Science degree.Students who major in biology may not double major, double degree, or minor in biochemical and biophysical sciences. or38 hours (at least 27 advanced) which must include:BIOL 3311  must be completed before enrollment in the second laboratory.One three-hour BCHS course may be used as a biology elective for the biology degree in addition to the required BCHS 3304 . Taking these courses does not preclude the use of BCHS 3201  as a choice for the required advanced laboratory for the biology degree. Return to: Major and Minor Fields of Study Listed Alphabetically","Biomedical Engineering":"Cullen College of Engineering  > Department of Biomedical Engineering  > Biomedical Engineering, B.S.B.E.Biomedical engineering majors are required to follow all requirements and regulations outlined in the Engineering General Degree Information  section of the Undergraduate Catalog.The major grade point average is calculated using all BIOE courses as well as ENGI 1331 , ECE 2201 , and MECE 3400 . \n Return to: Major and Minor Fields of Study Listed Alphabetically","Biotechnology":"Engineering - Technology Division  > Department of Engineering Technology  > Biotechnology, B.S.The Bachelor of Science Program in Biotechnology intends to provide students with strong core science concepts and an application-oriented undergraduate education. Strongly interdisciplinary, this innovative program strives to help students develop critical-thinking skills and increased interest and persistence in STEM-related courses. The program’s main objective is to prepare students for employment opportunities in the critically important and dynamic biotechnology industry. In addition, the curriculum will provide students with knowledge and core set of skills that span across basic sciences, technology, engineering, and mathematics (STEM) education. This is the first program in the state of Texas that integrates medical, plant, microbial, and environmental biotechnologies into the undergraduate curriculum.The program recognizes the need for cross-disciplinary training and fosters collaborative interactions that will strengthen undergraduate education.The program is specifically designed to:Two curriculum tracks: 1) Bioprocessing, and 2) Bioinformatics give students the flexibility to tailor their degree based on their interest, educational background and career goals. These tracks, in combination with core courses, will provide our students with a broad exposure to the field of biotechnology. The presence of the Texas Medical Center in the greater Houston area and an accelerating growth in biotechnology and pharmaceutical industries, places this program at the forefront of Biotechnology Education.Students pursuing the Biotechnology major must complete the following requirements in addition to the university core and general college requirements.   Majors in Biotechnology may use no grade below C- on courses to satisfy major degree requirements.Major GPA will be calculated on the major requirements including Biomanufacturing or Bioinformatics track. Return to: Major and Minor Fields of Study Listed Alphabetically","Chemical Engineering":"Cullen College of Engineering  > William A. Brookshire Department of Chemical and Biomolecular Engineering  > Chemical Engineering, B.S.Ch.E.Transfer credit for chemical engineering courses may be accepted only from chemical engineering programs which are accredited by the Accreditation Board for Engineering and Technology (ABET).Once a student has attempted their first 6 hours in the major (all engineering XXXX 1331 courses, CHEE 2331  or CHEE 2332 ), they are required to maintain a (cumulative) GPA of 2.25 or higher to continue in the major. The major GPA of 2.25 must be maintained at all times until the last semester before graduation.Completion of all the chemistry courses at the University of Houston in this degree plan qualifies for a minor in chemistry. An official minor degree plan must be filed in the major department in the spring semester of the junior year. Prerequisites and\/or corequisites must be met.The Chemical Engineering Major GPA is calculated using all CHEE courses, plus all Engineering Computing XXXX 1331 courses. Return to: Major and Minor Fields of Study Listed Alphabetically","Chemistry":"College of Natural Sciences and Mathematics  > Department of Chemistry  > Chemistry, B.S.The Bachelor of Science degree program is rigorous; its certification by the American Chemical Society enhances the stature and usefulness of this degree. Students planning to continue into graduate work are encouraged to take the program.The Bachelor of Science and Bachelor of Arts degree programs are described below. Detailed curricula are available from the department chair.Students who choose to major in chemistry must meet the following requirements in addition to the special requirements for a Bachelor of Science degree:49 credit hours of Chemistry courses of which at least 33 hours must be at the advanced (3000 or 4000) level.At least 12 credit hours must be hands-on laboratory experiences, that include a minimum of 400 contact hours in physical (i.e., not virtual or computer-based) laboratories.Note:1 The Lab Departmental Assessment involves a review of the student’s Advanced Placement Lab Book.2 Completion of CHEM 1321 , CHEM 1322 , and CHEM 1112H (all honors) with a grade of at least C- in each course.For additional information regarding Credit by Examination, please go to the University of Houston’s University Testing Services (UTS) website. Return to: Major and Minor Fields of Study Listed Alphabetically","Chinese Studies":"College of Liberal Arts & Social Sciences  > Department of Modern and Classical Languages  > Chinese Studies, B.A.In addition to completing the degree requirements for the Bachelor of Arts, students majoring in Chinese Studies must complete a minimum of 30 semester hours in areas listed as follows:Students who have not taken their first three semesters of Chinese at the University of Houston (including those with two or more years of high school Chinese) must take a placement examination and see a department advisor before enrolling in Chinese courses. Credit may be awarded by examination for courses at the 2000 and 3000-level.Chinese studies majors must earn at least a 2.00 grade point average in all Chinese courses counting toward the major and attempted at the University of Houston. A minimum of 12 semester hours of advanced Chinese courses must be taken in residence. Some of the above requirements may be satisfied by courses from the department’s program in Beijing. Students majoring in Chinese Studies are encouraged to seek advice concerning their degree objectives from the department’s undergraduate advisor. Return to: Major and Minor Fields of Study Listed Alphabetically","Civil Engineering":"Cullen College of Engineering  > Department of Civil and Environmental Engineering  > Civil Engineering, B.S.C.E.Civil Engineering majors are required to follow all requirements and regulations outlined in the Academic Information - Cullen College of Engineering  section of the Undergraduate Catalog.When seeking transfer credit for engineering courses, students are expected to include detailed syllabi, as well as graded assignments and exams, with their petitions requesting course credit.The major grade point average for civil engineering majors is calculated using all attempts in the following courses taken in residence at the University of Houston: all CIVE courses, ENGI 1331 -  Computing and Problem Solving for Engineers , ENGR 2301 -  Mechanics I (Statics) , MECE 2336 -  Mechanics I , and  MECE 3336 -  Mechanics II (Dynamics) .Web: http:\/\/www.cive.uh.edu\/programs\/undergraduate. Return to: Major and Minor Fields of Study Listed Alphabetically","Classical Studies":"In addition to fulfilling the college’s requirements for the Bachelor of Arts degree, students majoring in classical studies must complete 33 semester hours as follows:At the 2000-level and above, or equivalent placement by examination.These courses may also be applied to meet general requirements for the Bachelor of Arts degree (for example, the foreign language requirement).Because there is no uniform program of study for a degree in classical studies, majors should consult a classical studies advisor before enrolling in classes each semester. In general, however, students should begin the formal study of the ancient language (i.e., Greek or Latin) they choose for their major while they are still freshmen or as soon as possible after becoming a major. Many students will want to learn both Latin and Greek, but normally they should not begin both languages simultaneously at the elementary level. Taking the intermediate courses of one and the elementary courses of the other, however, usually presents no difficulty.Selection of electives should follow the general criteria for students seeking the Bachelor of Arts degree. In selecting the classical studies electives, students will be guided by the faculty so that the courses they choose provide a general background in classical antiquities as well as a core of basic knowledge related to the individual student’s particular interest (ancient Greece, the Roman world, New Testament studies, medieval studies, comparative literature, ancient philosophy, etc.). Electives not listed may be taken and are subject to the approval of the program advisor.Nine semester hours from the following courses (if not used to meet other requirements). Students may choose other courses, not listed here, with approval of the program director.GREK 3000 and above; LATN 3000 and above, if beyond the 18 semester hours required by the CLA STD degree in one of the two ancient languages.Majors in Classical Studies may choose either Latin or Greek to fulfill their language requirement. We recommend that students who are planning to do graduate studies, especially in Classics or in History, take at least three years of one of the classical languages and two years of the other. It is advisable to begin one language in the first year of the major, and wait to begin the study of the other language the following year.The elementary year of foreign languages, including Latin or Greek, does not count toward the total number of hours in the degree. Thus GREK 1301  – GREK 1302 \/LATI 1301  – LATI 1302  count as general elective hours. Students may place out of the elementary year by examination. At the intermediate level and above, students may earn credit by taking the Placement Exam. These exams are administered by Classical Studies, not by Testing and Counseling.Credit in Modern Greek courses (GREK 1305 , GREK 1306 , GREK 2305 , GREK 2306 ) will not count as credits in one of the ancient languages, but may count as an elective Return to: Major and Minor Fields of Study Listed Alphabetically","Communication Sciences and Disorders":"College of Liberal Arts & Social Sciences  > Department of Communication Sciences and Disorders  > Communication Sciences and Disorders, B.S.The Department of Communication Sciences and Disorders offers a Bachelor of Arts degree and a Bachelor of Science degree in communication sciences and disorders (speech-language pathology and audiology). A baccalaureate degree or equivalent semester hours of approved courses in communication sciences and disorders must be completed in order to enter a master’s degree program. The master’s degree is required for professional certification and membership in the American Speech-Language-Hearing Association. The department offers a Master of Arts degree in communication sciences and disorders for speech-language pathology only. For more information about admissions to the graduate program, consult with the Program Coordinator (713-743-3272).In addition to successful completion of the University Core Requirements and CLASS college requirements, students in COMD must:Additional courses outside the major are also required as listed below:CLAS 4305 Fifth-Century Athens: Readings in Intellectual, Literary, and Political History  COMM 1302 Introduction To Communication Theory  ENGL 2330 Writing in the Discipline of English  HIST 2328 Chicano History since 1910  HIST 3369 Colonial Mexico  HDCS 1300 Human Ecosystems & Tech Change  HDFS 1300 Development of Contemporary Families  LAST 3300 Latin American Studies: Interdisciplinary Perspectives  MUSI 3303 Pop Music of Americas Sn 1840  PHIL 1334 Minds and Machines  HON 2341 Classics of Modernity  POLS 3310 Introduction to Political Theory  PSYC 4344 Cultural Psychology  PSYC 3310 Industrial-Organizational Psychology  PSYC 2320 Abnormal Psychology  RELS 2340 Introduction to Hinduism  RELS 2350 Introduction to Islam  RELS 2360Introduction to Buddhism  RELS 3370 The Bible and Modern Science  SOC 3351 Soc Class&Mobilty in Am  WCL 4351 Frames of Modernity I  WCL 4352 Frames of Modernity II - Postmodernity and Globalization  ITAL 4308 Dante and His World  It is recommended that students select a 3000 or 4000 level writing intensive course.All of these requirements can be met through University Core Courses.A college level Statistics course;A college level Biological Sciences course;A college level Physics or Chemistry course.Completion of  COMD 1333 -  Introduction to Communication Sciences and Disorders  or its equivalentCompletion of COMD Core Courses with grades of C or better: COMD 2339 -  Language Development   COMD 2338 -  Phonetics   COMD 2376 -  Anatomy for Communication  Completion of a speech, language and hearing screeningEarned a minimum GPA of 2.00Why is there a COMD Core?The COMD Core courses (COMD 2339 ,  COMD 2338  and  COMD 2376 ) are foundational courses for our major. They (or their approved equivalents) are required for all Pre-COMD Students in order to ensure that each student has a solid basis on which to build knowledge in later classes. These courses must be completed with a grade of C or higher and may not be repeated.COMD Core SequenceA student must earn a grade of C or better in the COMD Core sequence to remain eligible for the major.A student must earn a grade of C or better in the follow major courses: COMD Junior Sequence: COMD Capstone:If a student earns a grade below C in one of these courses, a single repetition of that course is allowed. A student who earns a second grade below C in any of these courses will not be permitted to continue as a COMD major. Students should see the academic advisor for guidance in selecting another major and\/or consideration of COMD minor completion.This course introduces students to the clinical process and has a strong hands-on component. There is no substitute for this course. The following eligibility requirements are strictly enforced.Only COMD majors with senior status may enroll in Clinical Procedures.Students must have a COMD major degree plan filed and approved prior to enrollment.Filing a major degree plan is a lengthy process and is dependent upon completion of multiple previous steps.Students are strongly advised to submit a COMD major degree plan for approval in the summer before their fifth semester in COMD.Students must have a GPA of 2.00 in the COMD major. This includes grades for all COMD courses taken. If a course has been repeated, both grades enter into the calculation.Students must have completed 18 hours of COMD Major classes prior to enrolling in COMD 4489.Neither the department nor the instructor will be responsible for tuition refunds.Courses that are seven or more years old may not be counted toward the degree, whether taken at the University of Houston OR transferred to the University of Houston. The communication disorders academic program is accredited by the Council on Academic Accreditation in Audiology and Speech-Language Pathology (CAA) Return to: Major and Minor Fields of Study Listed Alphabetically","Communication Studies":"College of Liberal Arts & Social Sciences  > Jack J. Valenti School of Communication  > Communication Studies, B.A.Students in this degree program will choose from two concentrations: Film & Media Studies and Interpersonal Communication.In the Film & Media studies concentration, students will deal critically with media issues that create and affect public policy and will explore media management policy. Course materials will also cover content, technology, training, programming, marketing, and audiences in national and international contexts.Additionally, students will have an opportunity to study film and its impact on media and society.Students completing this concentration will gain background and understanding of communication that could lead to management, consulting or further study.In the Interpersonal Communication concentration, students will gain knowledge of the interplay between communication and relationships on both micro and societal levels. At the micro level, students will develop analytic and communication skills needed to understand the process of relationship development, maintenance and deterioration. At the societal level, students will acquire critical reasoning skills needed to interpret images and messages about families and other small groups.Students will be prepared for entry-level communication positions in organizations such as those allied with health care and human development or for advanced work in communication studies and other fields focusing on the analysis of human behavior.Students in good academic standing may declare a degree program in the Jack J. Valenti School of Communication at any time. Students interested in the school but uncertain about a degree program may declare themselves Communication Unspecified (COMM-UN) up to completion of 30 hours. Then they must choose a degree program.To declare a major in the Jack J. Valenti School of Communication a student must have a cumulative GPA of at least 2.25 or higher on minimum of 12 semester hours at UH.A transfer student or UH non-communication student with 15-60 semester hours of college credit who wants to declare a degree program in the Jack J. Valenti School of Communication must have a 2.25 or higher cumulative grade point average, including any attempted transfer courses.Applicants who have completed more than 60 semester hours of college credit need a 2.25 or higher cumulative grade point average on the last 60 hours.Transfer students who have earned fewer than 15 semester hours of college credit must meet freshman admission requirements.To graduate with a Bachelor of Arts in any Valenti School degree program:   Students will choose one of the following concentrations for the additional 27 hours required for the degree: Return to: Major and Minor Fields of Study Listed Alphabetically","Computer Engineering and Analytics":"Cullen College of Engineering  > Department of Electrical and Computer Engineering  > Computer Engineering and Analytics, B.S.C.E.A.The program will prepare students to enter the modern workplace in which knowledge of computer engineering, controls, automation, and robotics, and data analytics, and their combined application to diverse industry sectors is a widespread need as recognized by a large number of organizations and companies.This program is offered in face-to-face format at University of Houston at Katy.See “Requirements for current UH Students Seeking a Major Change to Engineering” section at the link below.See “Major Changes for Current Students” section at the link below.The first two years of the CEA program provide fundamental skills and knowledge in math, science, and electrical engineering. The second two years provide a carefully chosen blend of topics from computer engineering, control systems and robotics, and data analytics, which build upon the core engineering foundation.The Computer Engineering and Analytics Major GPA is calculated using all CEA courses as well as all Engineering Computing XXXX 1331 courses.  In addition, the major grade point average will include all ECE courses that are applied to the Bachelor of Science in Computer Engineering and Analytics degree. Return to: Major and Minor Fields of Study Listed Alphabetically","Computer Engineering Technology":"Engineering - Technology Division  > Department of Engineering Technology  > Computer Engineering Technology, B.S.The goal of the Computer Engineering Technology program is to provide students with a high-quality applications-oriented undergraduate education based on state-of-the-art technology as a preparation for productive employment in the broad field of computer applications. This goal is achieved through four objectivesComputers are used to control processes in manufacturing, chemical production, and oil & gas industry and energy systems. They are used to route data and conversations in telephone and wireless communication; provide the best shipping, billing, routing, and inventory information for transportation industry; and online marketplace. Computers and appropriate software packages are also used to solve scientific and engineering problems, to aid in medical tests and diagnoses, and to help design structures and buildings.With computers assisting nearly every professional and leisure activity of modern life, people who can design, develop, implement, install, configure, network, operate, and maintain computer systems can make a valuable contribution to business and industry. People familiar with both the hardware and software requirements of computers are especially valuable.Computer Engineering Technology majors study the application of state-of-the-art hardware and software in contemporary computer systems. Students are given a solid foundation in mathematics, basic sciences, and electronics. A thorough study is made of digital circuits and embedded systems, and computer circuits and systems. Hardware and software aspects of computers are covered in detail. Graduates of Computer Engineering Technology are qualified for immediate employment in a variety of industries as sales representatives, field specialists, interface designers, software specialists, and digital applications specialists.Students pursuing the Computer Engineering Technology major must complete the following requirements, in addition to university core and general college requirements.     Majors in Computer Engineering Technology may use no grade below C- ELET courses to satisfy major degree requirements.Select 12 semester hours from the following:Major GPA calculated on the major requirements and approved electives. Return to: Major and Minor Fields of Study Listed Alphabetically","Computer Engineering":"Cullen College of Engineering  > Department of Electrical and Computer Engineering  > Computer Engineering, B.S.Cp.E.In the ECE Department, taking courses in either degree plan is organized into two phases. The first two years are the ECE Base. The ECE Base provides fundamental skills in math, science, and electrical engineering, and is identical for BSEE and BSCpE majors.In the last two years of the BSCpE degree plan, students specialize in Computer Engineering, including a mix of Electrical Engineering and Computer Science courses.All students in the BSCpE program are assigned a Faculty Advisor in the Computer Engineering area and must meet with that advisor before taking courses in the last two years of the degree plan.The Computer Engineering Major GPA is calculated using all ECE courses as well as all Engineering Computing XXXX 1331 courses. In addition, for computer engineering majors, the major grade point average will also include all COSC courses that could be applied to the Bachelor of Science in Computer Engineering degree. Return to: Major and Minor Fields of Study Listed Alphabetically","Computer Information Systems":"Engineering - Technology Division  > Department of Information and Science Technology  > Computer Information Systems, B.S.The Computer Information Systems program provides for the needs of a dynamic and integral part of business and industry–the information systems environment. The Computer Information Systems program consists of 121 hours of undergraduate academic credit. In addition to meeting 42 semester hour university core curriculum requirement, students must meet their major core requirements, CIS Environment, Technology and approved technical electives. Students will obtain a background in business applications, computer concepts, problem-solving, decision making, human relations, evaluation, analysis, and communications. Information systems technologists can be found in a broad spectrum of careers in the private and public sectors including the areas of end-user support, system analysis, telecommunications specialist, applications development, technology project management, database administration, training, and consulting.Since Spring 2020, students majoring in Computer Information Systems (CIS) will be required to have a suitable laptop which is in good working order with the latest software and antivirus updates for their entire period of undergraduate study.Classroom instruction, course assignments and research in and out of class will require the use of a personal computer. Some CIS instructors will also require that students bring their personal laptops to every class or lab. The minimum and recommended specifications for CIS students laptops are defined under “Laptop Policy ” on the Computer Information Systems website: https:\/\/dot.egr.uh.edu\/programs\/undergraduate\/computer-information-systems\/laptop-policy.Students wishing to change their major to Computer Information Systems must have a 2.75 grade point average for all college level work attempted.All majors and minors in the Department of Information and Science Technology must earn a grade of C or better in all major\/minor courses. No grade lower than C will be accepted on any courses applicable to the major transferred to the University of Houston.Students planning to complete the minor in Business Administration must meet College of Business minor requirements. MANA 3335 , SCM 3301  (requires MATH 1324 ), ACCT 2301  & ACCT 2302  may be applied to the degree and the minor in Business Administration.   Students must earn a grade of C or better in all major courses. One (1) grade of C- may be accepted towards major.Major GPA is calculated on the major requirements and electives. Return to: Major and Minor Fields of Study Listed Alphabetically","Computer Science":"College of Natural Sciences and Mathematics  > Department of Computer Science  > Computer Science, B.S.Computer science is the systematic study of computing systems and computation. Numerous professional opportunities exist for graduates with computer science degrees including jobs in industries related to software engineering, internet systems and technology, game design, computer graphics, animation, robotics, artificial intelligence, security, data analytics, medicine, biotechnology, business management and consulting, modeling, as well as graduate study in computing-related fields.The computer science program at the University of Houston is rigorous. There is a strong correlation between logical thinking and computer science. Students considering a major in computer science should thus have shown considerable ability in logical reasoning and mastered the fundamentals of applied mathematics. Students majoring in computer science also receive extensive instruction in state-of-the-art computing architectures, operating systems, compilers, software engineering methods and practices. Therefore, they combine good mathematical background with the ability to design and develop quality software on a large scale.The department’s teaching and research fields of specialization include biomedical image analysis, computer networks, computer vision, computer graphics, databases, high-performance computing, internet computing, operating systems, parallel and distributed computing, physics-based modeling and simulation, real-time systems, software engineering, scientific computing, security, and theory.Several faculty members have interdisciplinary interests in chemistry and the biological\/medical sciences.Students who choose to major in computer science must meet the following requirements in addition to the special requirements for the Bachelor of Science degree:14.0 credit hours Complete 3.0 credit hours from the following:48.0 credit hours (advanced hours = 30.0) Complete 3.0 credit hours from the following: Software Engineering Elective:  Return to: Major and Minor Fields of Study Listed Alphabetically","Construction Engineering":"Cullen College of Engineering  > Department of Civil and Environmental Engineering  > Construction Engineering, B.S.Con.E.The BS in Construction Engineering program combines civil engineering and business principles to produce graduates who can design and manage the construction processes that create and rehabilitate the public infrastructure. This includes design and construction of commercial buildings, airports, dams, roads, utilities, bridges, residential communities, and schools. The curriculum includes the math, science, and engineering courses required for engineering licensure, as well as the practical business and management concepts construction professionals need.Construction Engineering majors are required to follow all requirements and regulations outlined in the Academic Information - Cullen College of Engineering  section of the Undergraduate Catalog.When seeking transfer credit for engineering courses, students are expected to include detailed syllabi, as well as graded assignments and exams, with their petitions requesting course credit.The Construction Engineering Major GPA is calculated using all attempts of the following courses taken in residence at the University of Houston: all CNE courses, all CIVE courses, ENGI 1331 -  Computing and Problem Solving for Engineers , ENGR 2301 -  Mechanics I (Statics) , and MECE 2336 -  Mechanics I .Web: http:\/\/www.cive.uh.edu\/programs\/undergraduateThis program is offered in face-to-face format at University of Houston at Katy.See “Requirements for current UH Students Seeking a Major Change to Engineering” section at link below. Return to: Major and Minor Fields of Study Listed Alphabetically","Construction Management":"Engineering - Technology Division  > Department of Construction Management  > Construction Management, B.S.The program offers two curricula: one desirable for Process and Industrial Construction and the other for Commercial Construction. Each provides a balanced mix of construction, engineering and business skills.The objective of the Construction Management program is to provide graduates with knowledge and skills that are valued and sought by the construction industry profession. Commercial, industrial, and highway\/heavy sectors of the construction industry need entry-level professional employees who are knowledgeable and skilled. Graduates must have knowledge of construction materials and methods, structural systems, soils site development, business, and contract administration; and have skills for\r\nplanning, estimating, scheduling, and evaluating project performance. The curriculum provides fundamental and advanced coursework that incorporates current standards and technology for managing and providing quality construction. Software is applied in curriculum courses to prepare students for the utilization of computer applications in construction management.Our Construction Management graduates should have knowledge and problem-solving skills to perform the following tasks:The program is committed to attaining the following goals:At the Masters level, students will receive advanced education, preparing them to be construction management leaders in industry or faculty members in academia. For more information on the graduate program, please refer to the Graduate and Professional Studies catalog.Students pursuing a major in Construction Management must complete the following requirements in addition to the university core and general college requirements.  No grade lower than C will be accepted for CNST courses.GPA for major will be calculated on the major requirements including the Commercial Construction or the Process and Industrial Track.  Return to: Major and Minor Fields of Study Listed Alphabetically","Dance":"Kathrine G. McGovern College of the Arts  > School of Theatre & Dance  > Dance, BFAStudents seeking the Bachelor of Fine Arts degree must fulfill the 42-hour university core curriculum and complete 81 semester hours in dance. In addition to meeting the requirements for admission at the University of Houston, students applying for entry into the BFA in Dance program must pass a performance audition. Students accepted into the BFA Dance program will be placed by the faculty into an appropriate level, as assessed through the audition process. Upon acceptance into the BFA Dance program, the candidates must maintain or exceed the standards of the program. The annual review process of BFA Dance candidates includes:Meeting with assigned faculty mentor each semester in the Freshman or first year (transfer students) enrolled at the University of Houston. Thereafter, meeting faculty mentor annually. Student is responsible for contacting mentor and setting up appointments.An annual review by faculty of the BFA candidate regarding progress, potential, and ability to successfully complete program. A negative assessment will place the student on probation for the following semester.Students who earn below a 2.00 (C) in any dance course will be placed on department probation.To satisfy degree requirements, students in the BFA Dance program must maintain a cumulative 2.67 (B-) average in all major courses. Falling below this mark will place the student on department probation.     DAN (or ARTS) ELECTIVE (to include 3 credit internship option). The following list shows approved program course electives. Other undergraduate elective courses can be applied to the program subject to the approval of the Program Director\/advisor.  Return to: Major and Minor Fields of Study Listed Alphabetically","Digital Media":"Engineering - Technology Division  > Department of Information and Science Technology  > Digital Media, B.S.LEADERSHIPCREATIVITYPRINT AND PACKAGINGUSER EXPERIENCE AND SOCIAL MEDIAMOTION MEDIA AND ANIMATIONAUGMENTED AND VIRTUAL REALITYThese are the areas that are explored in Digital Media at the University of Houston.Digital Media is the creative convergence of digital arts, science, technology and business for human expression, communication, social interaction and education. The Digital Media program is characterized by a curriculum which stresses the “producer” and “strategist” aspects of digital media and emphasizes the research\/business aspect of the discipline along with its technical and aesthetic aspects. Digital Media is a dynamic and ever-changing field and includes some of the largest industries in the United States.By using your leadership and strategic talents, you can create a communications tapestry by weaving together people and the technologies of print, packaging, photography, motion media, social media, game app design, and web design. Effective contemporary visual communication requires a mix of communications technologies; still- and motion media, social media, and websites, and augmented virtual reality, in addition to printed media.The University of Houston Digital Media program prepares highly-qualified, sought-after, and technologically-savvy project managers who exceed the visual communication needs of their clients. Students who enroll in this program will gain competencies in various graphic-related technologies that support the digitization of graphic and text content as well as a broad background in leadership and supervision. Much of the curriculum is devoted to the utilization of digital-media-oriented information technology as it impacts the communication workflow. Graduates from this program move into positions of service support in businesses specializing in communication through print, internet, eMedia, social media, gaming, and motion-media technologies. Service support positions that graduates assume are typically part of the larger sales function of digital media firms and include titles such as customer service representative, estimator, planner, supervisor, and scheduler. For graduates to move into salesperson positions, they generally build upon the skills they have mastered in other service-support positions within digital media firms.Digital Media (DIGM) courses are offered by the Information and Science Technology Department at the University of Houston. Classes are offered on the Sugar Land campus. DIGM courses cover computer graphics, user experience, social media analytics, visual communication principles, animation, augmented and virtual reality, TransMedia Marketing®, visual design concepts, print technologies, production management, and portfolio development. Courses include theory-rich lectures as well as hands-on and enjoyable activities conducted in our state-of-the-art laboratories on the latest equipment. Each student also completes a senior thesis or project and internships are encouraged. You can learn more about the digital-media-specific classes and assignments by browsing https:\/\/dot.egr.uh.edu\/digitalmedia.The Digital Media degree is designed to be completed in four years and consists of 120 semester hours of undergraduate credit. The freshman and sophomore years may be completed at our cooperating community college, Wharton County Junior College. The program requires 42 hours of university core courses. In addition to meeting the 42 semester hours of university core curriculum requirements, students must complete major core requirements, an emphasis area, and approved electives. The Digital Media core covers:The program also provides for twleve hours of electives that includes courses related to:Students are required to complete one of the following minors:Digital Media courses are taught primarily on the main campus’ satellite facility in Sugar Land. Digital-media related courses completed at other community colleges may not be eligible for transfer. If you are a community college student, please refer to https:\/\/dot.egr.uh.edu\/digitalmedia\/program\/degree-requirements before taking any courses you wish to transfer into the Digital Media Program.Through course content, assignments, and critiques, the Digital Media program prepares its students to excel in careers that require tight deadlines, attention to detail, adaptability to changing technology, multi-tasking, and practical research. Students are also prepared to give and receive constructive feedback.The Digital Media program provides extensive internship opportunities for its students as well as opportunities to network with industry professionals. In particular, the Digital Media program provides its seniors with extensive career development support including DigiFests in both fall and spring semesters. In the fall, the DigiFest allows students to display their hard-copy and electronic portfolios to alumni so that the seniors can practice interviewing, giving their elevator pitches, and showing their work. The Spring DigiFest is a career placement event during which employers meet and interview students.The Digital Media Program is committed to student success and works with students to graduate in no longer than six years from their initial college enrollment, to get good jobs, and to earn good salaries. In 2018, Digital Media students were most likely undergraduates to be employed on graduation day.The Digital Media Program offers an annual RedFest, which is the awards gala for its students. Especially talented and industrious students can win trophies, certificates and cash prizes for entries in multiple fields of production from app design through videography.Beginning in Fall 2021, declared Digital Media students and declared Graphic Communications Technology, Motion Media and Tech Package Design minors will be required to have a suitable laptop which is in good working order with the latest software and antivirus updates for their entire period of undergraduate study.Notebook computer (PC or Mac) capable of handling the Adobe Creative Cloud-Graphic Design portion. An example of such requirements can be found at https:\/\/helpx.adobe.com\/indesign\/system-requirements.html.DSLR camera capable of still and video capture. Student subscription to Adobe Creative Cloud.Note that precise specifications, which will be updated as technology changes, will be provided on the program’s website at https:\/\/dot.egr.uh.edu\/digitalmedia\/students\/prospective-students.Computer labs will continue to be available for courses that require specialized software and\/or hardware: i.e., most junior and senior courses.All majors and minors in the Department of Information and Science Technology must earn a grade of C or better in all major\/minor courses. No grade lower than C will be accepted on any courses applicable to the major transferred to the University of Houston.  (ELET 2300 requires precalculus as a prerequisite) Students must earn grade C or better in all major courses. One (1) grade of C- may be accepted towards major. Some courses may require C+ as prerequisites to major coursework.orApproved Technical Electives include any DIGM course not already applied to degree in addition to By petition, up to 12 hrs Approved Digital Media related coursework from a Community College may fulfill approved electives.By petition, a minor in Studio Arts (21 hrs) may fulfill approved electives.Major GPA will be calculated based on the major requirements. Return to: Major and Minor Fields of Study Listed Alphabetically","Earth Science":"College of Natural Sciences and Mathematics  > Department of Earth and Atmospheric Sciences  > Earth Science, B.A.Students who choose to major in earth science must complete the following requirements in addition to the special requirements for the Bachelor of Arts degree:Nineteen semester hours of approved electives, of which 15 must be advanced, and to include the NSM Capstone requirements. 33 hours total, of which 21 hours must be advanced. AndOrAnd  Return to: Major and Minor Fields of Study Listed Alphabetically","Economics":"College of Liberal Arts & Social Sciences  > Department of Economics  > Economics, B.S.Economics is the study of how a society chooses to allocate its finite resources among the infinite demands of its members. This includes analysis of the decisions made by households and firms about production and consumption of finished goods, inputs to production, and labor services, in addition to analysis of the impact of public policies on these decisions and on the economic well-being of society and its members.Specific subject areas studied in economics include aggregate analysis of business cycles and economic growth (macroeconomics), analysis of labor markets, public finance and taxation, industrial organization, international trade, the economics of money and banking, and studies in specialized fields.The academic programs of the Department of Economics seek to develop students’ capacity to think systematically and analytically about social issues. These analytical abilities give our graduates a strong fundamental background for success in professional life. The department’s graduate programs prepare students for careers as economists in business, government, and the academic community. The undergraduate program has been designed to allow students maximum flexibility to orient their curriculum either toward preparation for graduate study in law, business, or economics, or toward professional courses and career placement.In addition to the academic experience, the department offers undergraduate students an opportunity for practical experience through our internship program (ECON 4390 ). The internship program allows students to earn advanced economics credit while obtaining practical experience in a professional environment.To declare a major in Economics, the following must be met.First time in college students may declare Economics as their major if they meet the qualifications required for admission to the University of Houston.UH students who wish to change their majors to Economics must have a minimum 2.25 cumulative GPA on all coursework taken at UH.Students who transfer from other colleges of universities must have a cumulative 2.25 GPA in previous coursework.In addition, all students beyond their freshman year must enroll in, and remain enrolled in, one of the following courses:Students who choose to major in economics must also meet the university core requirements and the college core requirements for a Liberal Arts and Social Sciences Bachelor of Science degree.33 hours (at least 27 advanced) to include:In addition, Bachelor of Science candidates are required to take a calculus course:orand a Statistics course:orStudents in the Economics B.S.\/MPP accelerated pathway may substitute up to 12 hours of 6000-level POLC courses for advanced electives and\/or general electives for the Economics B.S. degree as specified under Accelerated B.A.\/B.S. in Economics\/Master of Public Policy . Return to: Major and Minor Fields of Study Listed Alphabetically","Electrical Engineering":"Cullen College of Engineering  > Department of Electrical and Computer Engineering  > Electrical Engineering, B.S.E.E.In the ECE Department, taking courses in either degree plan is organized into two phases. The first two years are the ECE Base. The ECE Base provides fundamental skills math, science, and electrical engineering, and is identical for BSEE and BSCpE majors.In the last two years of the BSEE degree plan, students must choose one of six Concentration Areas. The Concentration Area allows the student to choose a subset of Electrical Engineering that is of particular interest to the student, while still encouraging the student to take courses in related areas.All students in the BSEE program must submit an Application for Concentration Area (available in the ECE Department) prior to enrolling in their first Concentration Elective. The student will then be assigned a Faculty Advisor in the chosen Concentration Area. Following the initial advising session with the Faculty Advisor, the student may enroll in the Concentration Area.The Electrical Engineering Major GPA is calculated using all ECE courses as well as all Engineering Computing XXXX 1331 courses. In addition, for electrical engineering majors, the major grade point average will also include all COSC courses that could be applied to the Bachelor of Science in Electrical Engineering degree.Students must select one of the six Electrical Engineering concentration areas. A total six lecture courses and three laboratory courses in the concentration area must be successfully completed. Courses are selected as follows. Return to: Major and Minor Fields of Study Listed Alphabetically","Electrical Power Engineering Technology":"Engineering - Technology Division  > Department of Engineering Technology  > Electrical Power Engineering Technology, B.S.The goal of the Electrical Power Engineering Technology program is to provide students with a high-quality applications-oriented undergraduate education based on state-of-the-art technological equipment associated with electrical power engineering technology. This goal is achieved through several objectives including continued updating of specific courses in the program to ensure relevance to the latest industrial changes, supporting the development of appropriate computer facilities, promoting the integration of advanced technology in all courses, and encouraging professional growth and development of the faculty.The program is designed to satisfy the educational needs of the Houston community by providing a climate that fosters intellectual and personal growth, and a desire for life-long learning.Students completing a major in Electrical Power Engineering Technology receive a strong foundation in electrical power systems, analog and digital signal conditioning, microprocessor hardware and software, industrial electronics, electrical transmission and distribution and rotating machinery operation, application and control.Students have the opportunity to select additional coursework in control systems, alternative energy sources, and other electrical power-related topics.One of the newest and fastest-growing areas is in the application of computers for electrical power system control; and power grid management.The manufacturers of electrical systems and equipment need electrical power technologists who are familiar with both traditional and computer-controlled machines and electrical systems.The electrical industry provides and controls the transformers, motors, generators, switchgear, and protection equipment required to power homes, businesses, and industries. Electrical power technologists plan electrical systems, modifications to existing electrical systems, and system protection for large electrical distribution and transmission networks to ensure that they are dependable, economical and safe.Graduates of the Electrical Power Engineering Technology major understand, design, analyze, and work effectively in industrial settings utilizing product\/process control systems and electrical power systems.Graduates are working in petrochemical companies, electrical utilities, electrical equipment, manufacturing, sales, testing, and a host of other electrical power-related industries.Students pursuing a major in Electrical Power Engineering Technology must complete the following requirements, in addition to university core and general college requirements:   Majors in Electrical Power Engineering Technology may use no grade below C- ELET courses to satisfy major degree requirements.Major GPA is calculated based on courses listed in major requirement and approved electives. Return to: Major and Minor Fields of Study Listed Alphabetically","English":"College of Liberal Arts & Social Sciences  > Department of English  > English, B.A.The Bachelor of Arts in English encompasses a variety of academic and career goals (e.g., graduate school in English; secondary certification); therefore, students with specific objectives should choose a concentration and consult with the English advisor as soon as possible to ensure optimal selection of advanced English electives.Students majoring in English with a concentration in Literature must complete all university and college requirements for the Bachelor of Arts Degree . Before enrolling in advanced courses in English, students must complete the six-hour University Core requirement in Communication  (ENGL 1301  and ENGL 1302  or equivalents) and (or be currently enrolled in) MATH 1314  or MATH 1332 . Only six hours of 2000 level courses in English may be applied toward the major. In addition to the university and college requirements for the Bachelor of Arts degree, majors seeking a concentration in Literature will take thirty-six semester hours in English of which thirty advanced hours (3000- and 4000-level courses), are required for the major to include:It is strongly suggested that majors take this course within the first nine hours of advanced English.(To be taken within the final three semesters at the senior rank). The following courses allow for the meeting of this 3-hour research-intensive seminar requirement: ENGL 3399  cannot count toward this requirement.Students in the Literature Concentration may be permitted to write a senior honors thesis. In order to pursue a senior honors thesis, a student must have a minimum GPA of 3.5 in the major in addition to the thesis requirements set by the Honors College. In the spring of a student’s junior year, she\/he must identify a thesis advisor and submit a “Senior Honors Thesis Verification of Eligibility Form” to the English Director of Upper Division Studies. During a student’s senior year, she\/he will enroll in ENGL 3399  and ENGL 4399 . Both courses must be completed in order for credit to be earned. The thesis committee ultimately determines appropriate and sufficient length and quality.Students must complete at least 15 hours in all courses in the major in residence at the University of Houston. 12 hours of the advanced courses in the English major must be in residence at the University of Houston. Students must complete a minimum of 30 credit hours of advanced courses in the English major.Students majoring in English with a concentration in creative writing must complete all university and college requirements for the Bachelor of Arts degree. Students seeking to concentrate in Creative Writing must apply for admission into the Concentration. Application to the Concentration in Creative Writing requires the submission of a portfolio. Blind review of portfolios occurs once each semester. Students who are not admitted into the Concentration may reapply the following semester. Before enrolling in advanced courses in English, students must complete the six-hour university Core requirement in Communication (ENGL 1301  and ENGL 1302  or equivalents) and (or be concurrently enrolled in) MATH 1314  or MATH 1332 . Only six hours of 2000 level courses in English may be applied toward the major. After completing those six hours, students should complete ENGL 3331 , then advance to either ENGL 3330  or ENGL 3332  to complete the required 3000-level Creative Writing courses. 4000-level creative writing courses are open only to students who have been admitted to the Concentration in Creative Writing. In addition to the university and college requirements for the Bachelor of Arts degree, majors seeking a concentration in creative writing will take forty-two hours in English of which 36 advanced hours (3000- and 4000-level courses) are to be completed for the major to include:Note: ENGL 3399  cannot count toward this requirement.(Senior Experience course to be completed within the final three semesters at the senior rank. Prerequisites for these courses will be the forms courses, ENGL 4385  or ENGL 4383  or ENGL 4357 .)In order to graduate with a major in English with a Concentration in Creative Writing, the student must have a minimum overall average of B (3.00) in creative writing courses.Students in the Creative Writing Concentration may be permitted to write a senior honors thesis. Students who affiliate with the Honors College and complete a senior honors thesis receive the honors designation with Honors College and complete a senior honors thesis receive the honors designation with Honors in English in addition to their Honors College designation (University Honors, Collegiate Honors, or Membership in the Honors College). In order to pursue a senior honors thesis in creative writing, the student must have a minimum GPA of 3.5 in in the major in addition to the thesis requirements set by the Honors College. He or she must submit a preliminary manuscript of 10 pages of poetry or 20 pages of prose to a creative writing faculty member for review. If the manuscript is accepted, that faculty member will serve as the student’s thesis advisor, and the student will register for ENGL 3399  and ENGL 4399 . Both courses must be completed in order for credit to be earned. The student must complete, with a grade of B+ or better, the creative writing thesis, a manuscript of approximately 40 pages of poetry or 80 pages of prose. The thesis committee ultimately determines appropriate and sufficient length and quality.Students must complete at least 15 hours in all courses in the major in residence at the University of Houston. 12 hours of the advanced courses in the English major must be in residence at the University of Houston. Students must complete a minimum of 36 credit hours of advanced courses in the English major.Students majoring in English with a concentration in Applied Linguistics must complete all university and college requirements for the Bachelor of Arts Degree . Before enrolling in advanced courses in English, students must complete the six-hour University Core requirement in Communication  (ENGL 1301  and ENGL 1302  or equivalents) and (or be currently enrolled in) MATH 1314  or MATH 1332 . Only six hours of 2000 level courses in English may be applied toward the major. In addition to the university and college requirements for the Bachelor of Arts degree, majors seeking a concentration in Applied Linguistics will take thirty-three semester hours in English of which twenty-seven advanced (3000- and 4000-level courses) are required for the major, to include:Lower-division courses (2000-level) related to the study of language in other departments, including the study of foreign languages, may be used if approved by the department.Three hours in Global Literature:Any 3000-4000 linguistics course. Courses from other departments with linguistics content may be used if approved by department.Topic(s):Topic(s):(To be taken within the final three semesters at the senior rank). The following courses allow for the meeting of this 3 hour research-intensive seminar requirement:Students in the Applied Linguistics Concentration may be permitted to satisfy the “Senior Experience” requirement by writing a senior honors thesis. Choosing this option will bring the total concentration to 36 total credit hours. In order to pursue a senior honors thesis, a student must have a minimum GPA of 3.5 in the major in addition to the thesis requirements set by the Honors College. In the spring of a student’s junior year, she\/he must identify a thesis advisor and submit a “Senior Honors Thesis Verification of Eligibility Form” to the English Director of Upper Division Studies. During a student’s senior year, she\/he will enroll in ENGL 3399  and ENGL 4399 . Both courses must be completed in order for credit to be earned. The thesis committee ultimately determines appropriate and sufficient length and quality. Return to: Major and Minor Fields of Study Listed Alphabetically","Entrepreneurship":"C.T. Bauer College of Business  > Department of Marketing and Entrepreneurship  > Entrepreneurship, B.B.A.Courses in entrepreneurship (ENTR) provide students with information regarding all aspects of entrepreneurship. Specific topics include evaluating the feasibility of a business idea, developing a business plan, bringing products\/services\/technologies to market, managing the people side of business, managing the money side of business, and personal development.The major career objectives are to have entrepreneur students capable of starting their own businesses, or going to work for an existing entrepreneur.Entrepreneur majors may consider applying to the Select Cohort program offered through the Wolff Center for Entrepreneurship (WCE). This program combines academic rigor, mentoring, and additional practical experience to provide the foundation needed to develop, launch, and manage business enterprises in a rapidly changing business environment.Admission to the WCE Select Cohort program is determined during the fall semester for students who have completed or are enrolled in ENTR 3310  or ENTR 3311 .For WCE Select Cohort program information, admission, and special program requirements, see: Wolff Center for Entrepreneurship.Requirements: 18 semester credit hours total* Student may consult the Entrepreneurship Advisor for approved substitutions.* The 9 hours of General Electives are designated for 6 hours of any unused Component Area Option (090) courses and 3 hours of an unused Social\/Behavioral Science (040) course. Remaining hours can be met by any 1000-4000 level course.Undergraduate business majors in the accelerated pathway B.B.A.\/M.S. degree program who complete graduate courses as an undergraduate may count them toward the requirements for the B.B.A. regardless of admission to a M.S. business program toward major or minor requirements for courses with the same letter rubrics as their major or minor, or toward elective requirements of their major.In order to earn a Bachelor of Business Administration (B.B.A.) degree, students must complete credit hour requirements:along with noncredit requirements:Students seeking the Bachelor of Business Administration degree must complete freshman-sophomore core and Business Administration and Management Field of Study requirements, upper-level business core and required courses, major requirements, and clear the business writing evaluation (BWE).The total hours required for a Bachelor of Business Administration degree are summarized below. Students in the Bauer Business Honors Program have additional requirements as specified under the description of the Bauer Business Honors Program.Students pursuing the Global Energy Management Professional Program (GEM-PP) track in Finance have specialized degree requirements listed under the GEM-PP track for a major in finance. Other specialty programs, such as the Professional Program in Accounting, the Entrepreneurship Program, and the Program for Excellence in Selling, may have additional admission and program requirements as specified by the program.B.B.A. requirements also listed as approved UH core courses may fulfill both requirements, but students must have a minimum of 120 credit hours to earn the B.B.A.Specific course requirements in each category are discussed in the following sections. ECON 2301 and ECON 2302 may count for Core Social and Behavioral Science requirement and Field of Study (students without either ECON 2301 or ECON 2302 and substituting Intermediate ECON would be required to take a Social and Behavioral Science course in place of a General Elective Requirement.6 Credit Hours24 Credit HoursCourses require completion with a grade of “C” or higher in all Business Administration and Management Field of Study courses unless a transfer student has completed the Business Administration and Management Field of Study at another Texas public institution. ^ Consult the catalog for additional requirements if pursuing the Global Energy Management Professional Program.24 Credit HoursComplete both:Complete both:21 Credit HoursThis section is required for all business majors. 4000-level requirement (requires a degree plan on file): Return to: Major and Minor Fields of Study Listed Alphabetically","Environmental Design":"Gerald D. Hines College of Architecture and Design  > Environmental Design, B.S.The program for the Bachelor of Science in Environmental Design degree (preprofessional) is a four-year curriculum of at least 128 semest credit hours.The curriculum includes at least 73 semester credit hours of architecture courses, 34 of which are advanced (3000 level or higher). The degree includes the university’s required core curriculum and 4 semester hours of elective courses. The program maintains the same focus as the Bachelor of Architecture program with less emphasis on professional practice.The Bachelor of Architecture requires a successful review of work after the 3rd semester for advancement in the degree.The Bachelor of Science in Environmental Design requires a successful review of work after the 3rd semester for advancement in the degree.The Bachelor of Science in Industrial Design requires a successful review of work after the 4th semester for advancement in the degree.http:\/\/www.uh.edu\/architecture\/programs\/undergraduate-programs\/environmental-design\/Meg Jackson, Instructional Assistant Professor & Foundation Level Coordinatormhjackson@uh.edu Return to: Major and Minor Fields of Study Listed Alphabetically","Environmental Sciences":"College of Natural Sciences and Mathematics  > Department of Earth and Atmospheric Sciences  > Environmental Sciences, B.S.The general requirements, including university core curriculum and college requirements, shall apply. In addition to the general requirements, students pursuing the Bachelor of Science in Environmental Sciences must complete the following: orApproved electivesApproved electivesGeosciences courses are commonly offered on a one- or two-year cycle. Therefore, it is the student’s responsibility to become familiar with course scheduling and the prerequisites for courses and to consult with the undergraduate advisor regularly.The Bachelor of Science degree requires completion of a minimum of 120 hours, at least 36 of which are to be advanced hours. Students must earn a minimum 2.0 cumulative GPA in all courses attempted at the university. In addition, students must earn a minimum 2.00 cumulative GPA in all courses in the major attempted at the university. Students must have no more than 6 semester hours with grades below C- in all courses attempted in the major, which includes all the GEOL courses and Group 1 and Group 2 Electives. Any student exceeding that limit must retake sufficient courses and obtain acceptable grades so that they do not exceed the two-course limit.All students in NSM must complete the Capstone requirement. Students may satisfy the Capstone in a number of ways, e.g. by completing an approved minor, a double major, a senior research project, a senior honors thesis, or 6 hours of NSM-designated interdisciplinary capstone courses (e.g. GEOL 3355 -GEOL 3360 ).No GEOL course with a grade below C- can be used as a prerequisite for a more advanced GEOL course.Students with more than 6 hours in GEOL courses with grades below C- are not allowed to enroll in subsequent GEOL courses without written permission from the undergraduate advisor.Note that all undergraduate majors should meet with the Faculty Advisor prior to registration each term. Return to: Major and Minor Fields of Study Listed Alphabetically","Exercise Science":"College of Liberal Arts & Social Sciences  > Department of Health and Human Performance  > Exercise Science, B.S.Students must meet the general degree requirements for the Bachelor of Science degree, including the formal science requirement.Students must meet the general degree requirements for the Bachelor of Science degree, including the formal science requirement.Earned Grade Requirements for Kinesiology Courses: Students receive 2 attempts to complete all prerequisite courses with a C- or better; failure to do so will result in ineligibility to graduate in the major. Return to: Major and Minor Fields of Study Listed Alphabetically","Finance":"C.T. Bauer College of Business  > Department of Finance  > Finance, B.B.A. - Risk Management & Insurance Track and CertificateFinance students will be able to participate in the Risk Management and Insurance (RMI) track, and upon completion students will receive a certificate of the RMI Track.Finance Risk Management & Insurance Track Major Coursework (39 Credit Hours) and Certificate (21 Credit Hours)Finance majors interested in course work related to careers in Risk Management and Insurance may pursue a Risk Management and Insurance Track in Finance and receive a Risk Management and Insurance certificate by meeting the following requirements within the Finance major, and having a 3.0 or higher cumulative grade point average to declare the track for the certificate. To earn the certificate, students must complete 21 credits of courses designated with an asterisk (*) and complete all requirements for the Bachelor of Business Administration (B.B.A.) degree with a major in Finance.Twelve credit hours of required finance courses must be: Select nine credit hours from the following:*Approved Selected Topics and other Finance courses related to Risk Management and Insurance. (Consult Finance Advisor for list of approved courses.) Required Advanced Business Elective (3 Credit Hours)(STAT 3331 is a prerequisite for 4000-level Finance courses) Additional Elective Hours Required:** The 9 hours of General Electives are designated for 6 hours of any unused Component Area Option (090) courses and 3 hours of an unused Social\/Behavioral Science (040) course. Remaining hours can be met by any 1000-4000 level course.Undergraduate business majors in the accelerated pathway B.B.A.\/M.S. degree program who complete graduate courses as an undergraduate may count them toward the requirements for the B.B.A. regardless of admission to a M.S. business program toward major or minor requirements for courses with the same letter rubrics as their major or minor, or toward elective requirements of their major.In order to earn a Bachelor of Business Administration (B.B.A.) degree, students must complete credit hour requirements:along with noncredit requirements:Students seeking the Bachelor of Business Administration degree must complete freshman-sophomore core and Business Administration and Management Field of Study requirements, upper-level business core and required courses, major requirements, and clear the business writing evaluation (BWE).The total hours required for a Bachelor of Business Administration degree are summarized below. Students in the Bauer Business Honors Program have additional requirements as specified under the description of the Bauer Business Honors Program.Students pursuing the Global Energy Management Professional Program (GEM-PP) track in Finance have specialized degree requirements listed under the GEM-PP track for a major in finance. Other specialty programs, such as the Professional Program in Accounting, the Entrepreneurship Program, and the Program for Excellence in Selling, may have additional admission and program requirements as specified by the program.B.B.A. requirements also listed as approved UH core courses may fulfill both requirements, but students must have a minimum of 120 credit hours to earn the B.B.A.Specific course requirements in each category are discussed in the following sections. ECON 2301 and ECON 2302 may count for Core Social and Behavioral Science requirement and Field of Study (students without either ECON 2301 or ECON 2302 and substituting Intermediate ECON would be required to take a Social and Behavioral Science course in place of a General Elective Requirement.6 Credit Hours24 Credit HoursCourses require completion with a grade of “C” or higher in all Business Administration and Management Field of Study courses unless a transfer student has completed the Business Administration and Management Field of Study at another Texas public institution. ^ Consult the catalog for additional requirements if pursuing the Global Energy Management Professional Program.24 Credit HoursComplete both:Complete both:21 Credit HoursThis section is required for all business majors. 4000-level requirement (requires a degree plan on file): Return to: Major and Minor Fields of Study Listed Alphabetically","Fitness and Sports":"College of Liberal Arts & Social Sciences  > Department of Health and Human Performance  > Fitness and Sports, B.S.     Return to: Major and Minor Fields of Study Listed Alphabetically","French":"College of Liberal Arts & Social Sciences  > Department of Modern and Classical Languages  > French, B.A.In addition to the other requirements for the Bachelor of Arts, students will complete 27 semester hours in French at the advanced level (3000 and 4000) to include the following:Six semester hours at the advanced level, as follows: And three hours selected from the following:Students starting a major in French should work in close consultation with the departmental advisor to ensure that their degree plan is coherent, well-balanced and appropriate to their long-range goals.French majors must earn at least a 2.50-grade point average in all French courses counting toward the major and attempted at the University of Houston. Some of the above requirements may be satisfied by courses from the department’s program in France (see above). Students majoring in French are encouraged to seek advice concerning their degree objectives from the department’s undergraduate advisor during their first or second semester at the University of Houston.In addition to the requirements in French, students majoring in French will choose a minor, to be approved by the department, in a field complementing the study of French and relevant to the students’ career interests. Suggested minors include other languages, English, Art History, Classical Studies, History, Business Administration, Economics, Political Science, or another minor of particular interest to the individual student. Specific prerequisites and requirements for minors are described in the appropriate sections of this catalog.Prerequisites for all the advanced courses in French include the equivalent of at least six semester hours in second-year college French. Students with credits in high school or college French must take a placement test before entering a French course at the University of Houston.Students with no high school French may satisfy the first-year requirements by completing both of the\nfollowing courses:First Semester:Second Semester:Students may satisfy the second-year requirements by completing six hours from the following courses:First Semester:Second Semester: Students may also satisfy the second-year requirements in the summer program in France.The department does not award credit by examination for elementary French. Students may obtain up to six hours of credit in intermediate (2000-level) French by special examination, administered by the department. Credit may be awarded by special examination for FREN 3313 . No credit by exam is awarded for other 3000-level French except by a score of 4 or 5 on the AP exam or by special permission. Students should consult the following: Credit by Examination . Return to: Major and Minor Fields of Study Listed Alphabetically","Geology":"College of Natural Sciences and Mathematics  > Department of Earth and Atmospheric Sciences  > Geology, B.S.Completion of the BS in Geology or Geophysics requires several extended off-campus field trips which involve moderate to strenuous outdoor activity (e.g. all-day field exercises and hiking), including a 5-week capstone field course in Montana for the Geology BS, and a 3-week capstone field course in Galveston for the Geophysics BS. Students who feel they may not be able to fulfill this requirement should talk with the Geology and Geophysics undergraduate advisor before declaring their major.Students who choose to major in geology must complete the following requirements in addition to the special requirements for the Bachelor of Science degree:Six credit hours of approved advanced GEOL electives Credit Hours: 6.0Successful completion of GEOL 3355  and GEOL 3360  satisfies NSM Capstone Requirement Return to: Major and Minor Fields of Study Listed Alphabetically","Geophysics":"College of Natural Sciences and Mathematics  > Department of Earth and Atmospheric Sciences  > Geophysics, B.S.Completion of the BS in Geology or Geophysics requires several extended off-campus field trips which involve moderate to strenuous outdoor activity (e.g. all-day field exercises and hiking), including a 5-week capstone field course in Montana for the Geology BS, and a 3-week capstone field course in Galveston for the Geophysics BS. Students who feel they may not be able to fulfill this requirement should talk with the Geology and Geophysics undergraduate advisor before declaring their major.Students who choose to major in geophysics must complete the following requirements in addition to the special requirements for the Bachelor of Science degree:Successful completion of GEOL 4355  and GEOL 4381  satisfies NSM Capstone Requirement. Return to: Major and Minor Fields of Study Listed Alphabetically","Global Hospitality Leadership":"Conrad N. Hilton College of Global Hospitality Leadership  > Global Hospitality Leadership, B.S.Credit hours: 10; Student selects one track:Prerequisite: minimum grade of “B” in GHL 3345 - Wine AppreciationPrerequisite: minimum cumulative grade point average of 3.0 Return to: Major and Minor Fields of Study Listed Alphabetically","Health Communication":"College of Liberal Arts & Social Sciences  > Jack J. Valenti School of Communication  > Health Communication, B.A.Students in health communication will develop and acquire knowledge and skills essential to becoming more effective health care consumers and advocates as well as learn the fundamentals of health campaign planning, implementation, and evaluation. Research, theory, and practical application are combined to help students develop communication strategies associated with positive health outcomes and successful negotiation of the health care system. Students will complete coursework across a wide range of health care situations focusing on interpersonal, group, organizational, cultural, and computer-mediated levels of analysis. Students will also complete coursework across a wide range of health care contexts focusing on the role of gender, media, tailored messages, and e-health in building, delivering, and evaluating mediated health campaigns to promote health and behavior change.Students in good academic standing may declare a degree program in the Jack J. Valenti School of Communication at any time. Students interested in the school but uncertain about a degree program may declare themselves Communication Unspecified (COMM-UN) up to completion of 30 hours. Then they must choose a degree program.To declare a major in the Jack J. Valenti School of Communication a student must have a cumulative GPA of at least 2.25 or higher on minimum of 12 semester hours at UH.A transfer student or UH non-communication student with 15-60 semester hours of college credit who wants to declare a degree program in the Jack J. Valenti School of Communication must have a 2.25 or higher cumulative grade point average, including any attempted transfer courses.Applicants who have completed more than 60 semester hours of college credit need a 2.25 or higher cumulative grade point average on the last 60 hours.Transfer students who have earned fewer than 15 semester hours of college credit must meet freshman admission requirements.To graduate with a Bachelor of Arts in any Valenti School degree program: Return to: Major and Minor Fields of Study Listed Alphabetically","Health":"College of Education  > Department of Psychological, Health, and Learning Sciences  > Health, B.S.Communities need increasing numbers of public health educators, health promotion specialists, and allied health professionals with a B.S. degree.  Not only will recent healthcare reforms demand greater number of healthcare providers and educators, this need is exacerbated as a generation of health professionals are retiring. This program prepares students to meet the opportunity, with passionate and accomplished health faculty, who have extensive experience in health education and research in the areas of health disparities, obesity, smoking prevention and treatment, HIV, and cardiovascular disease.Students with a 2.3 cumulative UH GPA may declare a major in Health. The Bachelor of Science in Health offers three degree tracks: public health; health promotion; and health promotion for allied health professionals.All three tracks may be designed to meet the coursework criteria for eligibility to become a CHES (Certified Health Education Specialist). The CHES national competencies are generic to the practice of health promotion and health education, whether it takes place in schools, colleges, workplaces, health care settings, or other settings within a community.Please see department advisor for more information.The Public Health Track and the Health Promotions Track for the Bachelor of Science in Health degree require a declared minor; for the Health Promotions for Allied Health Professionals Track, a declared minor is optional. All degree requirements for a declared minor must be satisfied prior to awarding of the degree.Below, is a description of each degree track, followed by a list of course requirements for each degree track.The Public Health Track degree option provides courses required for entry-level public health jobs found in government agencies, health corporations, community non-profit organizations and health care facilities. The Public Health Track consisting of 30 hours of Public Health Track Core courses, combined with required Health Electives, offers numerous strong opportunities to public health majors for employment. It also provides a feeder-program for graduate study in our College of Education programs, local Schools of Public Health, and health professional schools in the Texas Medical Center and statewide.The Health Promotion Track degree option provides courses required for entry-level health promotion jobs found in state\/county health departments, medical facilities, and community organizations. The Health Promotion Track consists of 21 hours of Health Promotion Track Core courses and required Health Electives designed to provide the student with the flexibility to develop areas of individual competencies desirable for future employment. Socio-cultural, behavioral, psychological, and biological factors contributing to wellness and disease are emphasized. It is an ideal major for students interested in public\/community health practice, health behavior research, program planning and delivery, and pre-professional preparation for medicine, pharmacy, optometry, and dentistry.The Health Promotion Track for Allied Health Professionals degree option provides courses required for entry-level health promotion jobs for allied health professionals that promote disease prevention, treatment, and administration and management skills. The Health Promotion for Allied Health Professionals Track consists of 21 hours of Health Promotion for Allied Health Professionals Core courses, required health electives, and 15-30 hours of associate degree transfer credits and approved electives. Students who have completed a two-year associate degree program in an allied health field (e.g., dental hygiene, respiratory therapy, health information technology, speech-language pathology assistant, nursing, occupational therapy assistant, pharmacy technician, radiologic technology, physical therapy) may transfer University core course requirements and advisor-approved courses from their allied health field associate degree. This curriculum provides a program that coordinates well with previous backgrounds and training and allows students to progress to a Bachelor’s Degree.The Bachelor of Science degree in Health offers three tracks from which students may choose:* Choose courses from the Core Curriculum List .Students completing the Public Health Track Core and Health Electives may be eligible to become Certified Health Education Specialists.(12-18 semester credit hours of which 9 must be advanced)Free Elective denotes that student is free to take any university course that is related to their field of study to fulfill this requirement. At least 9 (of the required 12-18 Free Electives) must be advanced-level courses, i.e., 3000- or 4000-level courses. It is imperative that students confirm with their health program advisor prior to ORD (Official Reporting Date) that a course is considered to be related to their field of study. Please see your advisor for additional details.Minimum of 15 semester credit hours of which 9 must be advanced. See minor department for requirements. All degree requirements for a declared minor must be satisfied prior to awarding of the B.S. degree.Recommended minors:* Choose courses from the Core Curriculum List .(12-15 semester credit hours of which 9 must be advanced)Free Elective denotes that student is free to take any university course that is related to their field of study to fulfill this requirement. At least 9 (of the required 12-18 Free Electives) must be advanced-level courses, i.e., 3000- or 4000-level courses. It is imperative that students confirm with their health program advisor prior to ORD (Official Reporting Date) that a course is considered to be related to their field of study. Please see your advisor for additional details.Minimum of 15 semester credit hours of which 9 must be advanced. See minor department for requirements.Recommended minors:Students completing the Health Promotion Track may be eligible to become Certified Health Education Specialists.Students with an associate’s degree or certification in an Allied field should notify their Health advisor for degree options.* Choose courses from the Core Curriculum List .Transfer credits must be an associate degree in allied health from an accredited community college or university.(0-15 * semester credit hours)* Free Electives are used to meet the minimum graduate requirement (up to 15 semester hours).Free elective denotes that student is free to take any university course that is related to their field of study to fulfill this requirement. 1000-, 2000-, 3000-, and 4000-level course may be considered. It is imperative that students confirm with their health program advisor prior to ORD (Official Reporting Date) that a course is considered to be related to their field of study. Please see your advisor for additional details.15-18 semester credit hours of which 9 must be advanced* (i.e., 3000- or 4000-level courses)Recommended minors:*May be advisor waived if sufficient allied health electives are transferred.Students completing the Health Promotion Track for Allied Health Professionals may be eligible to become Certified Health Education Specialists. Students with an associate degree or certification in an allied health field should notify their Health program advisor for degree options. Return to: Major and Minor Fields of Study Listed Alphabetically","History":"College of Liberal Arts & Social Sciences  > Department of History  > History, B.A.Students who major in History must complete thirty-six semester hours in History, including:Historian’s Craft or a historical methods course from the list below. The Historian’s Craft or equivalent must be taken before completing the 4000 level history capstone seminar required of majors. Approved Courses Equivalent to Historian’s Craft: 3 semester hours of a 4000 level Capstone Research Seminar is required and cannot be taken before completing the Historians Craft or equivalent.Students can select one of the following from this capstone course list:For history majors planning careers in energy\/environment; law and public policy; public history; or science, medicine, and technology, the department offers a Professional Studies concentration, consisting of 9 hours. The 9 hours fit within the history major requirements and do not add additional hours. Students who are interested in pursuing a Professional Studies concentration must decleare their intent with the Undergraduate Advisor.Students seeking the Bachelor of Arts in History with Teacher Certification should refer to the section on CLASS Teacher Certification Programs   and to the College of Education   Section of this catalog. Return to: Major and Minor Fields of Study Listed Alphabetically","Honors Biomedical Sciences":"Colleges  > College of Natural Sciences and Mathematics  > Department of Biology and Biochemistry  > Honors Biomedical Sciences, B.S.(HP)2 ContactsBrenda Rhoden, Associate Dean for the Honors CollegeHouston Biomedical Sciences (HBS) offers a rigorous Bachelor of Science degree to prepare students for a career in the health professions. HBS requires students to be in the Honors College.Requirements to major in HBS:taken with *If students enter with ENGL 1301\/1302 credit, other paired courses for Human Situation are required (ENGL 2360 -  Western World Lit I–Honors , HON 2341 -  Classics of Modernity )  taken with or or  or *Credit for CHEM 1111  is earned by completion of CHEM 1321 , CHEM 1322 , and CHEM 1112  H, see Credit by Examination  information.or or or oror or **At least one HIST, one GOVT, and one Social & Behavioral Science (PSYC 2301  is preferred), must be completed in Honors unless prior credit (AP, IB, or Transfer) has been earned.*students should select the Honors section of this course **If students enter with ENGL 1301\/1302 credit, other paired courses for Human Situation are required HON 2341 -  Classics of Modernity  Credit Hours: 3.0 with ENGL 2360 -  Western World Lit I–Honors  Credit Hours: 3.0   *students should select the Honors section of this course   *students should select the Honors section of this course   *students should select the Honors section of this course Return to: Major and Minor Fields of Study Listed Alphabetically","Human Development and Family Sciences":"College of Education  > Department of Psychological, Health, and Learning Sciences  > Human Development and Family Sciences, B.S. - with Nonprofit Leadership Alliance CertificationA Bachelor of Science degree in Human Development and Family Sciences (HDFS) provides a broadly based study of the intellectual, emotional, social, and moral development of individuals and families. HDFS graduates have a variety of opportunities available to them. Many students go on to graduate school in the fields of Social Work, Psychology, Education, Medicine, and Law.Students may also choose to take courses to prepare them for the Nonprofit Leadership Alliance Certificate which prepares students to manage nonprofit organizations.Students with a 2.3 cumulative UH GPA may declare a major in Human Development and Family Sciences.Degree Total: 120.0 Credit Hours6.0 credit hours required3 credit hours required*also serves BS Special RequirementOR3.0 credit hours required*also serves BS Special Requirement6.0 credit hours required3.0 credit hours required3.0 credit hours required6.0 credit hours required6.0 credit hours required3.0 credit hours requiredsuggested:*also serves Major Core3.0 credit hours required6.0 credit hours required**6 credit hours from Core Math and Core Math\/Reasoning above 6.0 credit hours required36.0 credit hours required15.0 credit hours requiredStudents must choose 15 hours from the approved list of area electives or receive approval for classes through petition.12.0 credit hours required Additional Requirements: Students are required to attend Non-Credit Fund Development Workshop Series which include (Eight) four-hour long workshops (32 contact hours) only and (Eight) consecutive Fridays (1:00-5:00 pm) offered in the spring semester.Additional workshops, non-credit classes, and experiential skill-building sessions required; contact the NLA program: https:\/\/uh.edu\/socialwork\/academics\/nonprofit-leaders\/.6.0 credit hours required Return to: Major and Minor Fields of Study Listed Alphabetically","Human Nutrition and Foods (ACEND Accredited Track)":"College of Liberal Arts & Social Sciences  > Department of Health and Human Performance  > Human Nutrition and Foods (ACEND Accredited Track), B.S.The A.C.E.N.D. - Accredited Track of the Human Nutrition and Foods program at The University of Houston is currently accredited by the Accreditation Council for Education in Nutrition and Dietetics (ACEND) of The Academy of Nutrition and Dietetics (A.N.D.), 120 South Riverside Plaza, Suite 2000, Chicago, Illinois 60606-6995 (Phone: 800\/877-1600). Upon completion of this degree, also called the Didactic Program in Dietetics (DPD), students are eligible to apply for entry into a supervised practice program which will make them eligible to take the Registration Examination for dietitians. At the undergraduate level, this degree emphasizes the knowledge and skills essential for competent entry-level dietetics practice.All students wishing to gain admittance to the accredited dietetics track (ACEND) will have to apply for admission.Students must complete CHEM 1311 \/CHEM 1111  and CHEM 1312 \/CHEM 1112 , NUTR 3101 , and a minimum of 12 hours from the DPD course list with an average GPA of 3.0 or higher to declare the ACEND subplan. All attempted DPD coursework will be used in GPA calculation for the ACEND admission process.GPA will include transfer GPA and UH GPA.The highest grade received for the course will be used in the GPA calculation.andor  OR Choose two lecture and lab pairs (8 credit hours) from the following: Choose one lecture and lab pair (4 credit hours) from the following:  Return to: Major and Minor Fields of Study Listed Alphabetically","Human Nutrition and Foods (Nutrition and Fitness Track)":"College of Liberal Arts & Social Sciences  > Department of Health and Human Performance  > Human Nutrition and Foods (Nutrition and Fitness Track), B.S.The B.S. in Human Nutrition and Foods (Nutrition and Fitness Track) is a professional degree designed to provide a solid foundation in the science of nutrition and a comprehensive understanding of fitness and wellness across the lifespan and in diverse settings.The B.S. in Human Nutrition and Foods (Nutrition and Fitness Track) is not a pathway to become a Registered Dietitian (RD). Students wishing to pursue the RD credential must complete the B.S. in Human Nutrition and Foods (ACEND Accredited Track).   Choose 1 CHEM course from the following (3 Credit Hours) Choose two lecture\/lab pairs (8 Credit Hours) from the following Choose one lecture\/lab pairs (4 Credit Hours) from the following  Choose four from the following: Choose seven courses from the list below: Return to: Major and Minor Fields of Study Listed Alphabetically","Human Nutrition and Foods (Nutritional Sciences Track)":"College of Liberal Arts & Social Sciences  > Department of Health and Human Performance  > Human Nutrition and Foods (Nutritional Sciences Track), B.S.The B.S. in Human Nutrition and Foods (Nutritional Sciences Track) is a degree plan designated to prepare students for post-graduate professional programs in medicine, dental, optometry, pharmacy, and other post-graduate professional programs in the health care arena. Students preparing to apply for professional programs after graduation must complete the degree requirements and prerequisites for the post-graduate health profession of their choice. Students earning a degree in the Nutritional Sciences track will have an in-depth knowledge of the science of nutrition and a solid foundation in applied science.The B.S. in Human Nutrition and Foods (Nutritional Sciences Track) is not a pathway to becoming a Registered Dietitian (RD). Students wishing to pursue the RD credential must complete the B.S. in Human Nutrition and Foods (ACEND Accredited Track).All students wishing to gain admittance to the Nutritional Sciences track of the Human Nutrition and Foods B.S. will have to apply for admission upon reaching Junior status and a cumulative Grade Point Average of 3.0.  OR Choose two lecture\/lab pairs (8 Credit Hours) from the following: Choose one lecture\/lab pair (4 credit hours) from the following:  Choose four courses from the list below: Return to: Major and Minor Fields of Study Listed Alphabetically","Human Resources Development":"Engineering - Technology Division  > Department of Human Development and Consumer Sciences  > Human Resources Development, B.S.The Human Resources Development program is designed to enable program graduates to:Students examine talent management process, e-learning tools, instructional strategies, and facilitation and evaluation techniques. Students completing the program will understand employee development processes, instructional design strategies, effective application of these processes and strategies, and appropriate evaluation procedures.ORMinor approved course work (15 credit hours)See academic advisor for approval of a 15 hour content block that addresses your career goals.Major GPA will be calculated based on the major requirements and the professional studies area or minor. Return to: Major and Minor Fields of Study Listed Alphabetically","Industrial Design":"Gerald D. Hines College of Architecture and Design  > Industrial Design, B.S. The program for the Bachelor of Science in Industrial Design degree is a four-year curriculum of at least 132 semester credit hours. The degree includes the university’s required core curriculum, 6 credit hours of approved electives, and 6 credit hours of elective courses. Because of the mutual and overlapping bonds of architecture, interior architecture and industrial design, the programs share a common first semester curriculum. The program in Industrial Design can be characterized by the keywords: accessible, flexible, virtual, ubiquitous, connected, collaborative, authentic, and learner-centered.Students interested in the Bachelor of Science in Industrial Design should follow the procedure for application to the College of Architecture.The Bachelor of Architecture requires a successful review of work after the 3rd semester and the 6th semester for advancement in the degree.The Bachelor of Science in Environmental Design requires a successful review of work after the 3rd semester for advancement in the degree.The Bachelor of Science in Industrial Design requires a successful review of work after the 4th semester for advancement in the degree.The Bachelor of Science in Interior Architecture requires a successful review of work after the 3rd semester for advancement in the degree.http:\/\/www.uh.edu\/architecture\/programs\/undergraduate-programs\/industrial-design\/Mark KimbroughCo Director Industrial Design ProgramAssociate Professor, Instructional mkimbrou@central.uh.edu Return to: Major and Minor Fields of Study Listed Alphabetically","Industrial Engineering":"Cullen College of Engineering  > Department of Industrial Engineering  > Industrial Engineering, B.S.I.E.Students must earn a 2.25 grade point average in all courses and in INDE major courses in order to enroll in 3000-level and above INDE courses. The major grade point average of 2.25 must be maintained at all times until the last semester before graduation.The major grade point average is calculated using all INDE courses plus all Engineering Computing XXXX 1331 courses.The number of attempts of an INDE course is limited to two. Attempt is defined as formal enrollment (registration) that results in a student receiving a letter grade, including grades of U, W, and I. Return to: Major and Minor Fields of Study Listed Alphabetically","Integrated Studies":"Undergraduate Student Success   > Integrated Studies, B.S.The B.S. in Integrated Studies is a general interdisciplinary degree intended to offer flexible degree attainment for a wide range of professional marketable skills to be used to achieve career and educational goals. By strategically combining different areas of study incorporating courses across multiple disciplines, students will synthesize skills with career goals aligned to the real-world job market, allowing them to be competitive in the marketplace or for subsequent graduate study.This major is offered through Undergraduate Student Success in the Provost’s Office.To graduate with a B.S. in Integrated Studies, students must:The B.S. in Integrated Studies degree consists of four curriculum areas including: Texas Core Curriculum (42 hours), Bachelor of Science Special Requirements (12 hours), Concentration Areas (36 hours), and Electives (30 hours).*Some courses may satisfy more than one requirement. Students should see their academic advisor to confirm.No more than 66 semester hours of lower division transfer hours may be applied toward a bachelor’s degree. Return to: Major and Minor Fields of Study Listed Alphabetically","Interior Architecture":"Gerald D. Hines College of Architecture and Design  > Interior Architecture, B.S. The program for the Bachelor of Science in Interior Architecture degree is a four-year program focusing on the design of architectural interiors with particular focus on sustainability, materiality, color theory, lighting, and the social and cultural aspects of habitable space. The program offers 132 semester hours and includes 77 semester hours of interior architecture and architecture courses, 38 of which are advanced hours (3000-level or higher). The degree includes the university’s required core curriculum and 7 semester hours of elective courses. Because of the mutual and overlapping bonds of architecture, industrial design and interior architecture, the programs share a common first semester curriculum, and Interior Architecture and Architecture share studios through the Foundation sequence.Interior Architecture Elective Credit Hours: 3.0The Bachelor of Architecture requires a successful review of work after the 3rd semester and the 6th semester for advancement in the degree.The Bachelor of Science in Environmental Design requires a successful review of work after the 3rd semester for advancement in the degree.The Bachelor of Science in Industrial Design requires a successful review of work after the 4th semester for advancement in the degree.The Bachelor of Science in Interior Architecture requires a successful review of work after the 3rd semester for advancement in the degree.College Website URL for Degree Informationhttp:\/\/www.uh.edu\/architecture\/programs\/undergraduate-programs\/interior-architecture\/Faculty ContactAlan Bruton, Associate Professor \nDirector, Interior Architecture Program\napbruton@uh.edu Return to: Major and Minor Fields of Study Listed Alphabetically","Journalism":"College of Liberal Arts & Social Sciences  > Jack J. Valenti School of Communication  > Journalism, B.A.Students seeking this degree will develop an understanding of the political, economic, social, and cultural contexts in which news is gathered and disseminated. They will acquire the skills needed to investigate effectively the world of news and to report these findings accurately, clearly, completely, and in the public interest. They will graduate with the knowledge of the critical, analytical, and ethical perspectives necessary to succeed in entry-level jobs and in lifelong careers.Students in good academic standing may declare a degree program in the Jack J. Valenti School of Communication at any time. Students interested in the school but uncertain about a degree program may declare themselves Communication Unspecified (COMM-UN) up to completion of 30 hours. Then they must choose a degree program.To declare a major in the Jack J. Valenti School of Communication a student must have a cumulative GPA of at least 2.25 or higher on minimum of 12 semester hours at UH.A transfer student or UH non-communication student with 15-60 semester hours of college credit who wants to declare a degree program in the Jack J. Valenti School of Communication must have a 2.25 or higher cumulative grade point average, including any attempted transfer courses.Applicants who have completed more than 60 semester hours of college credit need a 2.25 or higher cumulative grade point average on the last 60 hours.Transfer students who have earned fewer than 15 semester hours of college credit must meet freshman admission requirements.To graduate with a Bachelor of Arts in any Valenti School degree program: And one of the following capstone courses: Return to: Major and Minor Fields of Study Listed Alphabetically","Liberal Studies":"College of Liberal Arts & Social Sciences  > Department of Comparative Cultural Studies  > Liberal Studies, B.S.Program Coordinator: Luca Oliva (loliva@uh.edu)The Bachelor of Science with a Major in Liberal Studies offers an interdisciplinary liberal arts program that matches a variety of educational and professional aims of students.In addition to the two required ILAS courses, students have to declare two of the three minors in CLASS. One of these three Minors can be selected from all eligible programs of UH colleges, including those that are outside of CLASS. The selection of such a Minor has no restriction and will count towards the Liberal Studies major.As for the choice of the three minors, students must follow three mandatory rules.These rules will be enforced by locking registration if non-compliant and placing a hold on the student account.Students must complete all requirements for three separate Minors. Courses taken for one Minor cannot be used to satisfy requirements in either of the other two Minors.Students must complete all other Core , College , and University requirements  for the Bachelor of Science degree .Since the program is interdisciplinary in nature, students majoring in Liberal Studies will not have to fulfill the College requirement for an additional 9 hours across three fields outside of their Major. “Legacy students,” already enrolled as Liberal Studies majors, will be offered the option of switching to the new rules with a change of degree plan. Return to: Major and Minor Fields of Study Listed Alphabetically","Management Information Systems":"C.T. Bauer College of Business  > Department of Decision and Information Sciences  > Management Information Systems, B.B.A.The demand for MIS skills has seen a tremendous resurgence in the past few years. Forecasts are extremely strong with MIS skill sets dominating the top job roles expected to grow in the future. While the MIS careers are expected to expand at an accelerated rate, the mix of skill requirements has changed considerably. With the explosive growth of technology accompanying the usage of the Internet in the late 1990s, the role of application development (programming) dominated the MIS field. Since then, outsourcing has moved many of the low level programming jobs overseas. However, the increased need for higher level technology jobs has become prevalent. Now, the web, communication and database technologies are maturing and their usage has begun to extend throughout every area of business practices. These new information technologies are being employed in expansive and creative ways. The result is that the need for MIS professionals has increased – but in a different way than decades past. MIS is now a “people skill” rather than a purely “technical skill”. Our MIS program now trains “business analysts” rather than “programmers.”The “business analyst” (or “systems analyst” or “consultant”) position has become critical in order to make information technology available to more users and solve more business problems. This requires skills in identifying user and consumer problems and translating these needs into technology solutions. The analyst provides this critical connection. This role is not subject to outsourcing because the analyst must be embedded in the organization in order to understand the business user and their needs and be able to design and implement the solution within the confines of the organization’s technology infrastructure. After the entry-level analyst role, most MIS professionals become “project managers” (or “senior consultants”) where they assume the responsibility for an entire technology project’s: planning; staffing; budgeting; implementation scheduling; training and operational maintenance. After this project management level, the MIS professional will transition into senior technology management roles that involve: technology planning and strategy; technology architectures and infrastructures; corporate wide technology staffing; and the management of various critical technology centers. Finally, at the “C” level, the Chief Information Officer (CIO) represents the pinnacle technology role within most corporate environments.  Advanced MIS Electives - Complete 6.0 credit hours from the following: Additional Elective Hours Required:* The 9 hours of General Electives are designated for 6 hours of any unused Component Area Option (090) courses and 3 hours of an unused Social\/Behavioral Science (040) course. Remaining hours can be met by any 1000-4000 level course.Undergraduate business majors in the accelerated pathway B.B.A.\/M.S. degree program who complete graduate courses as an undergraduate may count them toward the requirements for the B.B.A. regardless of admission to a M.S. business program toward major or minor requirements for courses with the same letter rubrics as their major or minor, or toward elective requirements of their major.In order to earn a Bachelor of Business Administration (B.B.A.) degree, students must complete credit hour requirements:along with noncredit requirements:Students seeking the Bachelor of Business Administration degree must complete freshman-sophomore core and Business Administration and Management Field of Study requirements, upper-level business core and required courses, major requirements, and clear the business writing evaluation (BWE).The total hours required for a Bachelor of Business Administration degree are summarized below. Students in the Bauer Business Honors Program have additional requirements as specified under the description of the Bauer Business Honors Program.Students pursuing the Global Energy Management Professional Program (GEM-PP) track in Finance have specialized degree requirements listed under the GEM-PP track for a major in finance. Other specialty programs, such as the Professional Program in Accounting, the Entrepreneurship Program, and the Program for Excellence in Selling, may have additional admission and program requirements as specified by the program.B.B.A. requirements also listed as approved UH core courses may fulfill both requirements, but students must have a minimum of 120 credit hours to earn the B.B.A.Specific course requirements in each category are discussed in the following sections. ECON 2301 and ECON 2302 may count for Core Social and Behavioral Science requirement and Field of Study (students without either ECON 2301 or ECON 2302 and substituting Intermediate ECON would be required to take a Social and Behavioral Science course in place of a General Elective Requirement.6 Credit Hours24 Credit HoursCourses require completion with a grade of “C” or higher in all Business Administration and Management Field of Study courses unless a transfer student has completed the Business Administration and Management Field of Study at another Texas public institution. ^ Consult the catalog for additional requirements if pursuing the Global Energy Management Professional Program.24 Credit HoursComplete both:Complete both:21 Credit HoursThis section is required for all business majors. 4000-level requirement (requires a degree plan on file): Return to: Major and Minor Fields of Study Listed Alphabetically","Management":"C.T. Bauer College of Business  > Department of Management and Leadership  > Management, B.B.A. - Human Resource Management TrackThe Human Resource Management Track in Management reflects a defined and coherent set of courses that include knowledge and skill development for students who aspire to be managers or work in Human Resource Management departments in today’s rapidly changing environment. This knowledge and skill will help students improve their sets of competencies for a highly competitive job market in the real world of business. Management majors interested in course work related to human resource management may pursue a Human Resource Management track by meeting the following requirements within the Management major.Management majors interested in coursework related to human resource management may pursue a Human Resource Management Track by meeting the following requirements within the management major: Required Courses (15 credit hours) Select 6 credit hours from the following:Additional Elective Hours Required:*The 9 hours of General Electives are designated for 6 hours of any unused Component Area Option (090) courses and 3 hours of an unused Social\/Behavioral Science (040) course. Remaining hours can be met by any 1000-4000 level course.Undergraduate business majors in the accelerated pathway B.B.A.\/M.S. degree program who complete graduate courses as an undergraduate may count them toward the requirements for the B.B.A. regardless of admission to a M.S. business program toward major or minor requirements for courses with the same letter rubrics as their major or minor, or toward elective requirements of their major.In order to earn a Bachelor of Business Administration (B.B.A.) degree, students must complete credit hour requirements:along with noncredit requirements:Students seeking the Bachelor of Business Administration degree must complete freshman-sophomore core and Business Administration and Management Field of Study requirements, upper-level business core and required courses, major requirements, and clear the business writing evaluation (BWE).The total hours required for a Bachelor of Business Administration degree are summarized below. Students in the Bauer Business Honors Program have additional requirements as specified under the description of the Bauer Business Honors Program.Students pursuing the Global Energy Management Professional Program (GEM-PP) track in Finance have specialized degree requirements listed under the GEM-PP track for a major in finance. Other specialty programs, such as the Professional Program in Accounting, the Entrepreneurship Program, and the Program for Excellence in Selling, may have additional admission and program requirements as specified by the program.B.B.A. requirements also listed as approved UH core courses may fulfill both requirements, but students must have a minimum of 120 credit hours to earn the B.B.A.Specific course requirements in each category are discussed in the following sections. ECON 2301 and ECON 2302 may count for Core Social and Behavioral Science requirement and Field of Study (students without either ECON 2301 or ECON 2302 and substituting Intermediate ECON would be required to take a Social and Behavioral Science course in place of a General Elective Requirement.6 Credit Hours24 Credit HoursCourses require completion with a grade of “C” or higher in all Business Administration and Management Field of Study courses unless a transfer student has completed the Business Administration and Management Field of Study at another Texas public institution. ^ Consult the catalog for additional requirements if pursuing the Global Energy Management Professional Program.24 Credit HoursComplete both:Complete both:21 Credit HoursThis section is required for all business majors. 4000-level requirement (requires a degree plan on file): Return to: Major and Minor Fields of Study Listed Alphabetically","Marketing":"C.T. Bauer College of Business  > Department of Marketing and Entrepreneurship  > Marketing, B.B.A.Courses in marketing (MARK) focus on various topics in the marketing of goods and services. Topics include how to conduct market research, how to understand buyer behavior, how to formulate marketing strategies, how to sell, how to manage selling operations, how to use databases to manage customer relationships, how to manage marketing communications programs, and how to conduct and manage digital marketing programs.A marketing major is appropriate for students who plan careers in selling, sales management, digital marketing, retailing, or marketing staff functions such as marketing communications, market research, and general marketing management.See also the Marketing B.B.A specialty track: Marketing with a Certificate in Professional Selling  * Consult the Marketing advisor for approved substitutions for MARK electives in other non-business departments.* The 9 hours of General Electives are designated for 6 hours of any unused Component Area Option (090) courses and 3 hours of an unused Social\/Behavioral Science (040) course. Remaining hours can be met by any 1000-4000 level course.Undergraduate business majors in the accelerated pathway B.B.A.\/M.S. degree program who complete graduate courses as an undergraduate may count them toward the requirements for the B.B.A. regardless of admission to a M.S. business program toward major or minor requirements for courses with the same letter rubrics as their major or minor, or toward elective requirements of their major.In order to earn a Bachelor of Business Administration (B.B.A.) degree, students must complete credit hour requirements:along with noncredit requirements:Students seeking the Bachelor of Business Administration degree must complete freshman-sophomore core and Business Administration and Management Field of Study requirements, upper-level business core and required courses, major requirements, and clear the business writing evaluation (BWE).The total hours required for a Bachelor of Business Administration degree are summarized below. Students in the Bauer Business Honors Program have additional requirements as specified under the description of the Bauer Business Honors Program.Students pursuing the Global Energy Management Professional Program (GEM-PP) track in Finance have specialized degree requirements listed under the GEM-PP track for a major in finance. Other specialty programs, such as the Professional Program in Accounting, the Entrepreneurship Program, and the Program for Excellence in Selling, may have additional admission and program requirements as specified by the program.B.B.A. requirements also listed as approved UH core courses may fulfill both requirements, but students must have a minimum of 120 credit hours to earn the B.B.A.Specific course requirements in each category are discussed in the following sections. ECON 2301 and ECON 2302 may count for Core Social and Behavioral Science requirement and Field of Study (students without either ECON 2301 or ECON 2302 and substituting Intermediate ECON would be required to take a Social and Behavioral Science course in place of a General Elective Requirement.6 Credit Hours24 Credit HoursCourses require completion with a grade of “C” or higher in all Business Administration and Management Field of Study courses unless a transfer student has completed the Business Administration and Management Field of Study at another Texas public institution. ^ Consult the catalog for additional requirements if pursuing the Global Energy Management Professional Program.24 Credit HoursComplete both:Complete both:21 Credit HoursThis section is required for all business majors. 4000-level requirement (requires a degree plan on file): Return to: Major and Minor Fields of Study Listed Alphabetically","Mathematical Biology":"College of Natural Sciences and Mathematics  > Mathematical Biology, BSThe Bachelor of Science in Mathematical Biology is an interdisciplinary degree program jointly administered by the College of Natural Sciences and Mathematics, the Department of Biology, and the Department of Mathematics at the University of Houston. In addition to general university and college requirements, the degree calls for 26 hours of biology\/biochemistry, 27 hours of mathematics, 21 hours of chemistry and physics, and 6 hours of interdisciplinary biology\/mathematics courses. Detailed requirements of the program are given in the College of Natural Sciences and Mathematics  section of this catalog.The general requirements, including university core curriculum and college requirements, shall apply. By virtue of the interdisciplinary nature of the program, students who complete the requirements for the B.S. degree in Mathematical Biology have satisfied the capstone requirement of the College of Natural Science and Mathematics. Academic advising for students pursuing the Bachelor of Science in Mathematical Biology is provided by the Office of the Dean.Students who choose to major in Mathematical Biology must complete the following requirements in addition to the special requirements for the Bachelor of Science degree:and Return to: Major and Minor Fields of Study Listed Alphabetically","Mathematics":"College of Natural Sciences and Mathematics  > Department of Mathematics  > Mathematics, B.S. - teachHoustonStudents who choose this option must complete the following requirements in addition to the special requirements for the Bachelor of Science or the Bachelor of Arts degree: andandand  Return to: Major and Minor Fields of Study Listed Alphabetically","Mechanical Engineering Technology":"Engineering - Technology Division  > Department of Engineering Technology  > Mechanical Engineering Technology, B.S.Reflecting the broad area represented by the Mechanical Engineering Technology field, the program provides students with a solid foundation in basic engineering technology principles while allowing them to pursue cutting edge topics via senior-level electives. This program includes courses that are directed at computer-aided design, computer-aided manufacturing, and materials selection and management. The majority of the courses incorporate labs, focused on applied mechanical design concepts.The goal of the Mechanical Engineering Technology major is to provide students with a well-rounded fundamental and application-oriented education focused on the knowledge of existing and new developments in Mechanical Engineering Technology. Graduates of the baccalaureate degree will develop the theoretical and practical knowledge and skills necessary for appropriate careers in local and national industries. To achieve this mission, the Mechanical Engineering Technology program is committed to attaining the following goals for all students:The programs are designed to satisfy the educational needs of the urban Houston community by providing a climate that fosters self-awareness, personal growth, and a desire for lifelong learning.Students in Mechanical Engineering Technology are encouraged to pursue the option to teach through the teachHOUSTON program at http:\/\/www.uh.edu\/nsm\/teachhouston\/students\/stem-acp\/.Students pursuing a major in Mechanical Engineering Technology must complete the following requirements, in addition to university core and general college requirements. (student may apply previous credit for ENGI 2304 Technical Communications) Majors in Mechanical Engineering Technology may use no grade below C- in MECT courses to satisfy major degree requirements. Return to: Major and Minor Fields of Study Listed Alphabetically","Mechanical Engineering":"Cullen College of Engineering  > Department of Mechanical Engineering  > Mechanical Engineering, B.S.M.E.Mechanical Engineering majors are required to follow all requirements and regulations outlined in the Academic Information - Cullen College of Engineering  section of the Undergraduate Catalog.Mechanical engineering majors must earn a grade of C- or better in all engineering, mathematics, and science courses, including transfer courses. No grade lower than C- will be accepted for other courses transferred to the University of Houston. When petitioning for transfer credit for Mechanical Engineering courses, students are expected to submit details of course syllabi plus their graded assignments and exams from the courses taken at the external institution.Students with senior standing in Mechanical Engineering are required to take four technical electives. The elective requirements can be satisfied by one of the following options:Students in the Fast Track Program can substitute 6000-level MECE courses for the 5000-level MECE courses. Students doing an Honors thesis would have to take an extra three hours to satisfy the requirements for a Math Minor. One MECE 4398  course (Individual Study) can be used in place of a 5000-level MECE course.A drafting requirement (for no credit toward graduation) may be satisfied by completing ENGR 1304  or an equivalent approved by the program director. (This requirement may be met using other courses, or high school drafting completed in the tenth, eleventh, or twelfth grade, or industrial experience by filing a petition in the department.)The major grade point average for mechanical engineering majors is calculated using all attempts in the following courses taken in residence at the University of Houston: all MECE courses, ENGR 2301 -  Mechanics I (Statics) , and ENGI 1331 -  Computing and Problem Solving for Engineers . See “4 ”.  Return to: Major and Minor Fields of Study Listed Alphabetically","Media Production":"Colleges  > College of Liberal Arts & Social Sciences  > Jack J. Valenti School of Communication  > Media Production, B.A.Students will acquire the ability to create communications using audio, video, motion picture, photography and computer graphics techniques. An appreciation and ethical concern for the professional values and effects on an audience of utilizing such techniques will accompany both practical and theoretical instruction. Skills needed to perform the research and writing functions that precede actual production of media programs as well as performance studies are included.This degree program provides the preparation for internships and entry-level positions available in a wide variety of careers that require media production knowledge and skills, and the foundation for advancement in those fields.To successfully complete the Media Production, BA degree, students will have a choice of four concentrations within the degree program: General Media Production, Broadcast Television, Sports Production or Digital Cinematography.Students in good academic standing who meet the requirements below may declare a degree program in the Jack J. Valenti School of Communication. Students interested in the school but uncertain about a degree program may declare themselves Communication Unspecified (COMM-UN) up to completion of 30 hours. Then they must choose a degree program.To declare a major in the Jack J. Valenti School of Communication a student must have a cumulative GPA of at least 2.25 or higher on minimum of 12 semester hours at UH.A transfer student or UH non-communication student with 15-60 semester hours of college credit who wants to declare a degree program in the Jack J. Valenti School of Communication must have a 2.25 or higher cumulative grade point average, including any attempted transfer courses.Applicants who have completed more than 60 semester hours of college credit need a 2.25 or higher cumulative grade point average on the last 60 hours.Transfer students who have earned fewer than 15 semester hours of college credit must meet freshman admission requirements.Students must achieve a 2.00 cumulative GPA in all courses that count toward the major with at least a C in each.No COMM course for major (or minor) may be taken more than three times.   Students will choose one of the following concentrations for the additional 21 hours required for the degree: Return to: Major and Minor Fields of Study Listed Alphabetically","Mexican American and Latino\/a Studies":"Colleges  > College of Liberal Arts & Social Sciences  > Mexican American Studies  > Mexican American and Latino\/a Studies, B.A.The B.A. in Mexican American and Latino\/a Studies is a multi and interdisciplinary degree program focusing on the experience and contributions of Latinos, Latinas, and Latinx in the United States. The Major will also offer specialization tracks in enterprise applications, quantitative methods and public policy, and Latino\/a cultural studies to better prepare students for their successful incorporation into the labor market or graduate and professional school.Students majoring in Mexican American and Latino\/a Studies must complete all university and college requirements for the Bachelor of Arts Degree . A major in Mexican American and Latino\/a Studies consists of thirty semester hours and requires a minimum of 18 semester hours in the major and 12 semester credit hours in an appropriate concentration track.Students are strongly encouraged to talk to a MAS advisor to talk about their career interests and before choosing a concentration track.The concentration track in enterprise applications is designed for students wishing to pursue a career in the business world and take advantage of the opportunities offered by the region’s multicultural economy. This track will also allow majors to apply for the Corporate Entrepreneurship Certificate, Social Entrepreneurship Certificate, or pursue a minor in Business Administration or Management and Leadership for non-business majors after fulfilling C.T. Bauer College of Business requirements.Students are strongly encouraged to contact an advisor both at C.T. Bauer College of Business and MAS.Students majoring in Mexican American and Latino\/a Studies must complete all university and college requirements for the Bachelor of Arts Degree . In addition to the university and college requirements for the Bachelor of Arts degree, majors seeking a concentration track in enterprise applications will have to take thirty semester hours to include:It is strongly encouraged that majors contact MAS advisor to review coursesCheck requirements from non-business majors at C.T. Bauer College of BusinessEligible courses to apply for the Corporate Entrepreneurship Certificate (Student must receive a C- or better to apply)Eligible courses to apply for the Social Entrepreneurship Certificate (Student must receive a C- or better to apply)Eligible courses that count towards the Business Administration Minor. Students must satisfy Bauer requirementsEligible courses that count towards the Management and Leadership Minor. Students must satisfy Bauer requirementsThe concentration track in quantitative methods and public policy is designed for students wishing to pursue a career in government or non-profits with a focus on data analysis and public policy.Students are strongly encouraged to contact a MAS advisor before choosing a concentration track.Students majoring in Mexican American and Latino\/a Studies must complete all university and college requirements for the Bachelor of Arts Degree . In addition to the university and college requirements for the Bachelor of Arts degree, majors seeking a concentration track in enterprise applications will have to take thirty semester hours to include:The concentration track in Latino\/a cultural studies is designed for students wishing to pursue a career in teaching, communications, or graduate school, particularly in graduate programs in History, Spanish, Sociology, or Mexican American or Ethnic Studies.  Students are strongly encouraged to contact a MAS advisor before choosing a concentration track.Students majoring in Mexican American and Latino\/a Studies must complete all university and college requirements for the Bachelor of Arts Degree . In addition to the university and college requirements for the Bachelor of Arts degree, majors seeking a concentration track in enterprise applications will have to take thirty semester hours to include:It is strongly encouraged that majors contact MAS advisor to review courses(Recommended for the Enterprise Applications Track) Return to: Major and Minor Fields of Study Listed Alphabetically","Music (Areas of Elective Studies)":"Kathrine G. McGovern College of the Arts  > Moores School of Music  > Music (Areas of Elective Studies), B.M.In addition to the common courses for all elective studies areas, each student seeking this degree must fulfill the requirements for one of the four elective studies areas listed below. At least 36 total hours need to be at the advanced level. See the music advisor for more details.Four hours at the freshman, sophomore, and junior levels; and two hours at the senior level including senior recital    Students must meet specific benchmarks to seek teacher certification from the College of Education . See the Coordinator of Music Education for more details.Students must meet specific benchmarks to seek teacher certification from the College of Education . See the Coordinator of Music Education for more details.Large ensemble for woodwind, brass, and percussion students must include at least two semesters of marching band. (Strings students are exempt.)Six one-hour credits, from the following course list: Return to: Major and Minor Fields of Study Listed Alphabetically","Music Composition":"Kathrine G. McGovern College of the Arts  > Moores School of Music  > Music Composition, B.M.In addition to all university and college requirements, students must complete all requirements for the B.M. degree as outlined below.Note: A condition for admission to this program is a 3.00-grade point average in the following courses: Students may be admitted to the program after completing the sophomore music theory courses. A 3.25-grade point average must be maintained in all music theory courses for graduation.Four hours at the sophomore level; eight hours at the junior level; and eight hours at the senior levelFour hours at the freshman level, four hours at the sophomore level, four hours at the junior level   Return to: Major and Minor Fields of Study Listed Alphabetically","Music Theory":"Kathrine G. McGovern College of the Arts  > Moores School of Music  > Music Theory, B.M.In addition to all university and college requirements, students must complete all requirements for the B.M. degree as outlined below.Note: A condition for admission to this program is a 3.00 grade point average in the following courses: MUSI 1311 , MUSI 1312 , MUSI 1116 , MUSI 2210 , MUSI 2116 , and MUSI 2117 . Students may be admitted to the program after completing the sophomore music theory courses. A 3.25 grade point average must be maintained in all music theory courses for graduation.Four hours at the freshman level, four hours at the sophomore level, four hours at the junior level   Return to: Major and Minor Fields of Study Listed Alphabetically","Music":"Kathrine G. McGovern College of the Arts  > Moores School of Music  > Music, B.A.The Bachelor of Arts degree in music is offered to students wishing to pursue a program that places great emphasis on the liberal arts, but with a strong concentration in the field of music. In addition to the college requirements for the Bachelor of Arts, a minimum of 50 credit hours in music is required.College courses outside of the major requirements, core, and langauge requirementsIn addition to all university and college requirements, students must complete the following: Return to: Major and Minor Fields of Study Listed Alphabetically","Nursing":"Colleges  > College of Nursing  > Nursing, B.S.N. (Traditional)The Traditional BSN track is designed for the University of Houston College of Nursing (CON) Pre-Nursing student who wants to pursue a Nursing major beginning the junior year. Pre-Nursing students are eligible to apply to the CON Traditional BSN track once they have completed or are enrolled to complete 60 semester credit hours (SCH) of the recommended course pathway for Nursing, of which 45 SCH must be in residence at UH. Students may be accepted conditionally, pending completion of UH core requirements*, all nursing program pre-requisites, a criminal background and a drug screen clearance. Students who entered UH as freshmen and have met the application criteria but are not Pre-Nursing students may be considered for admission into the Traditional BSN track by exception.*Core Requirement IX(b) Writing in the Discipline may be satisfied by NURS 4312 .Applicants must complete the UH College of Nursing Application to Change Course of Study to Nursing Major. Admission applications are reviewed and decided upon by the College of Nursing Admission Committee. Admission to the CON Traditional BSN Track is not guaranteed and is highly competitive. The holistic admission process is based upon many factors which include, but are not limited to:Applicants to the Traditional BSN Track must pass the college-approved pre-admission test.  The UH College of Nursing is only accepting Test of Essential Academic Skills (TEAS VI) as the college approved pre-admission test.Applicants to the Traditional BSN Track must complete a release of social security number form submitted to the UH College of Nursing office or faxed to 713-743-1164.Applicants must satisfy the UH College of Nursing clinical readiness requirements. (See: Policy S101 Student Clinical Requirements Part One)Application Deadline: April 1 for Fall Semester AdmissionsAdmission to the Traditional BSN Track is a highly competitive process. To be considered for admission, the following minimum requirements must be met:Students not admitted to the CON Traditional BSN track will be advised to an alternate major at the University of Houston. Applicants not admitted may reapply by the deadline date for the next term. Applications are not carried forward to the next deadline date and there are no waiting lists.Applicants must satisfy all UH Core Curriculum 2023-2024   for a second undergraduate degree in addition to the Traditional BSN Track requirements below:6 semester hours of Psychology:3 credit hours of Sociology:60 credit hours of Nursing core:Nursing Elective (complete 2.0 credit hours from the following) Return to: Major and Minor Fields of Study Listed Alphabetically","Performance":"Kathrine G. McGovern College of the Arts  > Moores School of Music  > Performance, B.M.Private study is offered in the areas listed below.Music majors generally pursue instruction in only one performance area. Occasionally, requests for concurrent study in a secondary area are approved. Nonmajors are encouraged to seek private instruction through the School’s Preparatory and Continuing Studies Program but, with approval of the School’s director, are allowed to enroll in private lessons for credit.During regular semesters, students enrolled (registered) in two credit hours receive one half-hour lesson and attend studio class each week. Students enrolled (registered) in three or four semester credit hours receive a one-hour lesson and attend studio class each week.Applied music credit is offered at all levels from freshman through graduate; the level is determined by audition for new students and by recommendation of the appropriate faculty for continuing students.Concurrent enrollment in an appropriate large ensemble, even beyond degree requirements, is required of all students taking applied music courses. All of these areas are accredited by the National Association of Schools of Music.Complete 28 credit hours in the applied music lessons course: Select one conducting course from the following: The concentration in Piano Performance (Pedagogy Emphasis) provides Piano Performance majors the option to gain comprehensive teacher training in addition to their performance study. Select one conducting course from the following: Six hours at the freshman level; six hours at the sophomore level; eight hours at the junior level (including junior recital); and eight hours at the senior levelSix hours at the freshman level; six hours at the sophomore level; eight hours at the junior level (including junior recital); and eight hours at the senior level*Students in winds and brass will use chamber music to satisfy the  elective requirement. Students in strings and percussion will use  orchestra repertoire to satisfy the elective requirement. Percussion  majors will take two semesters of percussion ensemble (in lieu of  chamber music) and two semesters (one credit hour each) of Applied Jazz  Percussion-MUSA 1176). Double-bass majors have the option of taking up  to two semesters of jazz bass lessons (in lieu of chamber music) pending  the approval of the instructor.Six hours at the freshman level; six hours at the sophomore level; eight hours at the junior level (including junior recital); and eight hours at the senior level    The emphasis in Jazz Performance provides specialized training in the jazz genre for musicians who qualify on any of the following instruments: saxophone, trumpet, trombone, guitar, bass, percussion\/drums, and piano\/keyboards. Jazz History, two of the following three courses (Credit Hours: 6.0): * those in the piano\/keyboard track or who test out of Group Piano will take an advanced Jazz elective or special topics elective to make up the credit deficit Return to: Major and Minor Fields of Study Listed Alphabetically","Petroleum Engineering":"Cullen College of Engineering  > Department of Petroleum Engineering  > Petroleum Engineering, B.S.P.E.T.E.The major grade point average for petroleum engineering majors is calculated using all PETR courses plus all Engineering Computing XXXX 1331 courses. Return to: Major and Minor Fields of Study Listed Alphabetically","Philosophy":"College of Liberal Arts & Social Sciences  > Department of Philosophy  > Philosophy, B.A.Philosophy majors must complete 27 semester hours in philosophy, at least 18 of which must be advanced (3000 level or above). A minimum of 15 semester hours must be done in residence, and at least 12 of those must be advanced. A 2.00 minimum GPA is required on all major courses attempted at the University of Houston. Majors must also meet the general requirements for a Bachelor of Arts  degree at the University of Houston.Note: Not all courses are offered every semester. The same course cannot satisfy two departmental requirements.Basic Background (must take both)(must choose one)(must choose one)(must choose one)(must choose four further classes, at least three of which must be advanced) Return to: Major and Minor Fields of Study Listed Alphabetically","Physics":"College of Natural Sciences and Mathematics  > Department of Physics  > Physics, B.S.Students who choose to major in physics must complete the following requirements in addition to the special requirements for the Bachelor of Science degree:or or  Return to: Major and Minor Fields of Study Listed Alphabetically","Political Science":"College of Liberal Arts & Social Sciences  > Department of Political Science  > Political Science, B.S.The political science program focuses on the study of theories of government, government processes and institutions, and political forces that contribute to the formation evolution, and operation of government in the United States and around the world.All political science majors take introductory courses on United States’ politics, comparative politics, political theory, and international relations. Majors are then given the flexibility to choose from a variety of advanced courses, allowing students to customize a path of study that either continues to span several of these fields or provides specialization in one of these areas.The political science major helps develop informed and active citizens, but it is also good for future employment. It has proven useful for those who plan careers in secondary and higher education, the legal profession, government, urban planning, journalism, or any other field that requires critical thinking and analysis. Political science continues to provide an excellent background for those who wish to pursue advanced studies in business, law, or public administration. With faculty who excel both as teachers and researchers, the Department of Political Science has a strong tradition of excellence in undergraduate and graduate education.Students who choose to major in Political Science must also meet the university core requirements and the college core requirements for a CLASS Bachelor of Arts or Bachelor of Science degree.Students must earn a minimum 2.00 grade point average in all courses in the major (required or elective) attempted at this university. Students must complete 30 hours of political science courses, at least 24 hours in advanced courses.Students are strongly encouraged to take one course in comparative politics and one international relations. Return to: Major and Minor Fields of Study Listed Alphabetically","Psychology":"College of Liberal Arts & Social Sciences  > Department of Psychology  > Psychology, B.S.All new students who wish to major in psychology, and all current students who wish to switch to the Department of Psychology major will need to meet with an advisor in the Academic Affairs Office of the Department of Psychology (124 Heyne Building, 713-743-8508).Each major must choose 15 hours of advanced psychology electives. In planning one’s program, a student should note that some courses may be offered only annually or biennially. Majors are free to choose electives from one or several areas. Students should note that areas move from intermediate to advanced levels in the courses listed. Those majors planning to attend graduate or professional schools are strongly advised to participate in at least one Capstone experience in their senior year.Capstone experiences are intended as integrative, intensive exercises in critical thinking and analysis of content. These are opportunities for student-focused initiative, creativity and productivity under the close mentorship of Department of Psychology faculty.For additional information, contact the department:University of Houston\nDepartment of Psychology\nAcademic Affairs\n124 Heyne Building\nHouston, Texas 77204-5022 Return to: Major and Minor Fields of Study Listed Alphabetically","Public Policy":"Hobby School of Public Affairs  > Public Policy, B.S.The Bachelor of Science in Public Policy is multidisciplinary and interdisciplinary in its curriculum and will build upon the expertise found within the University of Houston’s research clusters and the Hobby School of Public Affairs. The courses in this degree will allow students to acquire the techniques necessary for understanding and shaping public policies through empirical methods, ethical analysis, cost-benefit analysis, organizational behavior and leadership, problem-solving, and economic forecasting.Students whose UH enrollment has paused for 13 months or longer must apply for readmission as a former student.  Regardless of academic standing, students are required to meet program-specific re-entry requirements and deadlines. Please visit the University Admissions website for additional information: UH Undergraduate Admissions - Readmission for Former UH Students A total of 12 hours in the quantitative or formal sciences is required for the BS degree . At least 6 credit hours must be in mathematics.In addition to the major requirements, students majoring in Public Policy must fulfill the requirements for one of the following options: double major; minor; certification (e.g., teacher or data analytics certificate); dual degree; or personalized track of upper division courses as approved by advisor.Students must take the following five courses:Students should choose two of the following courses:Students should choose one of the following courses:orStudents should choose two courses from one of the following concentrations:*To be eligible for an internship, students must have completed at least 60 hours of undergraduate courses, including at least 9 hours of Public Policy coursework, and have an overall GPA of 2.7. Students who do not meet these requirements may apply to the undergraduate advisor for a waiver.Honors in the Major: In order to earn honors in the major, students must have an overall GPA, as well as GPA in the major at the time of graduation, of at least 3.3 and complete both the public policy internship and senior thesis, and receive a B or better in both.Number of hours remaining to bring the total number of hours to 120 and total advanced hours (3000-4000 level) to 36.A minimum of 120 hours (including 36 advanced hours) must be completed for the degree. No more than 66 semester hours of lower division transfer hours may be applied toward a bachelor’s degree. The last 30 semester hours to be applied toward a bachelor’s degree must be completed, uninterrupted, at the University of Houston. Return to: Major and Minor Fields of Study Listed Alphabetically","Religious Studies":"College of Liberal Arts & Social Sciences  > Department of Comparative Cultural Studies  > Religious Studies, B.A.The Bachelor of Arts in Religious Studies provides students with a well-rounded understanding of major religious traditions and practices while also offering specialization in particular religions, regions, and\/or theoretical approaches to the study of religion in historical, global, and comparative contexts.In addition to fulfilling College and University requirements for the Bachelor of Arts degree, students declaring the Bachelor of Arts (major) in Religious Studies must:Note: no course taken to fulfill the major may be applied towards a student’s minor. The 30 required Credit Hours are to include: Return to: Major and Minor Fields of Study Listed Alphabetically","Retailing and Consumer Science":"Engineering - Technology Division  > Department of Human Development and Consumer Sciences  > Retailing and Consumer Science, B.S.Retailing and Consumer Science is designed to develop professionals who can research, improve and better understand global retailing, consumer products, and customer experience through a lens of innovation.  Graduates from our program are able to apply these concepts to individual consumers, families, service agencies, corporations, and retail marketers of products and services. Retailing and Consumer Science focuses on analyzing the consumer as a social and economic unit of society and on the process of merchandising products to consumers.  Coursework integrates consumer behavior with retailing, business, and technology courses to prepare students for emerging careers.Professional development in this program includes trend analysis, selling, merchandising experience, internship, self-assessment, professional goal setting, understanding owning and operating a small business, networking and portfolio development. Processes of retail marketing and consumer affairs are emphasized.Graduates will:Students pursuing the Retailing and Consumer Science degree must complete the following requirements in addition to the university core requirements and general college requirements.ORORChoose one (1) 15 hour specialization or elective block from those listed below (15 SH) Students are encouraged to pursue a minor in eTailing, Fashion Merchandising or Technology Entrepreneurship.Approved non-RCS content course work (15 semester hours)See academic advisor for approval of a 15 hour content block in field other than Retailing and Consumer ScienceMajor GPA will be calculated based on major requirements and professional studies area or minor.Electives or minor must be from approved technical area for students pursuing Technology Entrepreneurship specialization. Return to: Major and Minor Fields of Study Listed Alphabetically","Sociology":"College of Liberal Arts & Social Sciences  > Department of Sociology  > Sociology, B.S.Any incoming freshman, college transfer student, international student, or current UH student with an overall GPA of 2.00 interested in majoring in Sociology must apply first as a Sociology pre-major.After completion of SOCI 1301  and SOC 3300  or SOC 3400  with a minimum grade of C in each course, a student may petition the Department of Sociology to declare a major in Sociology. Students must earn a minimum 2.00 grade point average in all courses in the major (required or elective) attempted at this university.Students who choose to major in Sociology must also meet the university core requirements and the college core requirements for a Liberal Arts and Social Sciences Bachelor of Arts  or Bachelor of Science  degree.34 hours (22 advanced) to include:Students may elect to complete a concentration in one of the following areas:Students who elect to pursue a concentration must declare this at any time during matriculation, but after they have become a SOC major (they cannot be in Pre-SOC standing) and before the semester they anticipate to graduate. However, they are encouraged to declare this early on in their academic careers.Students who complete all requirements of the concentration will graduate with a degree in sociology with a concentration in that specific area, e.g., BS in Sociology with a concentration in Health and Medicine, Workplace Diversity, or Criminology, Law, and Deviance.To complete a concentration in Sociology, students must complete four courses from the approved list of concentration courses (see below). They must complete one required course on this list (see below).To complete a concentration in Health and Medicine, students must complete one of the required courses plus three additional courses (i.e., electives).One of the following:Plus, three additional courses:To complete a concentration in Workplace Diversity, students must complete one of the required courses plus three additional courses (i.e., electives).One of the following:Plus, three additional courses:To complete a concentration in Criminology, Law, and Deviance, students must complete one of the required courses plus three additional courses (i.e., electives).One of the following:Note: If students take both required courses for this concentration, they need to take only two additional courses (i.e.,electives) from the approved list below.Plus, three additional courses:Students should plan to complete SOC 3300  and SOC 3400  by the end of their junior year. Students should plan to complete SOC 3301  by early in their senior year.Students must complete at least 18 of the required 32 semester hours in sociology in residence at the University of Houston. Fifteen of these 18 hours must be advanced. Transferred credit to be counted toward the sociology major requirements must have a grade of C- or better.Sociology majors must have an approved minor to graduate.For additional information, write, call, or visit the Web site:713-743-3940www.sociology.uh.edu Return to: Major and Minor Fields of Study Listed Alphabetically","Spanish":"Chair: Dr. Pedro GutierrezIn addition to completing the degree requirements for the Bachelor of Arts, students majoring in Spanish must complete 27 semester hours in Spanish at the advanced level (3000-4000). Spanish majors must take a minimum 15 credit hours in residence with the Department of Hispanic Studies, not including credit by exam or learning abroad. Students may take only one course with the HISP code that would may towards a requirement for the major.The Spanish Program offers two basic language programs that satisfy the foreign language requirement and prepare students for upper-division courses in linguistics, culture, literature, business and other practical areas:A four semester sequence:This program is designed for students whose home language is not Spanish.Students with previous studies in Spanish are required to take a placement exam, at the Testing Center (Student Service Center, 2nd floor), before enrollment. Enroll (register) online at testing.las.uh.edu\/.Hispanic Studies offers a Placement\/Credit Exam designed for Spanish as a Second Language students, who are required to take this exam before enrolling in a Spanish course. Students may be placed in SPAN 1501 , SPAN 1502 , SPAN 2311 , SPAN 2312 , SPAN 3301 , SPAN 3302  or higher, and may earn up to 12 semester hours in Spanish. Credit at the 4000-level may not be earned by examination.Eligibility for credit by examination is determined by subsequent enrollment and academic performance in the class into which the student was placed. See departmental advisor for further information.Heritage language learners are students who grew up speaking Spanish at home.Hispanic Studies offers a Placement\/Credit Exam designed for Hispanic heritage learners, who are required to take this exam before enrolling in a Spanish course. Students may be placed in SPAN 1507 , SPAN 2307 , SPAN 2308 , SPAN 3307 , SPAN 3308 , or higher, and may earn up to 12 semester hours in Spanish. Credit at the 4000-level may not be earned by examination. For designated test times, see schedule online at www.uh.edu.hispanicstudies\/.For information about AP credit, see the Credit by Examination  section of this catalog.The department also offers a Master of Arts degree and a Doctor of Philosophy in Spanish. For general graduate admissions requirements and listing of courses, contact the respective graduate advisors in the Department of Hispanic Studies and consult the Graduate and Professional Studies catalog. Return to: Major and Minor Fields of Study Listed Alphabetically","Sports Administration":"College of Liberal Arts & Social Sciences  > Department of Health and Human Performance  > Sports Administration, BS Return to: Major and Minor Fields of Study Listed Alphabetically","Strategic Communication":"College of Liberal Arts & Social Sciences  > Jack J. Valenti School of Communication  > Strategic Communication, B.A.The Strategic Communication BA degree provides basic knowledge, skills and ethical considerations to prepare students for entry into the fields of advertising, integrated communication, organizational\/corporate communication and public relations. Students will learn the communication requirements to represent organizations, products, services, operations and policies effectively.Specific areas of study include theory, principles, analytical and critical skills, ethical requirements, public policy development, copywriting, media planning and placement, campaign design and execution requirements, research methodologies, data analysis techniques, and communications skills especially appropriate for strategic communication.Students in this degree program will choose from four areas of concentrated study: Advertising, Integrated Communication, Organizational\/Corporate Communication or Public Relations.Students in good academic standing who meet the requirements below may declare a degree program in the Jack J. Valenti School of Communication. Students interested in the school but uncertain about a degree program may declare themselves Communication Unspecified (COMM-UN) up to completion of 30 hours. Then they must choose a degree program.To declare a major in the Jack J. Valenti School of Communication a student must have a cumulative GPA of at least 2.25 or higher on minimum of 12 semester hours at UH.A transfer student or UH non-communication student with 15-60 semester hours of college credit who wants to declare a degree program in the Jack J. Valenti School of Communication must have a 2.25 or higher cumulative grade point average, including any attempted transfer courses.Applicants who have completed more than 60 semester hours of college credit need a 2.25 or higher cumulative grade point average on the last 60 hours.Transfer students who have earned fewer than 15 semester hours of college credit must meet freshman admission requirements.Students must achieve a 2.00 cumulative GPA in all courses that count toward the major with at least a C in each.No COMM course for major (or minor) may be taken more than three times.    Plus one of the following capstone courses:Students will choose one of the following concentrations for the additional 15 hours required for the degree:Five courses from the following:Plus 2 courses (6 hours) from the following electives:Plus 2 courses (6 hours) from the following electives:Plus 3 courses (9 hours) from the following electives: Return to: Major and Minor Fields of Study Listed Alphabetically","Supply Chain and Logistics Technology":"Engineering - Technology Division  > Department of Construction Management  > Supply Chain and Logistics Technology, B.S.Supply Chain and Logistics Technology is a technically-based STEM approved program using information technology to optimize the global flow of industrial goods and services from manufacturer to industrial user. Supply Chain and Logistics Technology focuses on the international supply chain from the source of raw material through the final consumption of the product.Because supply-chain functions are part of all business activities, skills acquired with this degree offer unlimited employment opportunities.Career options for SCLT graduates include supply-chain management with domestic and international manufacturing operations, service companies, third-party logistics providers, transportation companies, distribution centers, and other government and private businesses. Graduates are employed as industrial and transportation sales representatives; logistical analysts and consultants; operations managers; purchasing representatives; inventory control specialists; marketing directors; customer service representatives; and warehouse and distribution center managers.The Supply Chain and Logistics Technology degree consists of 120 semester hours of university undergraduate academic credit.No grade lower than C will be accepted on any courses applicable to the major. Students may petition one (1) grade of C- towards major.(student may apply previous credit for GEOG 2340)To be transferred from approved Community College programs.** Electives to be chosen from Technology Division, Engineering, or Business (other choices must be preapproved).Major GPA will be calculated based on the major requirements and the professional track. Return to: Major and Minor Fields of Study Listed Alphabetically","Supply Chain Management":"C.T. Bauer College of Business  > Department of Decision and Information Sciences  > Supply Chain Management, B.B.A.Supply Chain Management (SCM) is the collection of critical business functions that enable companies to create, produce, and deliver products and services. SCM activities include operations planning, procurement and sourcing, production of goods and services, demand fulfillment, transportation and logistics, and the various customer support and return processes (including retail returns, recycling, and reconditioning).Careers in Supply Chain Management are exciting, dynamic, flexible, and rewarding. With global supply chains becoming more complex, competition becoming more intense, and the standards for world-class business performance rapidly increasing, companies in every industry are searching for Supply Chain Management professionals, whether they are for-profit, not-for-profit, governmental, or public service. Earning a Bachelors Degree in Supply Chain Management from the C. T. Bauer College of Business will give you the competitive edge to begin an exciting career in Supply Chain Management.This program is designed to develop the knowledge, skills, and abilities needed to be successful within any role in Supply Chain Management. Our curriculum covers both the critical aspects of Supply Chain Management used by every company and the innovative methodologies and techniques that are increasingly being pursued by leading organizations.  Prerequisite: a grade of C+ or higher in SCM 3301   Select six semester hours of advanced business electives from among the following electives: Suggested elective combination selections for completion of certificate in specified area: (Note: completion of certificate not required for completion of degree). In order to earn a certificate in Supply Chain Management students must complete the following courses with an average grade of B or better: SCM 4302 -  Energy Supply Chain orFINA 4371 -  Energy Value Chain SCM 4351 -  Strategic Sourcing and Spend Analysis orMANA 4340 -  Negotiations and Conflict Management    SCM 4311 -  Project Management  or\r\n\t\t\tapproved substitute Additional Elective Hours Required:(with a grade of C or higher as a prerequisite for 4000-level course) ** The 9 hours of General Electives are designated for 6 hours of any unused Component Area Option (090) courses and 3 hours of an unused Social\/Behavioral Science (040) course. Remaining hours can be met by any 1000-4000 level course.Undergraduate business majors in the accelerated pathway B.B.A.\/M.S. degree program who complete graduate courses as an undergraduate may count them toward the requirements for the B.B.A. regardless of admission to a M.S. business program toward major or minor requirements for courses with the same letter rubrics as their major or minor, or toward elective requirements of their major.In order to earn a Bachelor of Business Administration (B.B.A.) degree, students must complete credit hour requirements:along with noncredit requirements:Students seeking the Bachelor of Business Administration degree must complete freshman-sophomore core and Business Administration and Management Field of Study requirements, upper-level business core and required courses, major requirements, and clear the business writing evaluation (BWE).The total hours required for a Bachelor of Business Administration degree are summarized below. Students in the Bauer Business Honors Program have additional requirements as specified under the description of the Bauer Business Honors Program.Students pursuing the Global Energy Management Professional Program (GEM-PP) track in Finance have specialized degree requirements listed under the GEM-PP track for a major in finance. Other specialty programs, such as the Professional Program in Accounting, the Entrepreneurship Program, and the Program for Excellence in Selling, may have additional admission and program requirements as specified by the program.B.B.A. requirements also listed as approved UH core courses may fulfill both requirements, but students must have a minimum of 120 credit hours to earn the B.B.A.Specific course requirements in each category are discussed in the following sections. ECON 2301 and ECON 2302 may count for Core Social and Behavioral Science requirement and Field of Study (students without either ECON 2301 or ECON 2302 and substituting Intermediate ECON would be required to take a Social and Behavioral Science course in place of a General Elective Requirement.6 Credit Hours24 Credit HoursCourses require completion with a grade of “C” or higher in all Business Administration and Management Field of Study courses unless a transfer student has completed the Business Administration and Management Field of Study at another Texas public institution. ^ Consult the catalog for additional requirements if pursuing the Global Energy Management Professional Program.24 Credit HoursComplete both:Complete both:21 Credit HoursThis section is required for all business majors. 4000-level requirement (requires a degree plan on file): Return to: Major and Minor Fields of Study Listed Alphabetically","Systems Engineering":"Cullen College of Engineering  > Department of Industrial Engineering  > Systems Engineering, B.S.Sys.E.The proposed program in Systems Engineering (SE) is designed to provide students with in-depth knowledge and skill sets to successfully develop and implement solutions to increasingly complex multidisciplinary engineering systems. The curriculum of this program will have a good balance between theory and hands-on experience training. Its objectives include:Students in this program will complete their degree entirely in UH at Katy campus. All courses will be taught using face-to-face mode at Katy campus, online (i.e., asynchronous or synchronous instruction methods) or hybrid mode.Systems Engineering majors are required to follow all requirements and regulations outlined in the Academic Information - Cullen College of Engineering  section of the Undergraduate Catalog.Students must earn a 2.25-grade point average (GPA) in all courses and in INDE major courses in order to enroll in 3000-level and above INDE & SYSE courses. The major GPA of 2.25 must be maintained at all times until the last semester before graduation.The Systems Engineering Major GPA is calculated using all attempts of the following courses taken in residence at the University of Houston: all SYSE courses, all INDE courses, ENGI 1331 -  Computing and Problem Solving for Engineers  and CEA 3201 -  Computer Programming for Engineers . When seeking transfer credit for engineering courses, students are expected to include detailed syllabi, as well as graded assignments and exams, with their petitions requesting course credit.Web: http:\/\/www.ie.uh.edu\/undergraduate\/overview.   Return to: Major and Minor Fields of Study Listed Alphabetically","Teaching and Learning":"College of Education  > Department of Curriculum and Instruction  > Teaching and Learning, B.S.Students seeking early childhood-6th grade and 4th-8th grade certification must complete the requirements for the Teaching and Learning major. This degree requires 120-133 semester hours. Degree outlines are available online at the Teaching and Learning webpage.The Teaching and Learning major is composed of five components:Students with a 2.5 cumulative UH GPA may declare a major in Teaching and Learning.Students must earn a 2.5 minimum cumulative grade point average and no lower than a C- on all courses attempted in the major (CUIN, EDUC, ARED, ELED, SPEC, SEDE).Students being re-admitted to the Teaching and Learning major must: Return to: Major and Minor Fields of Study Listed Alphabetically","Technology Leadership and Innovation Management":"Engineering - Technology Division  > Department of Information and Science Technology  > Technology Leadership and Innovation Management, B.S.The Technology Leadership and Innovation Management degree focuses on providing individuals with a competitive advantage when moving into leadership and project management roles in technology-based organizations. The program accredited by the prestigious Association of Technology, Management, and Applied Engineering (ATMAE) investigates the rapidly changing and complex nature of leadership in organizations that use and rely on technology.The success of today’s businesses and organizations demand leadership that is forward-thinking, informed, and focused on measurable results.  Modern leaders must be able to optimize the capabilities of knowledge-based workers and the solutions they create. The Leadership and Innovation degree develops exactly this set of skills. Students learn about leadership, the creation of organizational vision and value, and the development of human resources while leading technological change.The Technology Leadership and Innovation Management degree provides a long term, empowering approach to the practice of leading people, building successful teams, innovating products, services, and corporate processes, rather than the short term, command and control approach to utilizing human resources. Students learn about leadership, the importance of organizational vision and values, developing human resources, and managing technological resources in corporate, government, nonprofit, or community organizations. Leadership and innovation skills are applied in project management, quality management, emergency managemet, resource management, and in time management, but also in verbal and visual communication. Leadership and innovation values and abilities are developed through relevant real-world applications.The Technology Leadership and Innovation Management program consists of 120 credit hours of undergraduate academic credit. In addition to meeting the 42 credit hour university core curriculum requirement, students must complete major core courses, and directed emphasis coursework. Students must earn a 2.0 minimum GPA in all major and directed emphasis courses attempted at the university. Transfer students must have earned a 2.0 GPA or better in all major and directed emphasis courses to be transferred for credit.The major areas of coursework within the Technology Leadership and Innovation Management program are (1) analysis and reasoning, (2) organizations, (3) human resources, (4) communications, (5) integration through an original senior project, and (6) directed technology emphasis.All majors and minors in the Department of Information and Science Technology must earn a grade of C or better in all major\/minor courses. No grade lower than C will be accepted on any courses applicable to the major transferred to the University of Houston.(minimum grade of C)Students must earn a grade of C or better in all major courses.  One (1) grade of C- may be accepted towards major.Students can fulfill area of specialization with a combination of minors or approved Community college transfer block or accelerated subplan plus minor or block of coursework approved by program coordinator (primarily veterans). Students are encouraged to complete an Applied Innovation minor. Students may not declare the Leadership and Innovation minor.Major GPA will be calculated based on the major requirements and the professional studies area or minor. Return to: Major and Minor Fields of Study Listed Alphabetically","Theatre":"Kathrine G. McGovern College of the Arts  > School of Theatre & Dance  > Theatre, B.F.A.In addition to meeting all requirements for admission to the University of Houston, all students applying for acceptance as majors in the School of Theatre & Dance must pass a performance audition or portfolio review. Applicants must audition or present a portfolio for a specific degree and area of concentration and will either be accepted or not accepted by faculty consensus. Students who are accepted into a theatre or dance degree will be “placed” into the curriculum at an appropriate level based on the faculty’s assessment. Audition or portfolio may be presented live (live preferred) or submitted electronically.In addition to meeting all requirements for admission to the University of Houston, all transfer students applying for acceptance as majors in the School of Theatre & Dance must pass a performance audition or portfolio review. Applicants must audition or present a portfolio for a specific degree and area of concentration and will either be accepted or not accepted by faculty consensus. Transfer students who are accepted into a theatre or dance degree will be “placed” into the curriculum at an appropriate level based on the faculty’s assessment. Audition or portfolio may be presented live (live preferred) or submitted electronically. Students transferring from other institutions must have a 2.67 minimum grade point average in all theatre and dance courses attempted. Transfer students must consult with the School of Theatre & Dance advisor concerning THEA 1111 :THEA 1112  requirements and transfer credits.Upon acceptance into the School of Theatre & Dance, all students must maintain the following standards for continuation in the program:All students in the School of Theatre & Dance are expected to meet high standards of work and discipline. To strengthen the quality of education for those who meet and exceed these standards, those who fail to maintain these standards will not be permitted to continue in the program.Students majoring in a Bachelor of Fine Arts (BFA) in Theatre must complete the university core requirements, the COTA college requirements, and elect to follow one of these areas of concentration:Acting  Playwriting\/Dramaturgy  Production  Stage Management  Theatre Education  Consult the appropriate Area of Concentration for requirements listed below.Three semesters each of In addition to the above THEA courses, Theatre Education students must complete the following Education courses: Return to: Major and Minor Fields of Study Listed Alphabetically","Women’s, Gender & Sexuality Studies":"College of Liberal Arts & Social Sciences  > Women’s, Gender & Sexuality Studies Program  > Women’s, Gender & Sexuality Studies, B.A.A major in Women’s, Gender & Sexuality Studies consists of 30 hours of designated WGSS courses (WGSS 2350 or 2360 + 27 additional hours, at least 21 of them advanced). The 21 advanced hours must include either 3350 or 3360; either 3321 or 3322, or equivalent; 4350; and 4360; plus 5 approved electives. At least 21 of the 30 hours must be taken in residence. A maximum of nine semester hours of approved transfer substitutes will be accepted toward the major. A minimum grade of C (2.00) is required for a course to count toward the minor, and a minimum 2.00 grade point average is required for the minor.and\/oror(it is recommended that a course from the other category be taken as an elective)If not available, one of the following may be substituted:If not available, one of the following may be substituted:(includes a presentation of students’ work and includes primary-source analysis in the Shuart Women’s Archive in the UH Library)(includes a presentation of students’ work and includes primary-source analysis in the Shuart Women’s Archive in the UH Library)Choose from the following options to fulfill the remaining 5 course credits for the major:\n A. Senior Essay (one term) with approved faculty + 4 elective coursesB. Senior Thesis (two terms) for Honors credit with approved faculty + 3 elective coursesC. Five elective cross-listed courses from approved list, no more than 2 in one disciplineAt least two of a student’s electives must come from each area. (Humanities & Social Sciences). OR  Return to: Major and Minor Fields of Study Listed Alphabetically","World Cultures and Literatures":"College of Liberal Arts & Social Sciences  > Department of Modern and Classical Languages  > World Cultures and Literatures, B.A.The B.A. degree in World Cultures and Literatures is an interdisciplinary major in the department of Modern & Classical Languages. Students acquire expertise in a foreign language and cross-cultural communication skills through advanced coursework in foreign languages and world or area literary and cultural studies.In addition to the other requirements for the Bachelor of Arts, students will complete 27 semester hours in the specific track they select. Required courses for each track are specified below.The Bachelor of Arts in World Cultures and Literatures offers the following tracks:Majors must earn at least a 2.50 cumulative grade point average in all courses counting toward the major track requirements.Twelve credit hours chosen according to the student’s declared program emphasis (with approval of WCL undergraduate director), selected from the following list:Six credit hours selected from the following list:Three credit hours selected from the following list:Six credit hours of 4000-level GERM courses (taught in German), selected from the following list:Nine credit hours of film courses selected from the following list:Topic:Three credit hours selected from the following list:Three credit hours in a 4000-level capstone course.Nine credit hours from the following list:Six credit hours from the following list:Three credit hours taken from:Six credit hours taken from:Six credit hours taken from:Six credit hours taken from: Taught in English, but requiring (for minors and majors) a substantial amount of written work in Italian, selected fromSix credit hours taken from:(students can also substitute courses listed in item 2 and 3 that have not been taken or other courses with the consent of the program director).Three credit hours in a 4000-level capstone course.Eighteen hours selected from the following list:Three hours in a 4000-level capstone course.Twelve credit hours selected from the following list: Return to: Major and Minor Fields of Study Listed Alphabetically"}}